const allTestCasesData =
[
  {
    "gender": "M",
    "level": "Beginner",
    "split_id": "SPLIT",
    "freq": 3,
    "routine": {
      "Day 1": [
        "벤치프레스",
        "인클라인 덤벨 벤치프레스",
        "오버헤드 프레스",
        "케이블 레터럴 레이즈",
        "덤벨 트라이셉 익스텐션"
      ],
      "Day 2": [
        "랫풀다운",
        "덤벨 로우",
        "시티드 케이블 로우",
        "백 익스텐션",
        "인클라인 덤벨 컬"
      ],
      "Day 3": [
        "레그 프레스",
        "덤벨 스쿼트",
        "에어 스쿼트",
        "힙 쓰러스트",
        "레그 익스텐션"
      ]
    }
  },
  {
    "gender": "M",
    "level": "Beginner",
    "split_id": "SPLIT",
    "freq": 4,
    "routine": {
      "Day 1": [
        "레그 프레스",
        "맨몸 레터럴 런지",
        "에어 스쿼트",
        "힙 쓰러스트",
        "덩키 킥"
      ],
      "Day 2": [
        "푸시업",
        "체스트 프레스 머신",
        "인클라인 덤벨 벤치프레스",
        "어시스트 딥스 머신",
        "덤벨 플라이"
      ],
      "Day 3": [
        "바벨 로우",
        "랫풀다운",
        "티바 로우 머신",
        "시티드 케이블 로우",
        "백 익스텐션"
      ],
      "Day 4": [
        "덤벨 숄더 프레스",
        "리어 델토이드 플라이 머신",
        "벤트오버 덤벨 레터럴 레이즈",
        "시티드 덤벨 레터럴 레이즈",
        "케이블 레터럴 레이즈"
      ]
    }
  },
  {
    "gender": "M",
    "level": "Beginner",
    "split_id": "SPLIT",
    "freq": 5,
    "routine": {
      "Day 1": [
        "레그 프레스",
        "맨몸 레터럴 런지",
        "에어 스쿼트",
        "힙 쓰러스트",
        "덩키 킥"
      ],
      "Day 2": [
        "푸시업",
        "덤벨 벤치프레스",
        "체스트 프레스 머신",
        "인클라인 벤치프레스 머신",
        "케이블 크로스오버"
      ],
      "Day 3": [
        "바벨 로우",
        "랫풀다운",
        "티바 로우 머신",
        "체스트 서포티드 티바 로우",
        "시티드 케이블 로우"
      ],
      "Day 4": [
        "덤벨 숄더 프레스",
        "오버헤드 프레스",
        "벤트오버 덤벨 레터럴 레이즈",
        "시티드 덤벨 레터럴 레이즈",
        "케이블 레터럴 레이즈"
      ],
      "Day 5": [
        "이지바 컬",
        "덤벨 컬",
        "복근 크런치 머신",
        "크런치",
        "레그 레이즈"
      ]
    }
  },
  {
    "gender": "M",
    "level": "Beginner",
    "split_id": "FB",
    "freq": 2,
    "routine": {
      "Day 1": [
        "레그 프레스",
        "벤치프레스",
        "랫풀다운",
        "이지바 컬",
        "크런치"
      ],
      "Day 2": [
        "에어 스쿼트",
        "덤벨 벤치프레스",
        "덤벨 로우",
        "덤벨 컬",
        "레그 레이즈"
      ]
    }
  },
  {
    "gender": "M",
    "level": "Beginner",
    "split_id": "FB",
    "freq": 3,
    "routine": {
      "Day 1": [
        "에어 스쿼트",
        "벤치프레스",
        "랫풀다운",
        "시티드 덤벨 레터럴 레이즈",
        "브이 업"
      ],
      "Day 2": [
        "레그 프레스",
        "덤벨 벤치프레스",
        "바벨 로우",
        "인클라인 덤벨 숄더 프레스",
        "케이블 크런치"
      ],
      "Day 3": [
        "에어 스쿼트",
        "체스트 프레스 머신",
        "랫풀다운",
        "시티드 덤벨 레터럴 레이즈",
        "복근 크런치 머신"
      ]
    }
  },
  {
    "gender": "M",
    "level": "Beginner",
    "split_id": "FB",
    "freq": 4,
    "routine": {
      "Day 1": [
        "레그 프레스",
        "체스트 프레스 머신",
        "랫풀다운",
        "케이블 컬",
        "싯업"
      ],
      "Day 2": [
        "레그 프레스",
        "체스트 프레스 머신",
        "랫풀다운",
        "케이블 컬",
        "싯업"
      ],
      "Day 3": [
        "레그 프레스",
        "체스트 프레스 머신",
        "랫풀다운",
        "케이블 컬",
        "싯업"
      ],
      "Day 4": [
        "레그 프레스",
        "체스트 프레스 머신",
        "랫풀다운",
        "케이블 컬",
        "싯업"
      ]
    }
  },
  {
    "gender": "M",
    "level": "Beginner",
    "split_id": "FB",
    "freq": 5,
    "routine": {
      "Day 1": [
        "에어 스쿼트",
        "체스트 프레스 머신",
        "랫풀다운",
        "덤벨 숄더 프레스",
        "토르소 로테이션 머신"
      ],
      "Day 2": [
        "레그 프레스",
        "체스트 프레스 머신",
        "랫풀다운",
        "시티드 덤벨 숄더 프레스",
        "레그 레이즈"
      ],
      "Day 3": [
        "레그 프레스",
        "체스트 프레스 머신",
        "랫풀다운",
        "시티드 덤벨 숄더 프레스",
        "싯업"
      ],
      "Day 4": [
        "레그 프레스",
        "체스트 프레스 머신",
        "랫풀다운",
        "시티드 덤벨 리어 레터럴 레이즈",
        "크런치"
      ],
      "Day 5": [
        "레그 프레스",
        "체스트 프레스 머신",
        "랫풀다운",
        "시티드 덤벨 리어 레터럴 레이즈",
        "복근 크런치 머신"
      ]
    }
  },
  {
    "gender": "M",
    "level": "Novice",
    "split_id": "SPLIT",
    "freq": 2,
    "routine": {
      "Day 1": [
        "체스트 프레스 머신",
        "랫풀다운",
        "케이블 암 풀다운",
        "오버헤드 프레스",
        "바이셉 컬 머신"
      ],
      "Day 2": [
        "컨벤셔널 데드리프트",
        "힙 쓰러스트",
        "레그 익스텐션",
        "맨몸 카프 레이즈"
      ]
    }
  },
  {
    "gender": "M",
    "level": "Novice",
    "split_id": "SPLIT",
    "freq": 3,
    "routine": {
      "Day 1": [
        "벤치프레스",
        "인클라인 덤벨 벤치프레스",
        "덤벨 숄더 프레스",
        "이지바 트라이셉 익스텐션",
        "덤벨 트라이셉 익스텐션"
      ],
      "Day 2": [
        "랫풀다운",
        "덤벨 로우",
        "시티드 케이블 로우",
        "바벨 컬",
        "케이블 컬"
      ],
      "Day 3": [
        "컨벤셔널 데드리프트",
        "런지",
        "레그 프레스",
        "덤벨 스쿼트",
        "맨몸 카프 레이즈"
      ]
    }
  },
  {
    "gender": "M",
    "level": "Novice",
    "split_id": "SPLIT",
    "freq": 4,
    "routine": {
      "Day 1": [
        "컨벤셔널 데드리프트",
        "런지",
        "리버스 브이 스쿼트",
        "레그 프레스",
        "힙 쓰러스트"
      ],
      "Day 2": [
        "푸시업",
        "벤치프레스",
        "인클라인 덤벨 벤치프레스",
        "어시스트 딥스 머신",
        "케이블 크로스오버"
      ],
      "Day 3": [
        "바벨 로우",
        "랫풀다운",
        "티바 로우 머신",
        "덤벨 로우",
        "시티드 케이블 로우"
      ],
      "Day 4": [
        "페이스 풀",
        "덤벨 숄더 프레스",
        "시티드 덤벨 숄더 프레스",
        "리어 델토이드 플라이 머신",
        "케이블 레터럴 레이즈"
      ]
    }
  },
  {
    "gender": "M",
    "level": "Novice",
    "split_id": "SPLIT",
    "freq": 5,
    "routine": {
      "Day 1": [
        "컨벤셔널 데드리프트",
        "리버스 브이 스쿼트",
        "레그 프레스",
        "에어 스쿼트",
        "레그 익스텐션"
      ],
      "Day 2": [
        "벤치프레스",
        "인클라인 덤벨 벤치프레스",
        "인클라인 벤치프레스 머신",
        "체스트 프레스 머신",
        "어시스트 딥스 머신"
      ],
      "Day 3": [
        "풀업",
        "바벨 로우",
        "랫풀다운",
        "시티드 케이블 로우",
        "인버티드 로우"
      ],
      "Day 4": [
        "페이스 풀",
        "오버헤드 프레스",
        "시티드 덤벨 숄더 프레스",
        "벤트오버 덤벨 레터럴 레이즈",
        "케이블 레터럴 레이즈"
      ],
      "Day 5": [
        "덤벨 해머 컬",
        "바이셉 컬 머신",
        "복근 크런치 머신",
        "행잉 니 레이즈",
        "시티드 니업"
      ]
    }
  },
  {
    "gender": "M",
    "level": "Novice",
    "split_id": "FB",
    "freq": 2,
    "routine": {
      "Day 1": [
        "바벨 백스쿼트",
        "벤치프레스",
        "바벨 로우",
        "이지바 컬",
        "크런치"
      ],
      "Day 2": [
        "프론트 스쿼트",
        "덤벨 벤치프레스",
        "랫풀다운",
        "클로즈 그립 벤치프레스",
        "레그 레이즈"
      ]
    }
  },
  {
    "gender": "M",
    "level": "Novice",
    "split_id": "FB",
    "freq": 3,
    "routine": {
      "Day 1": [
        "프론트 스쿼트",
        "덤벨 벤치프레스",
        "랫풀다운",
        "시티드 덤벨 숄더 프레스",
        "레그 레이즈"
      ],
      "Day 2": [
        "컨벤셔널 데드리프트",
        "벤치프레스",
        "바벨 로우",
        "오버헤드 프레스",
        "토즈투 바"
      ],
      "Day 3": [
        "바벨 백스쿼트",
        "덤벨 벤치프레스",
        "랫풀다운",
        "덤벨 레터럴 레이즈",
        "크런치"
      ]
    }
  },
  {
    "gender": "M",
    "level": "Novice",
    "split_id": "FB",
    "freq": 4,
    "routine": {
      "Day 1": [
        "프론트 스쿼트",
        "덤벨 벤치프레스",
        "바벨 로우",
        "덤벨 숄더 프레스",
        "덤벨 컬"
      ],
      "Day 2": [
        "컨벤셔널 데드리프트",
        "체스트 프레스 머신",
        "랫풀다운",
        "시티드 덤벨 레터럴 레이즈",
        "이지바 트라이셉 익스텐션"
      ],
      "Day 3": [
        "바벨 백스쿼트",
        "덤벨 벤치프레스",
        "덤벨 로우",
        "시티드 덤벨 레터럴 레이즈",
        "덤벨 킥백"
      ],
      "Day 4": [
        "프론트 스쿼트",
        "체스트 프레스 머신",
        "바벨 로우",
        "오버헤드 프레스",
        "바벨 컬"
      ]
    }
  },
  {
    "gender": "M",
    "level": "Novice",
    "split_id": "FB",
    "freq": 5,
    "routine": {
      "Day 1": [
        "프론트 스쿼트",
        "덤벨 벤치프레스",
        "바벨 로우",
        "오버헤드 프레스",
        "행잉 니 레이즈"
      ],
      "Day 2": [
        "컨벤셔널 데드리프트",
        "벤치프레스",
        "랫풀다운",
        "시티드 덤벨 레터럴 레이즈",
        "레그 레이즈"
      ],
      "Day 3": [
        "바벨 백스쿼트",
        "덤벨 벤치프레스",
        "덤벨 로우",
        "벤트오버 덤벨 레터럴 레이즈",
        "복근 크런치 머신"
      ],
      "Day 4": [
        "컨벤셔널 데드리프트",
        "덤벨 벤치프레스",
        "랫풀다운",
        "시티드 덤벨 레터럴 레이즈",
        "행잉 레그 레이즈"
      ],
      "Day 5": [
        "프론트 스쿼트",
        "벤치프레스",
        "바벨 로우",
        "오버헤드 프레스",
        "싯업"
      ]
    }
  },
  {
    "gender": "M",
    "level": "Intermediate",
    "split_id": "SPLIT",
    "freq": 3,
    "routine": {
      "Day 1": [
        "덤벨 벤치프레스",
        "인클라인 덤벨 풀오버",
        "덤벨 플라이",
        "시티드 덤벨 숄더 프레스",
        "케이블 프론트 레이즈",
        "이지바 트라이셉 익스텐션"
      ],
      "Day 2": [
        "바벨 로우",
        "랫풀다운",
        "덤벨 로우",
        "랙풀",
        "시티드 케이블 로우",
        "암 컬 머신"
      ],
      "Day 3": [
        "컨벤셔널 데드리프트",
        "덤벨 스모 스쿼트",
        "바벨 런지",
        "레그 프레스",
        "케이블 풀 스루",
        "힙 어브덕션 머신"
      ]
    }
  },
  {
    "gender": "M",
    "level": "Intermediate",
    "split_id": "SPLIT",
    "freq": 4,
    "routine": {
      "Day 1": [
        "루마니안 데드리프트",
        "바벨 백스쿼트",
        "레그 프레스",
        "덤벨 런지",
        "케이블 풀 스루",
        "바벨 힙 쓰러스트"
      ],
      "Day 2": [
        "벤치프레스",
        "인클라인 덤벨 벤치프레스",
        "체스트 프레스 머신",
        "중량 딥스",
        "인클라인 덤벨 풀오버",
        "덤벨 플라이"
      ],
      "Day 3": [
        "풀업",
        "바벨 로우",
        "랫풀다운",
        "티바 로우 머신",
        "덤벨 로우",
        "시티드 케이블 로우"
      ],
      "Day 4": [
        "페이스 풀",
        "덤벨 숄더 프레스",
        "오버헤드 프레스",
        "벤트오버 덤벨 레터럴 레이즈",
        "바벨 프론트 레이즈",
        "케이블 레터럴 레이즈"
      ]
    }
  },
  {
    "gender": "M",
    "level": "Intermediate",
    "split_id": "SPLIT",
    "freq": 5,
    "routine": {
      "Day 1": [
        "컨벤셔널 데드리프트",
        "바벨 런지",
        "스미스머신 스쿼트",
        "덤벨 고블릿 스쿼트",
        "바벨 힙 쓰러스트",
        "힙 쓰러스트 머신"
      ],
      "Day 2": [
        "벤치프레스",
        "인클라인 덤벨 벤치프레스",
        "체스트 프레스 머신",
        "펙덱 플라이 머신",
        "덤벨 풀오버",
        "인클라인 덤벨 풀오버"
      ],
      "Day 3": [
        "중량 풀업",
        "바벨 로우",
        "친업",
        "랫풀다운",
        "티바 로우 머신",
        "시티드 로우 머신"
      ],
      "Day 4": [
        "케이블 리버스 플라이",
        "시티드 덤벨 숄더 프레스",
        "오버헤드 프레스",
        "벤트오버 덤벨 레터럴 레이즈",
        "덤벨 레터럴 레이즈",
        "덤벨 프론트 레이즈"
      ],
      "Day 5": [
        "이지바 컬",
        "바이셉 컬 머신",
        "덤벨 컬",
        "토즈투 바",
        "케이블 크런치",
        "행잉 니 레이즈"
      ]
    }
  },
  {
    "gender": "M",
    "level": "Intermediate",
    "split_id": "FB",
    "freq": 2,
    "routine": {
      "Day 1": [
        "바벨 백스쿼트",
        "벤치프레스",
        "랫풀다운",
        "덤벨 레터럴 레이즈",
        "바벨 컬",
        "케이블 크런치"
      ],
      "Day 2": [
        "프론트 스쿼트",
        "덤벨 벤치프레스",
        "바벨 로우",
        "케이블 프론트 레이즈",
        "덤벨 트라이셉 익스텐션",
        "토즈투 바"
      ]
    }
  },
  {
    "gender": "M",
    "level": "Intermediate",
    "split_id": "FB",
    "freq": 3,
    "routine": {
      "Day 1": [
        "바벨 백스쿼트",
        "덤벨 벤치프레스",
        "랫풀다운",
        "덤벨 숄더 프레스",
        "바벨 컬",
        "행잉 레그 레이즈"
      ],
      "Day 2": [
        "컨벤셔널 데드리프트",
        "체스트 프레스 머신",
        "바벨 로우",
        "시티드 덤벨 레터럴 레이즈",
        "덤벨 트라이셉 익스텐션",
        "복근 크런치 머신"
      ],
      "Day 3": [
        "프론트 스쿼트",
        "덤벨 벤치프레스",
        "랫풀다운",
        "덤벨 슈러그",
        "케이블 푸시 다운",
        "토즈투 바"
      ]
    }
  },
  {
    "gender": "M",
    "level": "Intermediate",
    "split_id": "FB",
    "freq": 4,
    "routine": {
      "Day 1": [
        "컨벤셔널 데드리프트",
        "벤치프레스",
        "바벨 로우",
        "바벨 인클라인 프론트 레이즈",
        "덤벨 컬",
        "케이블 크런치"
      ],
      "Day 2": [
        "프론트 스쿼트",
        "덤벨 벤치프레스",
        "덤벨 로우",
        "덤벨 레터럴 레이즈",
        "이지바 트라이셉 익스텐션",
        "복근 크런치 머신"
      ],
      "Day 3": [
        "바벨 백스쿼트",
        "체스트 프레스 머신",
        "랫풀다운",
        "시티드 덤벨 숄더 프레스",
        "덤벨 해머 컬",
        "토즈투 바"
      ],
      "Day 4": [
        "컨벤셔널 데드리프트",
        "체스트 프레스 머신",
        "바벨 로우",
        "바벨 인클라인 프론트 레이즈",
        "바벨 컬",
        "복근 크런치 머신"
      ]
    }
  },
  {
    "gender": "M",
    "level": "Intermediate",
    "split_id": "FB",
    "freq": 5,
    "routine": {
      "Day 1": [
        "컨벤셔널 데드리프트",
        "벤치프레스",
        "랫풀다운",
        "바벨 프론트 레이즈",
        "이지바 컬",
        "행잉 니 레이즈"
      ],
      "Day 2": [
        "프론트 스쿼트",
        "덤벨 벤치프레스",
        "바벨 로우",
        "시티드 덤벨 레터럴 레이즈",
        "덤벨 리스트 컬",
        "케이블 크런치"
      ],
      "Day 3": [
        "바벨 백스쿼트",
        "벤치프레스",
        "바벨 로우",
        "케이블 레터럴 레이즈",
        "이지바 프리쳐 컬",
        "토즈투 바"
      ],
      "Day 4": [
        "프론트 스쿼트",
        "벤치프레스",
        "랫풀다운",
        "덤벨 숄더 프레스",
        "인클라인 덤벨 컬",
        "복근 크런치 머신"
      ],
      "Day 5": [
        "바벨 백스쿼트",
        "덤벨 벤치프레스",
        "바벨 로우",
        "리어 델토이드 플라이 머신",
        "케이블 푸시 다운",
        "중량 디클라인 싯업"
      ]
    }
  },
  {
    "gender": "M",
    "level": "Advanced",
    "split_id": "SPLIT",
    "freq": 2,
    "routine": {
      "Day 1": [
        "벤치프레스",
        "랫풀다운",
        "시티드 케이블 로우",
        "오버헤드 프레스",
        "케이블 레터럴 레이즈",
        "바벨 컬"
      ],
      "Day 2": [
        "컨벤셔널 데드리프트",
        "덤벨 스모 데드리프트",
        "레그 프레스",
        "덤벨 스쿼트",
        "힙 쓰러스트 머신",
        "레그 익스텐션"
      ]
    }
  },
  {
    "gender": "M",
    "level": "Advanced",
    "split_id": "SPLIT",
    "freq": 3,
    "routine": {
      "Day 1": [
        "벤치프레스",
        "인클라인 덤벨 벤치프레스",
        "오버헤드 프레스",
        "덤벨 레터럴 레이즈",
        "클로즈 그립 벤치프레스",
        "덤벨 트라이셉 익스텐션"
      ],
      "Day 2": [
        "바벨 로우",
        "랫풀다운",
        "덤벨 로우",
        "시티드 케이블 로우",
        "바이셉 컬 머신"
      ],
      "Day 3": [
        "컨벤셔널 데드리프트",
        "덤벨 스모 스쿼트",
        "레그 프레스",
        "덤벨 런지",
        "바벨 힙 쓰러스트",
        "덤벨 스탠딩 카프 레이즈"
      ]
    }
  },
  {
    "gender": "M",
    "level": "Advanced",
    "split_id": "SPLIT",
    "freq": 4,
    "routine": {
      "Day 1": [
        "덤벨 스모 데드리프트",
        "바벨 백스쿼트",
        "덤벨 스쿼트",
        "바벨 힙 쓰러스트",
        "힙 쓰러스트 머신",
        "레그 익스텐션"
      ],
      "Day 2": [
        "벤치프레스",
        "인클라인 덤벨 벤치프레스",
        "체스트 프레스 머신",
        "인클라인 체스트 프레스 머신",
        "중량 딥스",
        "덤벨 플라이"
      ],
      "Day 3": [
        "바벨 로우",
        "친업",
        "랫풀다운",
        "시티드 로우 머신",
        "덤벨 로우",
        "케이블 암 풀다운"
      ],
      "Day 4": [
        "페이스 풀",
        "오버헤드 프레스",
        "시티드 덤벨 숄더 프레스",
        "벤트오버 덤벨 레터럴 레이즈",
        "덤벨 레터럴 레이즈",
        "케이블 레터럴 레이즈"
      ]
    }
  },
  {
    "gender": "M",
    "level": "Advanced",
    "split_id": "SPLIT",
    "freq": 5,
    "routine": {
      "Day 1": [
        "루마니안 데드리프트",
        "바벨 백스쿼트",
        "레그 프레스",
        "덤벨 스쿼트",
        "바벨 힙 쓰러스트",
        "힙 쓰러스트 머신"
      ],
      "Day 2": [
        "덤벨 벤치프레스",
        "체스트 프레스 머신",
        "인클라인 벤치프레스 머신",
        "중량 딥스",
        "어시스트 딥스 머신",
        "덤벨 플라이"
      ],
      "Day 3": [
        "풀업",
        "바벨 로우",
        "친업",
        "랫풀다운",
        "티바 로우 머신",
        "시티드 케이블 로우"
      ],
      "Day 4": [
        "페이스 풀",
        "시티드 덤벨 숄더 프레스",
        "오버헤드 프레스",
        "덤벨 레터럴 레이즈",
        "케이블 레터럴 레이즈",
        "바벨 슈러그"
      ],
      "Day 5": [
        "이지바 컬",
        "덤벨 컬",
        "케이블 컬",
        "복근 크런치 머신",
        "케이블 크런치",
        "중량 디클라인 싯업"
      ]
    }
  },
  {
    "gender": "M",
    "level": "Advanced",
    "split_id": "FB",
    "freq": 2,
    "routine": {
      "Day 1": [
        "바벨 백스쿼트",
        "레그 프레스",
        "벤치프레스",
        "랫풀다운",
        "바벨 컬",
        "케이블 크런치"
      ],
      "Day 2": [
        "프론트 스쿼트",
        "덤벨 벤치프레스",
        "바벨 로우",
        "덤벨 숄더 프레스",
        "덤벨 트라이셉 익스텐션",
        "복근 크런치 머신"
      ]
    }
  },
  {
    "gender": "M",
    "level": "Advanced",
    "split_id": "FB",
    "freq": 3,
    "routine": {
      "Day 1": [
        "바벨 백스쿼트",
        "벤치프레스",
        "랫풀다운",
        "덤벨 숄더 프레스",
        "바벨 컬",
        "케이블 크런치"
      ],
      "Day 2": [
        "프론트 스쿼트",
        "덤벨 벤치프레스",
        "바벨 로우",
        "시티드 덤벨 레터럴 레이즈",
        "덤벨 트라이셉 익스텐션",
        "복근 크런치 머신"
      ],
      "Day 3": [
        "컨벤셔널 데드리프트",
        "벤치프레스",
        "랫풀다운",
        "케이블 레터럴 레이즈",
        "이지바 라잉 트라이셉 익스텐션",
        "토즈투 바"
      ]
    }
  },
  {
    "gender": "M",
    "level": "Advanced",
    "split_id": "FB",
    "freq": 4,
    "routine": {
      "Day 1": [
        "바벨 백스쿼트",
        "힙 쓰러스트 머신",
        "벤치프레스",
        "바벨 로우",
        "덤벨 숄더 프레스",
        "행잉 니 레이즈"
      ],
      "Day 2": [
        "루마니안 데드리프트",
        "바벨 백스쿼트",
        "덤벨 벤치프레스",
        "랫풀다운",
        "덤벨 레터럴 레이즈",
        "케이블 크런치"
      ],
      "Day 3": [
        "레그 프레스",
        "프론트 스쿼트",
        "덤벨 벤치프레스",
        "바벨 로우",
        "시티드 덤벨 레터럴 레이즈",
        "토즈투 바"
      ],
      "Day 4": [
        "루마니안 데드리프트",
        "바벨 백스쿼트",
        "덤벨 벤치프레스",
        "덤벨 로우",
        "덤벨 숄더 프레스",
        "복근 크런치 머신"
      ]
    }
  },
  {
    "gender": "M",
    "level": "Advanced",
    "split_id": "FB",
    "freq": 5,
    "routine": {
      "Day 1": [
        "바벨 백스쿼트",
        "벤치프레스",
        "랫풀다운",
        "오버헤드 프레스",
        "클로즈 그립 벤치프레스",
        "토즈투 바"
      ],
      "Day 2": [
        "바벨 백스쿼트",
        "덤벨 벤치프레스",
        "바벨 로우",
        "케이블 레터럴 레이즈",
        "이지바 컬",
        "케이블 크런치"
      ],
      "Day 3": [
        "프론트 스쿼트",
        "벤치프레스",
        "랫풀다운",
        "시티드 덤벨 숄더 프레스",
        "바벨 컬",
        "복근 크런치 머신"
      ],
      "Day 4": [
        "컨벤셔널 데드리프트",
        "덤벨 벤치프레스",
        "랫풀다운",
        "페이스 풀",
        "덤벨 프리쳐 컬",
        "행잉 니 레이즈"
      ],
      "Day 5": [
        "바벨 백스쿼트",
        "벤치프레스",
        "바벨 로우",
        "덤벨 레터럴 레이즈",
        "케이블 푸시 다운",
        "토르소 로테이션 머신"
      ]
    }
  },
  {
    "gender": "M",
    "level": "Elite",
    "split_id": "SPLIT",
    "freq": 2,
    "routine": {
      "Day 1": [
        "덤벨 벤치프레스",
        "랫풀다운",
        "시티드 케이블 로우",
        "케이블 암 풀다운",
        "시티드 덤벨 숄더 프레스",
        "덤벨 컬"
      ],
      "Day 2": [
        "루마니안 데드리프트",
        "바벨 백스쿼트",
        "레그 프레스",
        "덤벨 런지",
        "수평 레그 프레스",
        "바벨 힙 쓰러스트"
      ]
    }
  },
  {
    "gender": "M",
    "level": "Elite",
    "split_id": "SPLIT",
    "freq": 4,
    "routine": {
      "Day 1": [
        "컨벤셔널 데드리프트",
        "레그 프레스",
        "케이블 풀 스루",
        "바벨 힙 쓰러스트",
        "레그 컬"
      ],
      "Day 2": [
        "벤치프레스",
        "인클라인 덤벨 벤치프레스",
        "체스트 프레스 머신",
        "덤벨 풀오버",
        "어시스트 딥스 머신",
        "덤벨 플라이"
      ],
      "Day 3": [
        "바벨 로우",
        "친업",
        "랫풀다운",
        "랙풀",
        "시티드 케이블 로우",
        "케이블 암 풀다운"
      ],
      "Day 4": [
        "페이스 풀",
        "오버헤드 프레스",
        "덤벨 숄더 프레스",
        "숄더 프레스 머신",
        "벤트오버 덤벨 레터럴 레이즈",
        "케이블 레터럴 레이즈"
      ]
    }
  },
  {
    "gender": "M",
    "level": "Elite",
    "split_id": "SPLIT",
    "freq": 5,
    "routine": {
      "Day 1": [
        "컨벤셔널 데드리프트",
        "바벨 런지",
        "바벨 힙 쓰러스트",
        "힙 쓰러스트 머신",
        "레그 컬",
        "레그 익스텐션"
      ],
      "Day 2": [
        "덤벨 벤치프레스",
        "인클라인 벤치프레스",
        "인클라인 벤치프레스 머신",
        "체스트 프레스 머신",
        "디클라인 체스트 프레스 머신",
        "덤벨 풀오버"
      ],
      "Day 3": [
        "중량 친업",
        "바벨 로우",
        "친업",
        "랫풀다운",
        "티바 로우 머신",
        "시티드 로우 머신"
      ],
      "Day 4": [
        "케이블 리버스 플라이",
        "페이스 풀",
        "시티드 덤벨 숄더 프레스",
        "덤벨 레터럴 레이즈",
        "바벨 프론트 레이즈",
        "덤벨 슈러그"
      ],
      "Day 5": [
        "덤벨 컬",
        "케이블 컬",
        "덤벨 킥백",
        "토즈투 바",
        "복근 크런치 머신"
      ]
    }
  },
  {
    "gender": "M",
    "level": "Elite",
    "split_id": "FB",
    "freq": 2,
    "routine": {
      "Day 1": [
        "컨벤셔널 데드리프트",
        "벤치프레스",
        "바벨 로우",
        "바벨 인클라인 프론트 레이즈",
        "덤벨 컬",
        "케이블 크런치"
      ],
      "Day 2": [
        "프론트 스쿼트",
        "덤벨 벤치프레스",
        "덤벨 로우",
        "덤벨 레터럴 레이즈",
        "컨센트레이션 컬",
        "토즈투 바"
      ]
    }
  },
  {
    "gender": "M",
    "level": "Elite",
    "split_id": "FB",
    "freq": 3,
    "routine": {
      "Day 1": [
        "바벨 백스쿼트",
        "벤치프레스",
        "바벨 로우",
        "덤벨 숄더 프레스",
        "이지바 프리쳐 컬",
        "토즈투 바"
      ],
      "Day 2": [
        "컨벤셔널 데드리프트",
        "덤벨 벤치프레스",
        "덤벨 로우",
        "덤벨 레터럴 레이즈",
        "덤벨 트라이셉 익스텐션",
        "행잉 니 레이즈"
      ],
      "Day 3": [
        "프론트 스쿼트",
        "벤치프레스",
        "랫풀다운",
        "케이블 프론트 레이즈",
        "바이셉 컬 머신",
        "복근 크런치 머신"
      ]
    }
  },
  {
    "gender": "M",
    "level": "Elite",
    "split_id": "FB",
    "freq": 4,
    "routine": {
      "Day 1": [
        "바벨 백스쿼트",
        "덤벨 벤치프레스",
        "랫풀다운",
        "시티드 덤벨 숄더 프레스",
        "이지바 트라이셉 익스텐션",
        "행잉 레그 레이즈"
      ],
      "Day 2": [
        "컨벤셔널 데드리프트",
        "벤치프레스",
        "바벨 로우",
        "덤벨 레터럴 레이즈",
        "덤벨 컬",
        "복근 크런치 머신"
      ],
      "Day 3": [
        "프론트 스쿼트",
        "벤치프레스",
        "랫풀다운",
        "케이블 프론트 레이즈",
        "케이블 컬",
        "토즈투 바"
      ],
      "Day 4": [
        "바벨 백스쿼트",
        "덤벨 벤치프레스",
        "바벨 로우",
        "덤벨 숄더 프레스",
        "덤벨 해머 컬",
        "케이블 크런치"
      ]
    }
  },
  {
    "gender": "M",
    "level": "Elite",
    "split_id": "FB",
    "freq": 5,
    "routine": {
      "Day 1": [
        "바벨 백스쿼트",
        "덤벨 벤치프레스",
        "바벨 로우",
        "오버헤드 프레스",
        "덤벨 컬",
        "케이블 크런치"
      ],
      "Day 2": [
        "프론트 스쿼트",
        "벤치프레스",
        "랫풀다운",
        "인클라인 덤벨 숄더 프레스",
        "이지바 프리쳐 컬",
        "복근 크런치 머신"
      ],
      "Day 3": [
        "컨벤셔널 데드리프트",
        "덤벨 벤치프레스",
        "바벨 로우",
        "시티드 덤벨 숄더 프레스",
        "바벨 리스트 컬",
        "토즈투 바"
      ],
      "Day 4": [
        "바벨 백스쿼트",
        "덤벨 벤치프레스",
        "바벨 로우",
        "오버헤드 프레스",
        "컨센트레이션 컬",
        "중량 디클라인 싯업"
      ],
      "Day 5": [
        "프론트 스쿼트",
        "덤벨 벤치프레스",
        "랫풀다운",
        "인클라인 덤벨 숄더 프레스",
        "덤벨 해머 컬",
        "복근 크런치 머신"
      ]
    }
  },
  {
    "gender": "F",
    "level": "Beginner",
    "split_id": "SPLIT",
    "freq": 2,
    "routine": {
      "Day 1": [
        "체스트 프레스 머신",
        "랫풀다운",
        "시티드 케이블 로우",
        "덤벨 숄더 프레스",
        "바이셉 컬 머신"
      ],
      "Day 2": [
        "덤벨 런지",
        "에어 스쿼트",
        "힙 어브덕션 머신",
        "레그 익스텐션",
        "덤벨 스탠딩 카프 레이즈"
      ]
    }
  },
  {
    "gender": "F",
    "level": "Beginner",
    "split_id": "SPLIT",
    "freq": 3,
    "routine": {
      "Day 1": [
        "체스트 프레스 머신",
        "인클라인 덤벨 벤치프레스",
        "시티드 덤벨 숄더 프레스",
        "케이블 레터럴 레이즈",
        "이지바 라잉 트라이셉 익스텐션"
      ],
      "Day 2": [
        "랫풀다운",
        "시티드 로우 머신",
        "하이 로우 머신",
        "덤벨 컬",
        "케이블 컬"
      ],
      "Day 3": [
        "런지",
        "레그 프레스",
        "덤벨 스쿼트",
        "힙 어브덕션 머신",
        "맨몸 카프 레이즈"
      ]
    }
  },
  {
    "gender": "F",
    "level": "Beginner",
    "split_id": "SPLIT",
    "freq": 4,
    "routine": {
      "Day 1": [
        "레그 프레스",
        "맨몸 레터럴 런지",
        "스미스머신 힙 쓰러스트",
        "에어 스쿼트",
        "힙 쓰러스트 머신"
      ],
      "Day 2": [
        "덤벨 벤치프레스",
        "체스트 프레스 머신",
        "인클라인 벤치프레스 머신",
        "펙덱 플라이 머신",
        "어시스트 딥스 머신"
      ],
      "Day 3": [
        "랫풀다운",
        "티바 로우 머신",
        "시티드 케이블 로우",
        "인버티드 로우",
        "백 익스텐션"
      ],
      "Day 4": [
        "덤벨 숄더 프레스",
        "시티드 덤벨 숄더 프레스",
        "리어 델토이드 플라이 머신",
        "시티드 덤벨 리어 레터럴 레이즈",
        "케이블 레터럴 레이즈"
      ]
    }
  },
  {
    "gender": "F",
    "level": "Beginner",
    "split_id": "SPLIT",
    "freq": 5,
    "routine": {
      "Day 1": [
        "런지",
        "레그 프레스",
        "에어 스쿼트",
        "힙 쓰러스트",
        "덩키 킥"
      ],
      "Day 2": [
        "체스트 프레스 머신",
        "인클라인 덤벨 벤치프레스",
        "인클라인 체스트 프레스 머신",
        "어시스트 딥스 머신",
        "인클라인 케이블 플라이"
      ],
      "Day 3": [
        "랫풀다운",
        "티바 로우 머신",
        "시티드 로우 머신",
        "덤벨 로우",
        "인버티드 로우"
      ],
      "Day 4": [
        "덤벨 숄더 프레스",
        "벤트오버 덤벨 레터럴 레이즈",
        "시티드 덤벨 레터럴 레이즈",
        "케이블 레터럴 레이즈"
      ],
      "Day 5": [
        "이지바 컬",
        "덤벨 컬",
        "크런치",
        "행잉 니 레이즈",
        "시티드 니업"
      ]
    }
  },
  {
    "gender": "F",
    "level": "Beginner",
    "split_id": "FB",
    "freq": 2,
    "routine": {
      "Day 1": [
        "레그 프레스",
        "체스트 프레스 머신",
        "랫풀다운",
        "시티드 덤벨 숄더 프레스",
        "크런치"
      ],
      "Day 2": [
        "덤벨 런지",
        "덤벨 벤치프레스",
        "덤벨 로우",
        "벤트오버 덤벨 레터럴 레이즈",
        "싯업"
      ]
    }
  },
  {
    "gender": "F",
    "level": "Beginner",
    "split_id": "FB",
    "freq": 3,
    "routine": {
      "Day 1": [
        "에어 스쿼트",
        "체스트 프레스 머신",
        "랫풀다운",
        "덤벨 컬",
        "브이 업"
      ],
      "Day 2": [
        "레그 프레스",
        "덤벨 벤치프레스",
        "덤벨 로우",
        "케이블 컬",
        "행잉 니 레이즈"
      ],
      "Day 3": [
        "덤벨 런지",
        "체스트 프레스 머신",
        "랫풀다운",
        "덤벨 트라이셉 익스텐션",
        "복근 크런치 머신"
      ]
    }
  },
  {
    "gender": "F",
    "level": "Beginner",
    "split_id": "FB",
    "freq": 4,
    "routine": {
      "Day 1": [
        "스미스머신 스쿼트",
        "덤벨 벤치프레스",
        "랫풀다운",
        "덤벨 숄더 프레스",
        "덤벨 컬"
      ],
      "Day 2": [
        "덤벨 고블릿 스쿼트",
        "체스트 프레스 머신",
        "덤벨 로우",
        "케이블 레터럴 레이즈",
        "케이블 컬"
      ],
      "Day 3": [
        "레그 프레스",
        "덤벨 벤치프레스",
        "랫풀다운",
        "덤벨 숄더 프레스",
        "덤벨 해머 컬"
      ],
      "Day 4": [
        "에어 스쿼트",
        "체스트 프레스 머신",
        "바벨 로우",
        "리어 델토이드 플라이 머신",
        "이지바 프리쳐 컬"
      ]
    }
  },
  {
    "gender": "F",
    "level": "Beginner",
    "split_id": "FB",
    "freq": 5,
    "routine": {
      "Day 1": [
        "에어 스쿼트",
        "체스트 프레스 머신",
        "랫풀다운",
        "덤벨 숄더 프레스",
        "힐 터치"
      ],
      "Day 2": [
        "덤벨 런지",
        "덤벨 벤치프레스",
        "덤벨 로우",
        "덤벨 레터럴 레이즈",
        "복근 크런치 머신"
      ],
      "Day 3": [
        "레그 프레스",
        "체스트 프레스 머신",
        "랫풀다운",
        "덤벨 숄더 프레스",
        "행잉 레그 레이즈"
      ],
      "Day 4": [
        "에어 스쿼트",
        "덤벨 벤치프레스",
        "랫풀다운",
        "덤벨 레터럴 레이즈",
        "복근 크런치 머신"
      ],
      "Day 5": [
        "레그 프레스",
        "체스트 프레스 머신",
        "랫풀다운",
        "덤벨 숄더 프레스",
        "힐 터치"
      ]
    }
  },
  {
    "gender": "F",
    "level": "Novice",
    "split_id": "SPLIT",
    "freq": 2,
    "routine": {
      "Day 1": [
        "벤치프레스",
        "랫풀다운",
        "케이블 암 풀다운",
        "시티드 덤벨 숄더 프레스",
        "바벨 컬"
      ],
      "Day 2": [
        "컨벤셔널 데드리프트",
        "리버스 브이 스쿼트",
        "레그 익스텐션",
        "레그 컬",
        "맨몸 카프 레이즈"
      ]
    }
  },
  {
    "gender": "F",
    "level": "Novice",
    "split_id": "SPLIT",
    "freq": 3,
    "routine": {
      "Day 1": [
        "벤치프레스",
        "인클라인 덤벨 풀오버",
        "덤벨 플라이",
        "덤벨 숄더 프레스",
        "벤치 딥스"
      ],
      "Day 2": [
        "바벨 로우",
        "랫풀다운",
        "덤벨 로우",
        "시티드 케이블 로우",
        "덤벨 컬"
      ],
      "Day 3": [
        "컨벤셔널 데드리프트",
        "덤벨 런지",
        "바벨 박스 스쿼트",
        "덤벨 고블릿 스쿼트",
        "맨몸 카프 레이즈"
      ]
    }
  },
  {
    "gender": "F",
    "level": "Novice",
    "split_id": "SPLIT",
    "freq": 4,
    "routine": {
      "Day 1": [
        "바벨 백스쿼트",
        "레그 프레스",
        "덤벨 스쿼트",
        "바벨 힙 쓰러스트",
        "힙 쓰러스트 머신"
      ],
      "Day 2": [
        "푸시업",
        "덤벨 벤치프레스",
        "체스트 프레스 머신",
        "어시스트 딥스 머신",
        "덤벨 플라이"
      ],
      "Day 3": [
        "바벨 로우",
        "랫풀다운",
        "티바 로우 머신",
        "덤벨 로우",
        "시티드 케이블 로우"
      ],
      "Day 4": [
        "페이스 풀",
        "덤벨 숄더 프레스",
        "인클라인 덤벨 숄더 프레스",
        "숄더 프레스 머신",
        "시티드 덤벨 레터럴 레이즈"
      ]
    }
  },
  {
    "gender": "F",
    "level": "Novice",
    "split_id": "SPLIT",
    "freq": 5,
    "routine": {
      "Day 1": [
        "루마니안 데드리프트",
        "바벨 백스쿼트",
        "레그 프레스",
        "에어 스쿼트",
        "힙 쓰러스트"
      ],
      "Day 2": [
        "힌두 푸시업",
        "덤벨 벤치프레스",
        "체스트 프레스 머신",
        "덤벨 풀오버",
        "덤벨 플라이"
      ],
      "Day 3": [
        "바벨 로우",
        "랫풀다운",
        "티바 로우 머신",
        "로우 로우 머신",
        "시티드 케이블 로우"
      ],
      "Day 4": [
        "페이스 풀",
        "덤벨 숄더 프레스",
        "시티드 바벨 숄더 프레스",
        "오버헤드 프레스",
        "케이블 레터럴 레이즈"
      ],
      "Day 5": [
        "덤벨 컬",
        "케이블 컬",
        "행잉 레그 레이즈",
        "크런치",
        "레그 레이즈"
      ]
    }
  },
  {
    "gender": "F",
    "level": "Novice",
    "split_id": "FB",
    "freq": 2,
    "routine": {
      "Day 1": [
        "프론트 스쿼트",
        "덤벨 벤치프레스",
        "랫풀다운",
        "덤벨 레터럴 레이즈",
        "크런치"
      ],
      "Day 2": [
        "컨벤셔널 데드리프트",
        "벤치프레스",
        "바벨 로우",
        "바벨 프론트 레이즈",
        "브이 업"
      ]
    }
  },
  {
    "gender": "F",
    "level": "Novice",
    "split_id": "FB",
    "freq": 3,
    "routine": {
      "Day 1": [
        "컨벤셔널 데드리프트",
        "덤벨 벤치프레스",
        "랫풀다운",
        "바벨 인클라인 프론트 레이즈",
        "덤벨 컬"
      ],
      "Day 2": [
        "프론트 스쿼트",
        "덤벨 벤치프레스",
        "랫풀다운",
        "바벨 인클라인 프론트 레이즈",
        "덤벨 컬"
      ],
      "Day 3": [
        "프론트 스쿼트",
        "덤벨 벤치프레스",
        "랫풀다운",
        "바벨 인클라인 프론트 레이즈",
        "덤벨 컬"
      ]
    }
  },
  {
    "gender": "F",
    "level": "Novice",
    "split_id": "FB",
    "freq": 4,
    "routine": {
      "Day 1": [
        "바벨 백스쿼트",
        "덤벨 벤치프레스",
        "바벨 로우",
        "덤벨 숄더 프레스",
        "행잉 레그 레이즈"
      ],
      "Day 2": [
        "컨벤셔널 데드리프트",
        "벤치프레스",
        "덤벨 로우",
        "덤벨 레터럴 레이즈",
        "크런치"
      ],
      "Day 3": [
        "바벨 백스쿼트",
        "덤벨 벤치프레스",
        "바벨 로우",
        "덤벨 숄더 프레스",
        "레그 레이즈"
      ],
      "Day 4": [
        "컨벤셔널 데드리프트",
        "덤벨 벤치프레스",
        "바벨 로우",
        "덤벨 레터럴 레이즈",
        "시티드 니업"
      ]
    }
  },
  {
    "gender": "F",
    "level": "Novice",
    "split_id": "FB",
    "freq": 5,
    "routine": {
      "Day 1": [
        "바벨 백스쿼트",
        "벤치프레스",
        "랫풀다운",
        "덤벨 숄더 프레스",
        "시티드 니업"
      ],
      "Day 2": [
        "컨벤셔널 데드리프트",
        "덤벨 벤치프레스",
        "바벨 로우",
        "케이블 레터럴 레이즈",
        "브이 업"
      ],
      "Day 3": [
        "프론트 스쿼트",
        "덤벨 벤치프레스",
        "랫풀다운",
        "덤벨 프론트 레이즈",
        "크런치"
      ],
      "Day 4": [
        "바벨 백스쿼트",
        "벤치프레스",
        "바벨 로우",
        "시티드 덤벨 숄더 프레스",
        "복근 크런치 머신"
      ],
      "Day 5": [
        "프론트 스쿼트",
        "체스트 프레스 머신",
        "랫풀다운",
        "숄더 프레스 머신",
        "행잉 레그 레이즈"
      ]
    }
  },
  {
    "gender": "F",
    "level": "Intermediate",
    "split_id": "SPLIT",
    "freq": 2,
    "routine": {
      "Day 1": [
        "벤치프레스",
        "랫풀다운",
        "하이 로우 머신",
        "시티드 케이블 로우",
        "오버헤드 프레스",
        "바벨 컬"
      ],
      "Day 2": [
        "컨벤셔널 데드리프트",
        "레그 프레스",
        "덤벨 런지",
        "스미스머신 스쿼트",
        "바벨 힙 쓰러스트",
        "레그 익스텐션"
      ]
    }
  },
  {
    "gender": "F",
    "level": "Intermediate",
    "split_id": "SPLIT",
    "freq": 5,
    "routine": {
      "Day 1": [
        "루마니안 데드리프트",
        "덤벨 스모 데드리프트",
        "바벨 백스쿼트",
        "레그 프레스",
        "바벨 힙 쓰러스트",
        "힙 쓰러스트 머신"
      ],
      "Day 2": [
        "벤치프레스",
        "인클라인 덤벨 벤치프레스",
        "체스트 프레스 머신",
        "인클라인 체스트 프레스 머신",
        "중량 딥스",
        "덤벨 풀오버"
      ],
      "Day 3": [
        "중량 풀업",
        "바벨 로우",
        "친업",
        "랫풀다운",
        "티바 로우 머신",
        "시티드 케이블 로우"
      ],
      "Day 4": [
        "페이스 풀",
        "덤벨 숄더 프레스",
        "오버헤드 프레스",
        "시티드 덤벨 레터럴 레이즈",
        "바벨 프론트 레이즈",
        "케이블 레터럴 레이즈"
      ],
      "Day 5": [
        "케이블 해머컬",
        "이지바 컬",
        "덤벨 컬",
        "토즈투 바",
        "케이블 크런치",
        "복근 크런치 머신"
      ]
    }
  },
  {
    "gender": "F",
    "level": "Intermediate",
    "split_id": "FB",
    "freq": 2,
    "routine": {
      "Day 1": [
        "컨벤셔널 데드리프트",
        "벤치프레스",
        "랫풀다운",
        "덤벨 숄더 프레스",
        "덤벨 컬",
        "케이블 크런치"
      ],
      "Day 2": [
        "프론트 스쿼트",
        "덤벨 벤치프레스",
        "바벨 로우",
        "덤벨 레터럴 레이즈",
        "이지바 트라이셉 익스텐션",
        "토즈투 바"
      ]
    }
  },
  {
    "gender": "F",
    "level": "Intermediate",
    "split_id": "FB",
    "freq": 3,
    "routine": {
      "Day 1": [
        "바벨 백스쿼트",
        "덤벨 벤치프레스",
        "랫풀다운",
        "시티드 덤벨 숄더 프레스",
        "바이셉 컬 머신",
        "행잉 레그 레이즈"
      ],
      "Day 2": [
        "컨벤셔널 데드리프트",
        "벤치프레스",
        "바벨 로우",
        "케이블 레터럴 레이즈",
        "덤벨 해머 컬",
        "복근 크런치 머신"
      ],
      "Day 3": [
        "프론트 스쿼트",
        "덤벨 벤치프레스",
        "랫풀다운",
        "시티드 바벨 숄더 프레스",
        "바벨 리스트 컬",
        "토즈투 바"
      ]
    }
  },
  {
    "gender": "F",
    "level": "Intermediate",
    "split_id": "FB",
    "freq": 4,
    "routine": {
      "Day 1": [
        "바벨 백스쿼트",
        "덤벨 벤치프레스",
        "랫풀다운",
        "덤벨 숄더 프레스",
        "덤벨 컬",
        "케이블 크런치"
      ],
      "Day 2": [
        "프론트 스쿼트",
        "체스트 프레스 머신",
        "바벨 로우",
        "케이블 리버스 플라이",
        "이지바 트라이셉 익스텐션",
        "행잉 레그 레이즈"
      ],
      "Day 3": [
        "컨벤셔널 데드리프트",
        "덤벨 벤치프레스",
        "랫풀다운",
        "페이스 풀",
        "케이블 컬",
        "복근 크런치 머신"
      ],
      "Day 4": [
        "바벨 백스쿼트",
        "덤벨 벤치프레스",
        "바벨 로우",
        "리어 델토이드 플라이 머신",
        "이지바 프리쳐 컬",
        "토즈투 바"
      ]
    }
  },
  {
    "gender": "F",
    "level": "Intermediate",
    "split_id": "FB",
    "freq": 5,
    "routine": {
      "Day 1": [
        "바벨 백스쿼트",
        "벤치프레스",
        "바벨 로우",
        "덤벨 숄더 프레스",
        "이지바 컬",
        "케이블 크런치"
      ],
      "Day 2": [
        "프론트 스쿼트",
        "덤벨 벤치프레스",
        "랫풀다운",
        "케이블 레터럴 레이즈",
        "컨센트레이션 컬",
        "토즈투 바"
      ],
      "Day 3": [
        "컨벤셔널 데드리프트",
        "덤벨 벤치프레스",
        "바벨 로우",
        "리어 델토이드 플라이 머신",
        "바벨 컬",
        "행잉 니 레이즈"
      ],
      "Day 4": [
        "바벨 백스쿼트",
        "벤치프레스",
        "바벨 로우",
        "시티드 덤벨 레터럴 레이즈",
        "이지바 트라이셉 익스텐션",
        "복근 크런치 머신"
      ],
      "Day 5": [
        "프론트 스쿼트",
        "덤벨 벤치프레스",
        "랫풀다운",
        "페이스 풀",
        "덤벨 해머 컬",
        "행잉 레그 레이즈"
      ]
    }
  },
  {
    "gender": "F",
    "level": "Advanced",
    "split_id": "SPLIT",
    "freq": 2,
    "routine": {
      "Day 1": [
        "덤벨 벤치프레스",
        "중량 친업",
        "랫풀다운",
        "시티드 케이블 로우",
        "시티드 덤벨 숄더 프레스",
        "덤벨 컬"
      ],
      "Day 2": [
        "컨벤셔널 데드리프트",
        "바벨 스모 스쿼트",
        "바벨 런지",
        "레그 프레스",
        "케이블 풀 스루",
        "레그 익스텐션"
      ]
    }
  },
  {
    "gender": "F",
    "level": "Advanced",
    "split_id": "SPLIT",
    "freq": 4,
    "routine": {
      "Day 1": [
        "루마니안 데드리프트",
        "바벨 백스쿼트",
        "브이 스쿼트",
        "레그 프레스",
        "덤벨 런지",
        "바벨 힙 쓰러스트"
      ],
      "Day 2": [
        "벤치프레스",
        "인클라인 덤벨 벤치프레스",
        "중량 딥스",
        "덤벨 풀오버",
        "어시스트 딥스 머신",
        "덤벨 플라이"
      ],
      "Day 3": [
        "바벨 로우",
        "랫풀다운",
        "시티드 로우 머신",
        "시티드 로우 머신",
        "시티드 케이블 로우",
        "케이블 암 풀다운"
      ],
      "Day 4": [
        "페이스 풀",
        "오버헤드 프레스",
        "리어 델토이드 플라이 머신",
        "시티드 덤벨 숄더 프레스",
        "덤벨 레터럴 레이즈",
        "케이블 레터럴 레이즈"
      ]
    }
  },
  {
    "gender": "F",
    "level": "Advanced",
    "split_id": "SPLIT",
    "freq": 5,
    "routine": {
      "Day 1": [
        "컨벤셔널 데드리프트",
        "바벨 백스쿼트",
        "레그 프레스",
        "바벨 힙 쓰러스트",
        "힙 쓰러스트 머신",
        "힙 어덕션 머신"
      ],
      "Day 2": [
        "덤벨 벤치프레스",
        "인클라인 벤치프레스",
        "체스트 프레스 머신",
        "인클라인 벤치프레스 머신",
        "덤벨 풀오버",
        "덤벨 플라이"
      ],
      "Day 3": [
        "중량 풀업",
        "바벨 로우",
        "랫풀다운",
        "티바 로우 머신",
        "랙풀",
        "시티드 케이블 로우"
      ],
      "Day 4": [
        "케이블 리버스 플라이",
        "페이스 풀",
        "오버헤드 프레스",
        "시티드 덤벨 숄더 프레스",
        "덤벨 레터럴 레이즈",
        "바벨 프론트 레이즈"
      ],
      "Day 5": [
        "시티드 바벨 트라이셉 익스텐션",
        "컨센트레이션 컬",
        "덤벨 트라이셉 익스텐션",
        "토즈투 바",
        "케이블 크런치",
        "행잉 레그 레이즈"
      ]
    }
  },
  {
    "gender": "F",
    "level": "Advanced",
    "split_id": "FB",
    "freq": 2,
    "routine": {
      "Day 1": [
        "컨벤셔널 데드리프트",
        "벤치프레스",
        "바벨 로우",
        "덤벨 숄더 프레스",
        "덤벨 컬",
        "케이블 크런치"
      ],
      "Day 2": [
        "프론트 스쿼트",
        "덤벨 벤치프레스",
        "랫풀다운",
        "시티드 덤벨 레터럴 레이즈",
        "이지바 프리쳐 컬",
        "토즈투 바"
      ]
    }
  },
  {
    "gender": "F",
    "level": "Advanced",
    "split_id": "FB",
    "freq": 3,
    "routine": {
      "Day 1": [
        "바벨 백스쿼트",
        "벤치프레스",
        "랫풀다운",
        "덤벨 숄더 프레스",
        "이지바 프리쳐 컬",
        "케이블 크런치"
      ],
      "Day 2": [
        "프론트 스쿼트",
        "덤벨 벤치프레스",
        "바벨 로우",
        "케이블 레터럴 레이즈",
        "바벨 컬",
        "복근 크런치 머신"
      ],
      "Day 3": [
        "컨벤셔널 데드리프트",
        "벤치프레스",
        "랫풀다운",
        "시티드 덤벨 숄더 프레스",
        "덤벨 트라이셉 익스텐션",
        "토즈투 바"
      ]
    }
  },
  {
    "gender": "F",
    "level": "Advanced",
    "split_id": "FB",
    "freq": 4,
    "routine": {
      "Day 1": [
        "컨벤셔널 데드리프트",
        "벤치프레스",
        "랫풀다운",
        "시티드 바벨 숄더 프레스",
        "바벨 컬",
        "케이블 크런치"
      ],
      "Day 2": [
        "프론트 스쿼트",
        "덤벨 벤치프레스",
        "바벨 로우",
        "덤벨 레터럴 레이즈",
        "이지바 프리쳐 컬",
        "토즈투 바"
      ],
      "Day 3": [
        "바벨 백스쿼트",
        "체스트 프레스 머신",
        "덤벨 로우",
        "케이블 레터럴 레이즈",
        "덤벨 컬",
        "복근 크런치 머신"
      ],
      "Day 4": [
        "바벨 백스쿼트",
        "벤치프레스",
        "랫풀다운",
        "덤벨 숄더 프레스",
        "이지바 트라이셉 익스텐션",
        "행잉 니 레이즈"
      ]
    }
  },
  {
    "gender": "F",
    "level": "Advanced",
    "split_id": "FB",
    "freq": 5,
    "routine": {
      "Day 1": [
        "컨벤셔널 데드리프트",
        "벤치프레스",
        "바벨 로우",
        "덤벨 숄더 프레스",
        "덤벨 트라이셉 익스텐션",
        "복근 크런치 머신"
      ],
      "Day 2": [
        "프론트 스쿼트",
        "레그 컬",
        "덤벨 벤치프레스",
        "랫풀다운",
        "케이블 레터럴 레이즈",
        "복근 크런치 머신"
      ],
      "Day 3": [
        "루마니안 데드리프트",
        "바벨 백스쿼트",
        "덤벨 벤치프레스",
        "바벨 로우",
        "덤벨 숄더 프레스",
        "복근 크런치 머신"
      ],
      "Day 4": [
        "바벨 런지",
        "프론트 스쿼트",
        "벤치프레스",
        "랫풀다운",
        "케이블 레터럴 레이즈",
        "복근 크런치 머신"
      ],
      "Day 5": [
        "컨벤셔널 데드리프트",
        "벤치프레스",
        "바벨 로우",
        "덤벨 숄더 프레스",
        "덤벨 트라이셉 익스텐션",
        "복근 크런치 머신"
      ]
    }
  },
  {
    "gender": "F",
    "level": "Elite",
    "split_id": "SPLIT",
    "freq": 2,
    "routine": {
      "Day 1": [
        "벤치프레스",
        "중량 친업",
        "랫풀다운",
        "시티드 케이블 로우",
        "오버헤드 프레스",
        "바벨 컬"
      ],
      "Day 2": [
        "루마니안 데드리프트",
        "바벨 백스쿼트",
        "레그 프레스",
        "덤벨 런지",
        "바벨 힙 쓰러스트",
        "레그 익스텐션"
      ]
    }
  },
  {
    "gender": "F",
    "level": "Elite",
    "split_id": "SPLIT",
    "freq": 3,
    "routine": {
      "Day 1": [
        "덤벨 벤치프레스",
        "인클라인 벤치프레스",
        "인클라인 체스트 프레스 머신",
        "스탠딩 케이블 플라이",
        "덤벨 숄더 프레스",
        "덤벨 트라이셉 익스텐션"
      ],
      "Day 2": [
        "중량 친업",
        "풀업",
        "바벨 로우",
        "랫풀다운",
        "덤벨 로우",
        "시티드 케이블 로우"
      ],
      "Day 3": [
        "루마니안 데드리프트",
        "바벨 백스쿼트",
        "레그 프레스",
        "덤벨 런지",
        "케이블 풀 스루",
        "바벨 힙 쓰러스트"
      ]
    }
  },
  {
    "gender": "F",
    "level": "Elite",
    "split_id": "SPLIT",
    "freq": 4,
    "routine": {
      "Day 1": [
        "컨벤셔널 데드리프트",
        "바벨 스모 스쿼트",
        "덤벨 스모 스쿼트",
        "바벨 힙 쓰러스트",
        "힙 쓰러스트 머신",
        "힙 쓰러스트 머신"
      ],
      "Day 2": [
        "벤치프레스",
        "인클라인 덤벨 벤치프레스",
        "체스트 프레스 머신",
        "인클라인 체스트 프레스 머신",
        "어시스트 딥스 머신",
        "케이블 크로스오버"
      ],
      "Day 3": [
        "중량 친업",
        "바벨 로우",
        "랫풀다운",
        "티바 로우 머신",
        "시티드 로우 머신",
        "시티드 케이블 로우"
      ],
      "Day 4": [
        "페이스 풀",
        "케이블 리버스 플라이",
        "덤벨 숄더 프레스",
        "오버헤드 프레스",
        "벤트오버 덤벨 레터럴 레이즈",
        "바벨 슈러그"
      ]
    }
  },
  {
    "gender": "F",
    "level": "Elite",
    "split_id": "SPLIT",
    "freq": 5,
    "routine": {
      "Day 1": [
        "컨벤셔널 데드리프트",
        "덤벨 스모 스쿼트",
        "바벨 런지",
        "바벨 힙 쓰러스트",
        "레그 익스텐션",
        "레그 컬"
      ],
      "Day 2": [
        "벤치프레스",
        "인클라인 덤벨 벤치프레스",
        "체스트 프레스 머신",
        "인클라인 체스트 프레스 머신",
        "덤벨 풀오버",
        "덤벨 플라이"
      ],
      "Day 3": [
        "중량 풀업",
        "바벨 로우",
        "친업",
        "랫풀다운",
        "티바 로우 머신",
        "시티드 케이블 로우"
      ],
      "Day 4": [
        "케이블 리버스 플라이",
        "페이스 풀",
        "시티드 덤벨 숄더 프레스",
        "덤벨 레터럴 레이즈",
        "바벨 프론트 레이즈",
        "덤벨 프론트 레이즈"
      ],
      "Day 5": [
        "덤벨 해머 컬",
        "바벨 컬",
        "케이블 컬",
        "토즈투 바",
        "케이블 크런치",
        "복근 크런치 머신"
      ]
    }
  },
  {
    "gender": "F",
    "level": "Elite",
    "split_id": "FB",
    "freq": 2,
    "routine": {
      "Day 1": [
        "프론트 스쿼트",
        "벤치프레스",
        "바벨 로우",
        "덤벨 레터럴 레이즈",
        "이지바 라잉 트라이셉 익스텐션",
        "케이블 크런치"
      ],
      "Day 2": [
        "컨벤셔널 데드리프트",
        "체스트 프레스 머신",
        "랫풀다운",
        "시티드 덤벨 숄더 프레스",
        "시티드 바벨 트라이셉 익스텐션",
        "복근 크런치 머신"
      ]
    }
  },
  {
    "gender": "F",
    "level": "Elite",
    "split_id": "FB",
    "freq": 3,
    "routine": {
      "Day 1": [
        "바벨 백스쿼트",
        "벤치프레스",
        "랫풀다운",
        "덤벨 레터럴 레이즈",
        "이지바 컬",
        "토즈투 바"
      ],
      "Day 2": [
        "프론트 스쿼트",
        "덤벨 벤치프레스",
        "바벨 로우",
        "시티드 덤벨 레터럴 레이즈",
        "케이블 푸시 다운",
        "케이블 크런치"
      ],
      "Day 3": [
        "컨벤셔널 데드리프트",
        "벤치프레스",
        "랫풀다운",
        "덤벨 슈러그",
        "이지바 트라이셉 익스텐션",
        "복근 크런치 머신"
      ]
    }
  },
  {
    "gender": "F",
    "level": "Elite",
    "split_id": "FB",
    "freq": 4,
    "routine": {
      "Day 1": [
        "바벨 백스쿼트",
        "벤치프레스",
        "랫풀다운",
        "덤벨 숄더 프레스",
        "이지바 컬",
        "행잉 니 레이즈"
      ],
      "Day 2": [
        "컨벤셔널 데드리프트",
        "덤벨 벤치프레스",
        "바벨 로우",
        "시티드 덤벨 레터럴 레이즈",
        "덤벨 트라이셉 익스텐션",
        "복근 크런치 머신"
      ],
      "Day 3": [
        "프론트 스쿼트",
        "벤치프레스",
        "랫풀다운",
        "케이블 레터럴 레이즈",
        "바벨 컬",
        "토즈투 바"
      ],
      "Day 4": [
        "바벨 백스쿼트",
        "덤벨 벤치프레스",
        "바벨 로우",
        "케이블 리버스 플라이",
        "케이블 해머컬",
        "복근 크런치 머신"
      ]
    }
  },
  {
    "gender": "F",
    "level": "Elite",
    "split_id": "FB",
    "freq": 5,
    "routine": {
      "Day 1": [
        "루마니안 데드리프트",
        "바벨 백스쿼트",
        "덤벨 벤치프레스",
        "바벨 로우",
        "덤벨 숄더 프레스",
        "케이블 크런치"
      ],
      "Day 2": [
        "컨벤셔널 데드리프트",
        "벤치프레스",
        "랫풀다운",
        "덤벨 숄더 프레스",
        "바벨 슈러그",
        "토즈투 바"
      ],
      "Day 3": [
        "컨벤셔널 데드리프트",
        "레그 프레스",
        "덤벨 벤치프레스",
        "랫풀다운",
        "덤벨 숄더 프레스",
        "토즈투 바"
      ],
      "Day 4": [
        "컨벤셔널 데드리프트",
        "프론트 스쿼트",
        "벤치프레스",
        "랫풀다운",
        "덤벨 숄더 프레스",
        "토즈투 바"
      ],
      "Day 5": [
        "컨벤셔널 데드리프트",
        "힙 어덕션 머신",
        "벤치프레스",
        "랫풀다운",
        "덤벨 숄더 프레스",
        "토즈투 바"
      ]
    }
  },
  {
    "gender": "M",
    "level": "Beginner",
    "split_id": "SPLIT",
    "freq": 2,
    "routine": {
      "Day 1": [
        "푸시업",
        "체스트 프레스 머신",
        "랫풀다운",
        "인버티드 로우",
        "시티드 덤벨 숄더 프레스"
      ],
      "Day 2": [
        "덤벨 런지",
        "에어 스쿼트",
        "힙 어브덕션 머신",
        "레그 컬",
        "맨몸 카프 레이즈"
      ]
    }
  },
  {
    "gender": "M",
    "level": "Intermediate",
    "split_id": "SPLIT",
    "freq": 2,
    "routine": {
      "Day 1": [
        "벤치프레스",
        "덤벨 벤치프레스",
        "바벨 로우",
        "랫풀다운",
        "시티드 케이블 로우",
        "시티드 덤벨 숄더 프레스"
      ],
      "Day 2": [
        "컨벤셔널 데드리프트",
        "레그 프레스",
        "덤벨 런지",
        "케이블 풀 스루",
        "덤벨 고블릿 스쿼트",
        "바벨 힙 쓰러스트"
      ]
    }
  },
  {
    "gender": "M",
    "level": "Elite",
    "split_id": "SPLIT",
    "freq": 3,
    "routine": {
      "Day 1": [
        "벤치프레스",
        "인클라인 덤벨 풀오버",
        "오버헤드 프레스",
        "케이블 레터럴 레이즈",
        "클로즈 그립 벤치프레스",
        "덤벨 트라이셉 익스텐션"
      ],
      "Day 2": [
        "중량 친업",
        "바벨 로우",
        "랫풀다운",
        "시티드 케이블 로우",
        "바벨 컬",
        "이지바 프리쳐 컬"
      ],
      "Day 3": [
        "덤벨 스모 데드리프트",
        "바벨 백스쿼트",
        "스티프 레그 데드리프트",
        "바벨 힙 쓰러스트",
        "레그 익스텐션",
        "스미스머신 카프 레이즈"
      ]
    }
  },
  {
    "gender": "F",
    "level": "Intermediate",
    "split_id": "SPLIT",
    "freq": 3,
    "routine": {
      "Day 1": [
        "벤치프레스",
        "인클라인 덤벨 벤치프레스",
        "덤벨 풀오버",
        "시티드 덤벨 숄더 프레스",
        "케이블 레터럴 레이즈",
        "덤벨 트라이셉 익스텐션"
      ],
      "Day 2": [
        "중량 친업",
        "랫풀다운",
        "시티드 로우 머신",
        "덤벨 로우",
        "로우 로우 머신",
        "바벨 컬"
      ],
      "Day 3": [
        "컨벤셔널 데드리프트",
        "바벨 런지",
        "레그 프레스",
        "덤벨 고블릿 스쿼트",
        "바벨 힙 쓰러스트",
        "레그 익스텐션"
      ]
    }
  },
  {
    "gender": "F",
    "level": "Intermediate",
    "split_id": "SPLIT",
    "freq": 4,
    "routine": {
      "Day 1": [
        "루마니안 데드리프트",
        "바벨 백스쿼트",
        "덤벨 런지",
        "케이블 풀 스루",
        "바벨 힙 쓰러스트",
        "레그 컬"
      ],
      "Day 2": [
        "벤치프레스",
        "인클라인 덤벨 벤치프레스",
        "체스트 프레스 머신",
        "인클라인 체스트 프레스 머신",
        "중량 딥스",
        "체스트 플라이 머신"
      ],
      "Day 3": [
        "바벨 로우",
        "친업",
        "랫풀다운",
        "덤벨 로우",
        "시티드 로우 머신",
        "시티드 케이블 로우"
      ],
      "Day 4": [
        "페이스 풀",
        "오버헤드 프레스",
        "숄더 프레스 머신",
        "벤트오버 덤벨 레터럴 레이즈",
        "덤벨 레터럴 레이즈",
        "케이블 프론트 레이즈"
      ]
    }
  },
  {
    "gender": "F",
    "level": "Advanced",
    "split_id": "SPLIT",
    "freq": 3,
    "routine": {
      "Day 1": [
        "벤치프레스",
        "인클라인 덤벨 벤치프레스",
        "덤벨 풀오버",
        "덤벨 숄더 프레스",
        "케이블 레터럴 레이즈",
        "덤벨 트라이셉 익스텐션"
      ],
      "Day 2": [
        "바벨 로우",
        "랫풀다운",
        "덤벨 로우",
        "시티드 케이블 로우",
        "중량 하이퍼 익스텐션",
        "덤벨 컬"
      ],
      "Day 3": [
        "컨벤셔널 데드리프트",
        "레그 프레스",
        "덤벨 런지",
        "핵 스쿼트 머신",
        "케이블 풀 스루",
        "바벨 힙 쓰러스트"
      ]
    }
  }
]
const exerciseCatalogData = [
    {
        "eTextId": "BB_BSQT",
        "kName": "바벨 백스쿼트",
        "eName": "Back Squat",
        "bName_ko": "하체",
        "bName": "Leg",
        "tool": 1,
        "tool_ko": "바벨",
        "MG": "Quads/Glutes/Hamstrings/Calves",
        "MG_ko": "대퇴사두근/엉덩이/햄스트링/종아리",
        "eInfoType": 6,
        "body_region": "lower",
        "movement_type": "legs",
        "tool_en": "Barbell",
        "MG_num": 4,
        "musle_point": [
            5,
            4,
            4,
            2
        ],
        "musle_point_sum": 15,
        "category": "Barbell Squat",
        "main_ex": true
    },
    {
        "eTextId": "BB_FSQ",
        "kName": "프론트 스쿼트",
        "eName": "Front Squat",
        "bName_ko": "하체",
        "bName": "Leg",
        "tool": 1,
        "tool_ko": "바벨",
        "MG": "Quads/Glutes/Hamstrings",
        "MG_ko": "대퇴사두근/엉덩이/햄스트링",
        "eInfoType": 6,
        "body_region": "lower",
        "movement_type": "legs",
        "tool_en": "Barbell",
        "MG_num": 3,
        "musle_point": [
            5,
            3,
            3
        ],
        "musle_point_sum": 11,
        "category": "Barbell Squat",
        "main_ex": false
    },
    {
        "eTextId": "BB_SPLIT_SQT",
        "kName": "바벨 불가리안 스플릿 스쿼트",
        "eName": "Barbell Bulgarian Split Squat",
        "bName_ko": "하체",
        "bName": "Leg",
        "tool": 1,
        "tool_ko": "바벨",
        "MG": "Quads/Glutes/Hamstrings",
        "MG_ko": "대퇴사두근/엉덩이/햄스트링",
        "eInfoType": 6,
        "body_region": "lower",
        "movement_type": "legs",
        "tool_en": "Barbell",
        "MG_num": 3,
        "musle_point": [
            5,
            4,
            4
        ],
        "musle_point_sum": 13,
        "category": "Lunge",
        "main_ex": false
    },
    {
        "eTextId": "DB_BULSPLIT_SQT",
        "kName": "덤벨 불가리안 스플릿 스쿼트",
        "eName": "Dumbbell Bulgarian Split Squat",
        "bName_ko": "하체",
        "bName": "Leg",
        "tool": 2,
        "tool_ko": "덤벨",
        "MG": "Quads/Glutes/Hamstrings",
        "MG_ko": "대퇴사두근/엉덩이/햄스트링",
        "eInfoType": 6,
        "body_region": "lower",
        "movement_type": "legs",
        "tool_en": "Dumbbell",
        "MG_num": 3,
        "musle_point": [
            5,
            4,
            4
        ],
        "musle_point_sum": 13,
        "category": "Lunge",
        "main_ex": false
    },
    {
        "eTextId": "DB_SPLIT_SQT",
        "kName": "덤벨 스플릿 스쿼트",
        "eName": "Dumbbell Split Squat",
        "bName_ko": "하체",
        "bName": "Leg",
        "tool": 2,
        "tool_ko": "덤벨",
        "MG": "Quads/Glutes/Hamstrings",
        "MG_ko": "대퇴사두근/엉덩이/햄스트링",
        "eInfoType": 6,
        "body_region": "lower",
        "movement_type": "legs",
        "tool_en": "Dumbbell",
        "MG_num": 3,
        "musle_point": [
            4,
            3,
            3
        ],
        "musle_point_sum": 10,
        "category": "Lunge",
        "main_ex": false
    },
    {
        "eTextId": "AIR_SQT",
        "kName": "에어 스쿼트",
        "eName": "Air Squat",
        "bName_ko": "하체",
        "bName": "Leg",
        "tool": 4,
        "tool_ko": "맨몸",
        "MG": "Quads/Glutes/Hamstrings",
        "MG_ko": "대퇴사두근/엉덩이/햄스트링",
        "eInfoType": 2,
        "body_region": "lower",
        "movement_type": "legs",
        "tool_en": "Bodyweight",
        "MG_num": 3,
        "musle_point": [
            4,
            3,
            2
        ],
        "musle_point_sum": 9,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "JUMP_SQT",
        "kName": "점프 스쿼트",
        "eName": "Jump Squat",
        "bName_ko": "하체",
        "bName": "Leg",
        "tool": 4,
        "tool_ko": "맨몸",
        "MG": "Quads/Glutes/Calves/Hamstrings",
        "MG_ko": "대퇴사두근/엉덩이/종아리/햄스트링",
        "eInfoType": 2,
        "body_region": "lower",
        "movement_type": "legs",
        "tool_en": "Bodyweight",
        "MG_num": 4,
        "musle_point": [
            5,
            4,
            4,
            3
        ],
        "musle_point_sum": 16,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "GOBLET_SQT",
        "kName": "덤벨 고블릿 스쿼트",
        "eName": "Dumbbell Goblet Squat",
        "bName_ko": "하체",
        "bName": "Leg",
        "tool": 2,
        "tool_ko": "덤벨",
        "MG": "Quads/Glutes/Hamstrings",
        "MG_ko": "대퇴사두근/엉덩이/햄스트링",
        "eInfoType": 6,
        "body_region": "lower",
        "movement_type": "legs",
        "tool_en": "Dumbbell",
        "MG_num": 3,
        "musle_point": [
            4,
            3,
            3
        ],
        "musle_point_sum": 10,
        "category": "Dumbbell Squat",
        "main_ex": false
    },
    {
        "eTextId": "KB_GOBLET_SQT",
        "kName": "케틀벨 고블릿 스쿼트",
        "eName": "Kettlebell Goblet Squat",
        "bName_ko": "하체",
        "bName": "Leg",
        "tool": 6,
        "tool_ko": "케틀벨",
        "MG": "Quads/Glutes/Hamstrings",
        "MG_ko": "대퇴사두근/엉덩이/햄스트링",
        "eInfoType": 6,
        "body_region": "lower",
        "movement_type": "legs",
        "tool_en": "Kettlebell",
        "MG_num": 3,
        "musle_point": [
            4,
            3,
            3
        ],
        "musle_point_sum": 10,
        "category": "Dumbbell Squat",
        "main_ex": false
    },
    {
        "eTextId": "BB_DL",
        "kName": "컨벤셔널 데드리프트",
        "eName": "Conventional Deadlift",
        "bName_ko": "하체",
        "bName": "Leg",
        "tool": 1,
        "tool_ko": "바벨",
        "MG": "Hamstrings/Glutes/Lower Back/Upper Back/Forearms/Lats",
        "MG_ko": "햄스트링/엉덩이/등 하부/등 상부/전완근/광배근",
        "eInfoType": 6,
        "body_region": "lower",
        "movement_type": "legs",
        "tool_en": "Barbell",
        "MG_num": 6,
        "musle_point": [
            5,
            4,
            4,
            3,
            3,
            3
        ],
        "musle_point_sum": 22,
        "category": "Barbell Deadlift",
        "main_ex": true
    },
    {
        "eTextId": "RM_BB_DL",
        "kName": "루마니안 데드리프트",
        "eName": "Romanian Deadlift",
        "bName_ko": "하체",
        "bName": "Leg",
        "tool": 1,
        "tool_ko": "바벨",
        "MG": "Hamstrings/Glutes/Lower Back/Forearms/Upper Back",
        "MG_ko": "햄스트링/엉덩이/등 하부/전완근/등 상부",
        "eInfoType": 6,
        "body_region": "lower",
        "movement_type": "legs",
        "tool_en": "Barbell",
        "MG_num": 5,
        "musle_point": [
            5,
            4,
            4,
            3,
            2
        ],
        "musle_point_sum": 18,
        "category": "Barbell Deadlift",
        "main_ex": true
    },
    {
        "eTextId": "SM_BB_DL",
        "kName": "스모 데드리프트",
        "eName": "Sumo Deadlift",
        "bName_ko": "하체",
        "bName": "Leg",
        "tool": 1,
        "tool_ko": "바벨",
        "MG": "Hamstrings/Glutes/Adductors/Lower Back/Upper Back/Forearms",
        "MG_ko": "햄스트링/엉덩이/내전근/등 하부/등 상부/전완근",
        "eInfoType": 6,
        "body_region": "lower",
        "movement_type": "legs",
        "tool_en": "Barbell",
        "MG_num": 6,
        "musle_point": [
            5,
            5,
            4,
            4,
            3,
            3
        ],
        "musle_point_sum": 24,
        "category": "Barbell Deadlift",
        "main_ex": true
    },
    {
        "eTextId": "LEG_PRESS",
        "kName": "레그 프레스",
        "eName": "Leg Press",
        "bName_ko": "하체",
        "bName": "Leg",
        "tool": 3,
        "tool_ko": "머신",
        "MG": "Quads/Glutes/Hamstrings/Calves",
        "MG_ko": "대퇴사두근/엉덩이/햄스트링/종아리",
        "eInfoType": 6,
        "body_region": "lower",
        "movement_type": "legs",
        "tool_en": "Machine",
        "MG_num": 4,
        "musle_point": [
            5,
            3,
            3,
            2
        ],
        "musle_point_sum": 13,
        "category": null,
        "main_ex": true
    },
    {
        "eTextId": "LEG_CURL",
        "kName": "레그 컬",
        "eName": "Leg Curl",
        "bName_ko": "하체",
        "bName": "Leg",
        "tool": 3,
        "tool_ko": "머신",
        "MG": "Hamstrings",
        "MG_ko": "햄스트링",
        "eInfoType": 6,
        "body_region": "lower",
        "movement_type": "legs",
        "tool_en": "Machine",
        "MG_num": 1,
        "musle_point": [
            5
        ],
        "musle_point_sum": 5,
        "category": null,
        "main_ex": true
    },
    {
        "eTextId": "LGE_EXT",
        "kName": "레그 익스텐션",
        "eName": "Leg Extension",
        "bName_ko": "하체",
        "bName": "Leg",
        "tool": 3,
        "tool_ko": "머신",
        "MG": "Quads",
        "MG_ko": "대퇴사두근",
        "eInfoType": 6,
        "body_region": "lower",
        "movement_type": "legs",
        "tool_en": "Machine",
        "MG_num": 1,
        "musle_point": [
            5
        ],
        "musle_point_sum": 5,
        "category": null,
        "main_ex": true
    },
    {
        "eTextId": "INN_THIGH_MC",
        "kName": "힙 어덕션 머신",
        "eName": "Hip Adduction Machine",
        "bName_ko": "하체",
        "bName": "Leg",
        "tool": 3,
        "tool_ko": "머신",
        "MG": "Adductors",
        "MG_ko": "내전근",
        "eInfoType": 6,
        "body_region": "lower",
        "movement_type": "legs",
        "tool_en": "Machine",
        "MG_num": 1,
        "musle_point": [
            5
        ],
        "musle_point_sum": 5,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "LUNGE",
        "kName": "런지",
        "eName": "Lunge",
        "bName_ko": "하체",
        "bName": "Leg",
        "tool": 4,
        "tool_ko": "맨몸",
        "MG": "Quads/Glutes/Hamstrings/Adductors",
        "MG_ko": "대퇴사두근/엉덩이/햄스트링/내전근",
        "eInfoType": 2,
        "body_region": "lower",
        "movement_type": "legs",
        "tool_en": "Bodyweight",
        "MG_num": 4,
        "musle_point": [
            5,
            4,
            4,
            3
        ],
        "musle_point_sum": 16,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "DB_LUNGE",
        "kName": "덤벨 런지",
        "eName": "Dumbbell Lunge",
        "bName_ko": "하체",
        "bName": "Leg",
        "tool": 2,
        "tool_ko": "덤벨",
        "MG": "Quads/Glutes/Hamstrings/Adductors",
        "MG_ko": "대퇴사두근/엉덩이/햄스트링/내전근",
        "eInfoType": 6,
        "body_region": "lower",
        "movement_type": "legs",
        "tool_en": "Dumbbell",
        "MG_num": 4,
        "musle_point": [
            4,
            3,
            3,
            2
        ],
        "musle_point_sum": 12,
        "category": "Lunge",
        "main_ex": true
    },
    {
        "eTextId": "HIP_THRUST",
        "kName": "힙 쓰러스트",
        "eName": "Hip Thrust",
        "bName_ko": "하체",
        "bName": "Leg",
        "tool": 4,
        "tool_ko": "맨몸",
        "MG": "Glutes/Hamstrings",
        "MG_ko": "엉덩이/햄스트링",
        "eInfoType": 2,
        "body_region": "lower",
        "movement_type": "legs",
        "tool_en": "Bodyweight",
        "MG_num": 2,
        "musle_point": [
            5,
            3
        ],
        "musle_point_sum": 8,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "WEI_HIP_THRUST",
        "kName": "바벨 힙 쓰러스트",
        "eName": "Barbell Hip Thrust",
        "bName_ko": "하체",
        "bName": "Leg",
        "tool": 1,
        "tool_ko": "바벨",
        "MG": "Glutes/Hamstrings",
        "MG_ko": "엉덩이/햄스트링",
        "eInfoType": 6,
        "body_region": "lower",
        "movement_type": "legs",
        "tool_en": "Barbell",
        "MG_num": 2,
        "musle_point": [
            5,
            4
        ],
        "musle_point_sum": 9,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "BB_BP",
        "kName": "벤치프레스",
        "eName": "Barbell Bench Press",
        "bName_ko": "가슴",
        "bName": "Chest",
        "tool": 1,
        "tool_ko": "바벨",
        "MG": "Middle Chest/Upper Chest/Triceps/Anterior Deltoid",
        "MG_ko": "가슴 중앙/가슴 상부/삼두근/어깨 전면",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "push",
        "tool_en": "Barbell",
        "MG_num": 4,
        "musle_point": [
            5,
            4,
            4,
            3
        ],
        "musle_point_sum": 16,
        "category": "Barbell Benchpress",
        "main_ex": true
    },
    {
        "eTextId": "BB_INC_PRESS",
        "kName": "인클라인 벤치프레스",
        "eName": "Barbell Incline Bench Press",
        "bName_ko": "가슴",
        "bName": "Chest",
        "tool": 1,
        "tool_ko": "바벨",
        "MG": "Upper Chest/Middle Chest/Triceps/Anterior Deltoid",
        "MG_ko": "가슴 상부/가슴 중앙/삼두근/어깨 전면",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "push",
        "tool_en": "Barbell",
        "MG_num": 4,
        "musle_point": [
            5,
            4,
            4,
            3
        ],
        "musle_point_sum": 16,
        "category": "Barbell Benchpress",
        "main_ex": false
    },
    {
        "eTextId": "DB_BP",
        "kName": "덤벨 벤치프레스",
        "eName": "Dumbbell Bench Press",
        "bName_ko": "가슴",
        "bName": "Chest",
        "tool": 2,
        "tool_ko": "덤벨",
        "MG": "Middle Chest/Upper Chest/Triceps/Anterior Deltoid",
        "MG_ko": "가슴 중앙/가슴 상부/삼두근/어깨 전면",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "push",
        "tool_en": "Dumbbell",
        "MG_num": 4,
        "musle_point": [
            5,
            4,
            4,
            3
        ],
        "musle_point_sum": 16,
        "category": "Dumbbell Benchpress",
        "main_ex": true
    },
    {
        "eTextId": "DIPS",
        "kName": "딥스",
        "eName": "Dips",
        "bName_ko": "가슴",
        "bName": "Chest",
        "tool": 4,
        "tool_ko": "맨몸",
        "MG": "Lower Chest/Triceps/Anterior Deltoid",
        "MG_ko": "가슴 하부/삼두근/어깨 전면",
        "eInfoType": 2,
        "body_region": "upper",
        "movement_type": "push",
        "tool_en": "Bodyweight",
        "MG_num": 3,
        "musle_point": [
            5,
            4,
            4
        ],
        "musle_point_sum": 13,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "WEI_DIPS",
        "kName": "중량 딥스",
        "eName": "Weighted Dips",
        "bName_ko": "가슴",
        "bName": "Chest",
        "tool": 7,
        "tool_ko": "기타",
        "MG": "Lower Chest/Triceps/Anterior Deltoid",
        "MG_ko": "가슴 하부/삼두근/어깨 전면",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "push",
        "tool_en": "Etc",
        "MG_num": 3,
        "musle_point": [
            5,
            5,
            4
        ],
        "musle_point_sum": 14,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "DB_FLY",
        "kName": "덤벨 플라이",
        "eName": "Dumbbell Fly",
        "bName_ko": "가슴",
        "bName": "Chest",
        "tool": 2,
        "tool_ko": "덤벨",
        "MG": "Middle Chest/Lower Chest",
        "MG_ko": "가슴 중앙/가슴 하부",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "push",
        "tool_en": "Dumbbell",
        "MG_num": 2,
        "musle_point": [
            5,
            4
        ],
        "musle_point_sum": 9,
        "category": "Fly",
        "main_ex": false
    },
    {
        "eTextId": "DB_INC_FLY",
        "kName": "인클라인 덤벨 플라이",
        "eName": "Incline Dumbbell Fly",
        "bName_ko": "가슴",
        "bName": "Chest",
        "tool": 2,
        "tool_ko": "덤벨",
        "MG": "Upper Chest/Middle Chest/Anterior Deltoid",
        "MG_ko": "가슴 상부/가슴 중앙/어깨 전면",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "push",
        "tool_en": "Dumbbell",
        "MG_num": 3,
        "musle_point": [
            5,
            4,
            3
        ],
        "musle_point_sum": 12,
        "category": "Fly",
        "main_ex": false
    },
    {
        "eTextId": "PUSH_UP",
        "kName": "푸시업",
        "eName": "Push Ups",
        "bName_ko": "가슴",
        "bName": "Chest",
        "tool": 4,
        "tool_ko": "맨몸",
        "MG": "Middle Chest/Upper Chest/Triceps/Anterior Deltoid/Core",
        "MG_ko": "가슴 중앙/가슴 상부/삼두근/어깨 전면/코어",
        "eInfoType": 2,
        "body_region": "upper",
        "movement_type": "push",
        "tool_en": "Bodyweight",
        "MG_num": 5,
        "musle_point": [
            4,
            3,
            3,
            3,
            2
        ],
        "musle_point_sum": 15,
        "category": "Push Ups",
        "main_ex": false
    },
    {
        "eTextId": "HINDU_PUSH_UP",
        "kName": "힌두 푸시업",
        "eName": "Hindu Push Ups",
        "bName_ko": "가슴",
        "bName": "Chest",
        "tool": 4,
        "tool_ko": "맨몸",
        "MG": "Middle Chest/Upper Chest/Anterior Deltoid/Triceps/Core",
        "MG_ko": "가슴 중앙/가슴 상부/어깨 전면/삼두근/코어",
        "eInfoType": 2,
        "body_region": "upper",
        "movement_type": "push",
        "tool_en": "Bodyweight",
        "MG_num": 5,
        "musle_point": [
            4,
            4,
            3,
            3,
            2
        ],
        "musle_point_sum": 16,
        "category": "Push Ups",
        "main_ex": false
    },
    {
        "eTextId": "CROSS_OVER",
        "kName": "케이블 크로스오버",
        "eName": "Cable Crossover",
        "bName_ko": "가슴",
        "bName": "Chest",
        "tool": 3,
        "tool_ko": "머신",
        "MG": "Middle Chest/Lower Chest",
        "MG_ko": "가슴 중앙/가슴 하부",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "push",
        "tool_en": "Machine",
        "MG_num": 2,
        "musle_point": [
            4,
            4
        ],
        "musle_point_sum": 8,
        "category": "Fly",
        "main_ex": false
    },
    {
        "eTextId": "DB_INC_BP",
        "kName": "인클라인 덤벨 벤치프레스",
        "eName": "Incline Dumbbell Bench Press",
        "bName_ko": "가슴",
        "bName": "Chest",
        "tool": 2,
        "tool_ko": "덤벨",
        "MG": "Upper Chest/Middle Chest/Triceps/Anterior Deltoid",
        "MG_ko": "가슴 상부/가슴 중앙/삼두근/어깨 전면",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "push",
        "tool_en": "Dumbbell",
        "MG_num": 4,
        "musle_point": [
            5,
            4,
            3,
            3
        ],
        "musle_point_sum": 15,
        "category": "Dumbbell Benchpress",
        "main_ex": false
    },
    {
        "eTextId": "CHEST_PRESS_MC",
        "kName": "체스트 프레스 머신",
        "eName": "Chest Press Machine",
        "bName_ko": "가슴",
        "bName": "Chest",
        "tool": 3,
        "tool_ko": "머신",
        "MG": "Middle Chest/Upper Chest/Triceps/Anterior Deltoid",
        "MG_ko": "가슴 중앙/가슴 상부/삼두근/어깨 전면",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "push",
        "tool_en": "Machine",
        "MG_num": 4,
        "musle_point": [
            5,
            4,
            3,
            3
        ],
        "musle_point_sum": 15,
        "category": null,
        "main_ex": true
    },
    {
        "eTextId": "PEC_DECK_MC",
        "kName": "펙덱 플라이 머신",
        "eName": "Pec Deck Fly Machine",
        "bName_ko": "가슴",
        "bName": "Chest",
        "tool": 3,
        "tool_ko": "머신",
        "MG": "Middle Chest/Upper Chest/Lower Chest",
        "MG_ko": "가슴 중앙/가슴 상부/가슴 하부",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "push",
        "tool_en": "Machine",
        "MG_num": 3,
        "musle_point": [
            5,
            4,
            3
        ],
        "musle_point_sum": 12,
        "category": "Fly",
        "main_ex": false
    },
    {
        "eTextId": "INC_BP_MAC",
        "kName": "인클라인 벤치프레스 머신",
        "eName": "Incline Bench Press Machine",
        "bName_ko": "가슴",
        "bName": "Chest",
        "tool": 3,
        "tool_ko": "머신",
        "MG": "Upper Chest/Middle Chest/Triceps/Anterior Deltoid",
        "MG_ko": "가슴 상부/가슴 중앙/삼두근/어깨 전면",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "push",
        "tool_en": "Machine",
        "MG_num": 4,
        "musle_point": [
            5,
            4,
            3,
            3
        ],
        "musle_point_sum": 15,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "DB_PULLOVER",
        "kName": "덤벨 풀오버",
        "eName": "Dumbbell Pullover",
        "bName_ko": "가슴",
        "bName": "Chest",
        "tool": 2,
        "tool_ko": "덤벨",
        "MG": "Middle Chest/Lower Chest/Lats",
        "MG_ko": "가슴 중앙/가슴 하부/광배근",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "push",
        "tool_en": "Dumbbell",
        "MG_num": 3,
        "musle_point": [
            4,
            3,
            3
        ],
        "musle_point_sum": 10,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "PULL_UP",
        "kName": "풀업",
        "eName": "Pull Up",
        "bName_ko": "등",
        "bName": "Back",
        "tool": 4,
        "tool_ko": "맨몸",
        "MG": "Lats/Upper Back/Lats/Lower Back/Biceps/Forearms",
        "MG_ko": "광배근/등 상부/승모근/등 하부/이두근/전완근",
        "eInfoType": 2,
        "body_region": "upper",
        "movement_type": "pull",
        "tool_en": "Bodyweight",
        "MG_num": 6,
        "musle_point": [
            5,
            4,
            3,
            3,
            3,
            3
        ],
        "musle_point_sum": 21,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "WEI_PULL_UP",
        "kName": "중량 풀업",
        "eName": "Weighted Pull Up",
        "bName_ko": "등",
        "bName": "Back",
        "tool": 7,
        "tool_ko": "기타",
        "MG": "Lats/Upper Back/Lats/Lower Back/Biceps/Forearms",
        "MG_ko": "광배근/등 상부/승모근/등 하부/이두근/전완근",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "pull",
        "tool_en": "Etc",
        "MG_num": 6,
        "musle_point": [
            5,
            5,
            4,
            3,
            2,
            2
        ],
        "musle_point_sum": 21,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "CHIN_UP",
        "kName": "친업",
        "eName": "Chin Up",
        "bName_ko": "등",
        "bName": "Back",
        "tool": 4,
        "tool_ko": "맨몸",
        "MG": "Biceps/Lats/Upper Back/Traps/Lower Back/Forearms",
        "MG_ko": "이두근/광배근/등 상부/승모근/등 하부/전완근",
        "eInfoType": 2,
        "body_region": "upper",
        "movement_type": "pull",
        "tool_en": "Bodyweight",
        "MG_num": 6,
        "musle_point": [
            4,
            4,
            4,
            3,
            3,
            2
        ],
        "musle_point_sum": 20,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "WEI_CHIN_UP",
        "kName": "중량 친업",
        "eName": "Weighted Chin Up",
        "bName_ko": "등",
        "bName": "Back",
        "tool": 7,
        "tool_ko": "기타",
        "MG": "Lats/Upper Back/Traps/Lower Back/Biceps/Forearms",
        "MG_ko": "광배근/등 상부/승모근/등 하부/이두근/전완근",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "pull",
        "tool_en": "Etc",
        "MG_num": 6,
        "musle_point": [
            5,
            5,
            4,
            3,
            3,
            2
        ],
        "musle_point_sum": 22,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "BB_LOW",
        "kName": "바벨 로우",
        "eName": "Barbell Row",
        "bName_ko": "등",
        "bName": "Back",
        "tool": 1,
        "tool_ko": "바벨",
        "MG": "Upper Back/Lats/Lower Back/Traps/Biceps/Posterior Deltoid",
        "MG_ko": "등 상부/광배근/등 하부/승모근/이두근/어깨 후면",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "pull",
        "tool_en": "Barbell",
        "MG_num": 6,
        "musle_point": [
            5,
            4,
            3,
            3,
            3,
            2
        ],
        "musle_point_sum": 20,
        "category": "Barbell Row",
        "main_ex": true
    },
    {
        "eTextId": "PENDLAY_ROW",
        "kName": "펜들레이 로우",
        "eName": "Pendlay Row",
        "bName_ko": "등",
        "bName": "Back",
        "tool": 1,
        "tool_ko": "바벨",
        "MG": "Upper Back/Lats/Lower Back/Biceps/Forearms/Posterior Deltoid",
        "MG_ko": "등 상부/광배근/등 하부/이두근/전완근/어깨 후면",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "pull",
        "tool_en": "Barbell",
        "MG_num": 6,
        "musle_point": [
            5,
            4,
            3,
            3,
            3,
            2
        ],
        "musle_point_sum": 20,
        "category": "Barbell Row",
        "main_ex": false
    },
    {
        "eTextId": "INC_BB_ROW",
        "kName": "바벨 인클라인 로우",
        "eName": "Barbell Incline Row",
        "bName_ko": "등",
        "bName": "Back",
        "tool": 1,
        "tool_ko": "바벨",
        "MG": "Upper Back/Lats/Biceps/Lower Back/Posterior Deltoid",
        "MG_ko": "등 상부/광배근/이두근/등 하부/어깨 후면",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "pull",
        "tool_en": "Barbell",
        "MG_num": 5,
        "musle_point": [
            5,
            4,
            3,
            3,
            2
        ],
        "musle_point_sum": 17,
        "category": "Barbell Row",
        "main_ex": false
    },
    {
        "eTextId": "INC_DB_ROW",
        "kName": "덤벨 인클라인 로우",
        "eName": "Dumbbell Incline Row",
        "bName_ko": "등",
        "bName": "Back",
        "tool": 2,
        "tool_ko": "덤벨",
        "MG": "Upper Back/Lats/Biceps/Lower Back/Posterior Deltoid",
        "MG_ko": "등 상부/광배근/이두근/등 하부/어깨 후면",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "pull",
        "tool_en": "Dumbbell",
        "MG_num": 5,
        "musle_point": [
            5,
            4,
            3,
            3,
            2
        ],
        "musle_point_sum": 17,
        "category": "Dumbbell Row",
        "main_ex": false
    },
    {
        "eTextId": "INVT_ROW",
        "kName": "인버티드 로우",
        "eName": "Inverted Row",
        "bName_ko": "등",
        "bName": "Back",
        "tool": 4,
        "tool_ko": "맨몸",
        "MG": "Upper Back/Lats/Lower Back/Biceps",
        "MG_ko": "등 상부/광배근/등 하부/이두근",
        "eInfoType": 2,
        "body_region": "upper",
        "movement_type": "pull",
        "tool_en": "Bodyweight",
        "MG_num": 4,
        "musle_point": [
            4,
            4,
            3,
            2
        ],
        "musle_point_sum": 13,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "DB_LOW",
        "kName": "덤벨 로우",
        "eName": "Dumbbell Row",
        "bName_ko": "등",
        "bName": "Back",
        "tool": 2,
        "tool_ko": "덤벨",
        "MG": "Upper Back/Lats/Traps/Biceps/Posterior Deltoid",
        "MG_ko": "등 상부/광배근/승모근/이두근/어깨 후면",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "pull",
        "tool_en": "Dumbbell",
        "MG_num": 5,
        "musle_point": [
            4,
            4,
            3,
            3,
            2
        ],
        "musle_point_sum": 16,
        "category": "Dumbbell Row",
        "main_ex": true
    },
    {
        "eTextId": "OA_DB_ROW",
        "kName": "원암 덤벨 로우",
        "eName": "One Arm Dumbbell Row",
        "bName_ko": "등",
        "bName": "Back",
        "tool": 2,
        "tool_ko": "덤벨",
        "MG": "Lats/Upper Back/Biceps/Traps/Posterior Deltoid",
        "MG_ko": "광배근/등 상부/이두근/승모근/어깨 후면",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "pull",
        "tool_en": "Dumbbell",
        "MG_num": 5,
        "musle_point": [
            5,
            4,
            3,
            3,
            2
        ],
        "musle_point_sum": 17,
        "category": "Dumbbell Row",
        "main_ex": false
    },
    {
        "eTextId": "MC_LOW",
        "kName": "시티드 로우 머신",
        "eName": "Seated Row Machine",
        "bName_ko": "등",
        "bName": "Back",
        "tool": 3,
        "tool_ko": "머신",
        "MG": "Upper Back/Lats/Lower Back/Biceps/Core",
        "MG_ko": "등 상부/광배근/등 하부/이두근/코어",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "pull",
        "tool_en": "Machine",
        "MG_num": 5,
        "musle_point": [
            4,
            4,
            3,
            3,
            2
        ],
        "musle_point_sum": 16,
        "category": null,
        "main_ex": true
    },
    {
        "eTextId": "SEATED_CABLE_ROW",
        "kName": "시티드 케이블 로우",
        "eName": "Seated Cable Row",
        "bName_ko": "등",
        "bName": "Back",
        "tool": 3,
        "tool_ko": "머신",
        "MG": "Upper Back/Lats/Biceps/Core",
        "MG_ko": "등 상부/광배근/이두근/코어",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "pull",
        "tool_en": "Machine",
        "MG_num": 4,
        "musle_point": [
            4,
            4,
            3,
            2
        ],
        "musle_point_sum": 13,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "LAT_PULL_DOWN",
        "kName": "랫풀다운",
        "eName": "Lat Pull Down",
        "bName_ko": "등",
        "bName": "Back",
        "tool": 3,
        "tool_ko": "머신",
        "MG": "Lats/Upper Back/Lower Back/Biceps/Core",
        "MG_ko": "광배근/등 상부/등 하부/이두근/코어",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "pull",
        "tool_en": "Machine",
        "MG_num": 5,
        "musle_point": [
            5,
            4,
            3,
            3,
            2
        ],
        "musle_point_sum": 17,
        "category": null,
        "main_ex": true
    },
    {
        "eTextId": "WEI_HPET",
        "kName": "중량 하이퍼 익스텐션",
        "eName": "Weight Hyperextension",
        "bName_ko": "등",
        "bName": "Back",
        "tool": 7,
        "tool_ko": "기타",
        "MG": "Lower Back/Glutes/Hamstrings",
        "MG_ko": "등 하부/엉덩이/햄스트링",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "pull",
        "tool_en": "Etc",
        "MG_num": 3,
        "musle_point": [
            5,
            4,
            3
        ],
        "musle_point_sum": 12,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "BACK_ET",
        "kName": "백 익스텐션",
        "eName": "Back Extension",
        "bName_ko": "등",
        "bName": "Back",
        "tool": 4,
        "tool_ko": "맨몸",
        "MG": "Lower Back/Glutes/Hamstrings",
        "MG_ko": "등 하부/엉덩이/햄스트링",
        "eInfoType": 2,
        "body_region": "upper",
        "movement_type": "pull",
        "tool_en": "Bodyweight",
        "MG_num": 3,
        "musle_point": [
            5,
            4,
            3
        ],
        "musle_point_sum": 12,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "BB_PRESS",
        "kName": "오버헤드 프레스",
        "eName": "Overhead Press",
        "bName_ko": "어깨",
        "bName": "Shoulder",
        "tool": 1,
        "tool_ko": "바벨",
        "MG": "Anterior Deltoid/Lateral Deltoid/Triceps",
        "MG_ko": "어깨 전면/어깨 측면/삼두근",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "push",
        "tool_en": "Barbell",
        "MG_num": 3,
        "musle_point": [
            5,
            3,
            3
        ],
        "musle_point_sum": 11,
        "category": null,
        "main_ex": true
    },
    {
        "eTextId": "DB_SHD_PRESS",
        "kName": "덤벨 숄더 프레스",
        "eName": "Dumbbell Shoulder Press",
        "bName_ko": "어깨",
        "bName": "Shoulder",
        "tool": 2,
        "tool_ko": "덤벨",
        "MG": "Anterior Deltoid/Lateral Deltoid/Triceps",
        "MG_ko": "어깨 전면/어깨 측면/삼두근",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "push",
        "tool_en": "Dumbbell",
        "MG_num": 3,
        "musle_point": [
            5,
            3,
            3
        ],
        "musle_point_sum": 11,
        "category": null,
        "main_ex": true
    },
    {
        "eTextId": "SHD_PRESS_MAC",
        "kName": "숄더 프레스 머신",
        "eName": "Shoulder Press Machine",
        "bName_ko": "어깨",
        "bName": "Shoulder",
        "tool": 3,
        "tool_ko": "머신",
        "MG": "Anterior Deltoid/Lateral Deltoid/Triceps",
        "MG_ko": "어깨 전면/어깨 측면/삼두근",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "push",
        "tool_en": "Machine",
        "MG_num": 3,
        "musle_point": [
            5,
            3,
            3
        ],
        "musle_point_sum": 11,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "DB_F_RAISE",
        "kName": "덤벨 프론트 레이즈",
        "eName": "Dumbbell Front Raise",
        "bName_ko": "어깨",
        "bName": "Shoulder",
        "tool": 2,
        "tool_ko": "덤벨",
        "MG": "Anterior Deltoid",
        "MG_ko": "어깨 전면",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "push",
        "tool_en": "Dumbbell",
        "MG_num": 1,
        "musle_point": [
            5
        ],
        "musle_point_sum": 5,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "DB_LAT_RAISE",
        "kName": "덤벨 레터럴 레이즈",
        "eName": "Dumbbell Lateral Raise",
        "bName_ko": "어깨",
        "bName": "Shoulder",
        "tool": 2,
        "tool_ko": "덤벨",
        "MG": "Lateral Deltoid",
        "MG_ko": "어깨 측면",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "push",
        "tool_en": "Dumbbell",
        "MG_num": 1,
        "musle_point": [
            5
        ],
        "musle_point_sum": 5,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "DB_BO_LAT_RAISE",
        "kName": "벤트오버 덤벨 레터럴 레이즈",
        "eName": "Bentover Dumbbell Lateral Raise",
        "bName_ko": "어깨",
        "bName": "Shoulder",
        "tool": 2,
        "tool_ko": "덤벨",
        "MG": "Posterior Deltoid/Traps",
        "MG_ko": "어깨 후면/승모근",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "pull",
        "tool_en": "Dumbbell",
        "MG_num": 2,
        "musle_point": [
            5,
            3
        ],
        "musle_point_sum": 8,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "DB_SHRUG",
        "kName": "덤벨 슈러그",
        "eName": "Dumbbell Shrug",
        "bName_ko": "어깨",
        "bName": "Shoulder",
        "tool": 2,
        "tool_ko": "덤벨",
        "MG": "Traps",
        "MG_ko": "승모근",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "pull",
        "tool_en": "Dumbbell",
        "MG_num": 1,
        "musle_point": [
            4
        ],
        "musle_point_sum": 4,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "BB_SHRUG",
        "kName": "바벨 슈러그",
        "eName": "Barbell Shrug",
        "bName_ko": "어깨",
        "bName": "Shoulder",
        "tool": 1,
        "tool_ko": "바벨",
        "MG": "Traps",
        "MG_ko": "승모근",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "pull",
        "tool_en": "Barbell",
        "MG_num": 1,
        "musle_point": [
            5
        ],
        "musle_point_sum": 5,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "FACE_PULL",
        "kName": "페이스 풀",
        "eName": "Face Pull",
        "bName_ko": "어깨",
        "bName": "Shoulder",
        "tool": 3,
        "tool_ko": "머신",
        "MG": "Posterior Deltoid/Traps/Lateral Deltoid",
        "MG_ko": "어깨 후면/승모근/어깨 측면",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "pull",
        "tool_en": "Machine",
        "MG_num": 3,
        "musle_point": [
            5,
            4,
            3
        ],
        "musle_point_sum": 12,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "CABLE_REV_FLY",
        "kName": "케이블 리버스 플라이",
        "eName": "Cable Reverse Fly",
        "bName_ko": "어깨",
        "bName": "Shoulder",
        "tool": 3,
        "tool_ko": "머신",
        "MG": "Posterior Deltoid/Traps/Lateral Deltoid",
        "MG_ko": "어깨 후면/승모근/어깨 측면",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "pull",
        "tool_en": "Machine",
        "MG_num": 3,
        "musle_point": [
            5,
            4,
            3
        ],
        "musle_point_sum": 12,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "BB_UPRIGHT_ROW",
        "kName": "바벨 업라이트 로우",
        "eName": "Barbell Upright Row",
        "bName_ko": "어깨",
        "bName": "Shoulder",
        "tool": 1,
        "tool_ko": "바벨",
        "MG": "Traps/Lateral Deltoid/Biceps",
        "MG_ko": "승모근/어깨 측면/이두근",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "pull",
        "tool_en": "Barbell",
        "MG_num": 3,
        "musle_point": [
            5,
            4,
            3
        ],
        "musle_point_sum": 12,
        "category": "Upright Row",
        "main_ex": false
    },
    {
        "eTextId": "DB_UPRIGHT_ROW",
        "kName": "덤벨 업라이트 로우",
        "eName": "Dumbbell Upright Row",
        "bName_ko": "어깨",
        "bName": "Shoulder",
        "tool": 2,
        "tool_ko": "덤벨",
        "MG": "Traps/Lateral Deltoid/Anterior Deltoid",
        "MG_ko": "승모근/어깨 측면/어깨 전면",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "pull",
        "tool_en": "Dumbbell",
        "MG_num": 3,
        "musle_point": [
            5,
            4,
            3
        ],
        "musle_point_sum": 12,
        "category": "Upright Row",
        "main_ex": false
    },
    {
        "eTextId": "EZB_UPRIGHT_ROW",
        "kName": "이지바 업라이트 로우",
        "eName": "EZ Bar Upright Row",
        "bName_ko": "어깨",
        "bName": "Shoulder",
        "tool": 5,
        "tool_ko": "이지바",
        "MG": "Traps/Lateral Deltoid/Anterior Deltoid",
        "MG_ko": "승모근/어깨 측면/어깨 전면",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "pull",
        "tool_en": "EZbar",
        "MG_num": 3,
        "musle_point": [
            5,
            4,
            3
        ],
        "musle_point_sum": 12,
        "category": "Upright Row",
        "main_ex": false
    },
    {
        "eTextId": "BB_BC_CURL",
        "kName": "바벨 컬",
        "eName": "Barbell Bicep Curl",
        "bName_ko": "팔",
        "bName": "Arm",
        "tool": 1,
        "tool_ko": "바벨",
        "MG": "Biceps",
        "MG_ko": "이두근",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "pull",
        "tool_en": "Barbell",
        "MG_num": 1,
        "musle_point": [
            5
        ],
        "musle_point_sum": 5,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "EZB_CURL",
        "kName": "이지바 컬",
        "eName": "EZ Bar Curl",
        "bName_ko": "팔",
        "bName": "Arm",
        "tool": 5,
        "tool_ko": "이지바",
        "MG": "Biceps/Forearms",
        "MG_ko": "이두근/전완근",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "pull",
        "tool_en": "EZbar",
        "MG_num": 2,
        "musle_point": [
            5,
            3
        ],
        "musle_point_sum": 8,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "DB_BC_CURL",
        "kName": "덤벨 컬",
        "eName": "Dumbbell Bicep Curl",
        "bName_ko": "팔",
        "bName": "Arm",
        "tool": 2,
        "tool_ko": "덤벨",
        "MG": "Biceps",
        "MG_ko": "이두근",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "pull",
        "tool_en": "Dumbbell",
        "MG_num": 1,
        "musle_point": [
            5
        ],
        "musle_point_sum": 5,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "DB_HAM_CURL",
        "kName": "덤벨 해머 컬",
        "eName": "Dumbbell Hammer Curl",
        "bName_ko": "팔",
        "bName": "Arm",
        "tool": 2,
        "tool_ko": "덤벨",
        "MG": "Biceps/Forearms",
        "MG_ko": "이두근/전완근",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "pull",
        "tool_en": "Dumbbell",
        "MG_num": 2,
        "musle_point": [
            5,
            3
        ],
        "musle_point_sum": 8,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "CABLE_CURL",
        "kName": "케이블 컬",
        "eName": "Cable Curl",
        "bName_ko": "팔",
        "bName": "Arm",
        "tool": 3,
        "tool_ko": "머신",
        "MG": "Biceps",
        "MG_ko": "이두근",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "pull",
        "tool_en": "Machine",
        "MG_num": 1,
        "musle_point": [
            5
        ],
        "musle_point_sum": 5,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "CG_BB_BP",
        "kName": "클로즈 그립 벤치프레스",
        "eName": "Close-grip Bench Press",
        "bName_ko": "팔",
        "bName": "Arm",
        "tool": 1,
        "tool_ko": "바벨",
        "MG": "Triceps/Middle Chest/Anterior Deltoid",
        "MG_ko": "삼두근/가슴 중앙/어깨 전면",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "push",
        "tool_en": "Barbell",
        "MG_num": 3,
        "musle_point": [
            5,
            3,
            2
        ],
        "musle_point_sum": 10,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "DB_TRI_EXT",
        "kName": "덤벨 트라이셉 익스텐션",
        "eName": "Dumbbell Tricep Extension",
        "bName_ko": "팔",
        "bName": "Arm",
        "tool": 2,
        "tool_ko": "덤벨",
        "MG": "Triceps",
        "MG_ko": "삼두근",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "push",
        "tool_en": "Dumbbell",
        "MG_num": 1,
        "musle_point": [
            4
        ],
        "musle_point_sum": 4,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "DB_KICKBACK",
        "kName": "덤벨 킥백",
        "eName": "Dumbbell Kickback",
        "bName_ko": "팔",
        "bName": "Arm",
        "tool": 2,
        "tool_ko": "덤벨",
        "MG": "Triceps",
        "MG_ko": "삼두근",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "push",
        "tool_en": "Dumbbell",
        "MG_num": 1,
        "musle_point": [
            4
        ],
        "musle_point_sum": 4,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "BB_WRIST_CURL",
        "kName": "바벨 리스트 컬",
        "eName": "Barbell Wrist Curl",
        "bName_ko": "팔",
        "bName": "Arm",
        "tool": 1,
        "tool_ko": "바벨",
        "MG": "Forearms",
        "MG_ko": "전완근",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "pull",
        "tool_en": "Barbell",
        "MG_num": 1,
        "musle_point": [
            3
        ],
        "musle_point_sum": 3,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "EZB_WRIST_CURL",
        "kName": "이지바 리스트 컬",
        "eName": "EZ Bar Wrist Curl",
        "bName_ko": "팔",
        "bName": "Arm",
        "tool": 5,
        "tool_ko": "이지바",
        "MG": "Forearms",
        "MG_ko": "전완근",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "pull",
        "tool_en": "EZbar",
        "MG_num": 1,
        "musle_point": [
            3
        ],
        "musle_point_sum": 3,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "DB_WRIST_CURL",
        "kName": "덤벨 리스트 컬",
        "eName": "Dumbbell Wrist Curl",
        "bName_ko": "팔",
        "bName": "Arm",
        "tool": 2,
        "tool_ko": "덤벨",
        "MG": "Forearms",
        "MG_ko": "전완근",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "pull",
        "tool_en": "Dumbbell",
        "MG_num": 1,
        "musle_point": [
            3
        ],
        "musle_point_sum": 3,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "LYING_TRI_EXT",
        "kName": "바벨 라잉 트라이셉 익스텐션",
        "eName": "Lying Tricep Extension",
        "bName_ko": "팔",
        "bName": "Arm",
        "tool": 5,
        "tool_ko": "이지바",
        "MG": "Triceps",
        "MG_ko": "삼두근",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "push",
        "tool_en": "EZbar",
        "MG_num": 1,
        "musle_point": [
            5
        ],
        "musle_point_sum": 5,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "CABLE_PUSH_DOWN",
        "kName": "케이블 푸시 다운",
        "eName": "Cable Push Down",
        "bName_ko": "팔",
        "bName": "Arm",
        "tool": 3,
        "tool_ko": "머신",
        "MG": "Triceps/Anterior Deltoid",
        "MG_ko": "삼두근/어깨 전면",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "push",
        "tool_en": "Machine",
        "MG_num": 2,
        "musle_point": [
            5,
            2
        ],
        "musle_point_sum": 7,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "SIT_UP",
        "kName": "싯업",
        "eName": "Sit Up",
        "bName_ko": "복근",
        "bName": "Abs",
        "tool": 4,
        "tool_ko": "맨몸",
        "MG": "Upper Abs",
        "MG_ko": "상복근",
        "eInfoType": 2,
        "body_region": "etc",
        "movement_type": "etc",
        "tool_en": "Bodyweight",
        "MG_num": 1,
        "musle_point": [
            4
        ],
        "musle_point_sum": 4,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "V-UP",
        "kName": "브이 업",
        "eName": "V-up",
        "bName_ko": "복근",
        "bName": "Abs",
        "tool": 4,
        "tool_ko": "맨몸",
        "MG": "Lower Abs/Upper Abs",
        "MG_ko": "하복근/상복근",
        "eInfoType": 2,
        "body_region": "etc",
        "movement_type": "etc",
        "tool_en": "Bodyweight",
        "MG_num": 2,
        "musle_point": [
            5,
            3
        ],
        "musle_point_sum": 8,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "CRUNCH",
        "kName": "크런치",
        "eName": "Crunch",
        "bName_ko": "복근",
        "bName": "Abs",
        "tool": 4,
        "tool_ko": "맨몸",
        "MG": "Upper Abs",
        "MG_ko": "상복근",
        "eInfoType": 2,
        "body_region": "etc",
        "movement_type": "etc",
        "tool_en": "Bodyweight",
        "MG_num": 1,
        "musle_point": [
            4
        ],
        "musle_point_sum": 4,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "HEEL_TOUCH",
        "kName": "힐 터치",
        "eName": "Heel Touch",
        "bName_ko": "복근",
        "bName": "Abs",
        "tool": 4,
        "tool_ko": "맨몸",
        "MG": "Obliques",
        "MG_ko": "복사근",
        "eInfoType": 2,
        "body_region": "etc",
        "movement_type": "etc",
        "tool_en": "Bodyweight",
        "MG_num": 1,
        "musle_point": [
            3
        ],
        "musle_point_sum": 3,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "LEG_RAISE",
        "kName": "레그 레이즈",
        "eName": "Leg Raise",
        "bName_ko": "복근",
        "bName": "Abs",
        "tool": 4,
        "tool_ko": "맨몸",
        "MG": "Lower Abs",
        "MG_ko": "하복근",
        "eInfoType": 2,
        "body_region": "etc",
        "movement_type": "etc",
        "tool_en": "Bodyweight",
        "MG_num": 1,
        "musle_point": [
            4
        ],
        "musle_point_sum": 4,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "HANG_LEG_RAIGE",
        "kName": "행잉 레그 레이즈",
        "eName": "Hanging Leg Raise",
        "bName_ko": "복근",
        "bName": "Abs",
        "tool": 4,
        "tool_ko": "맨몸",
        "MG": "Lower Abs",
        "MG_ko": "하복근",
        "eInfoType": 2,
        "body_region": "etc",
        "movement_type": "etc",
        "tool_en": "Bodyweight",
        "MG_num": 1,
        "musle_point": [
            5
        ],
        "musle_point_sum": 5,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "RUS_TWIST",
        "kName": "러시안 트위스트",
        "eName": "Russian Twist",
        "bName_ko": "복근",
        "bName": "Abs",
        "tool": 6,
        "tool_ko": "케틀벨",
        "MG": "Obliques",
        "MG_ko": "복사근",
        "eInfoType": 6,
        "body_region": "etc",
        "movement_type": "etc",
        "tool_en": "Kettlebell",
        "MG_num": 1,
        "musle_point": [
            4
        ],
        "musle_point_sum": 4,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "DB_SIDE_BEND",
        "kName": "덤벨 사이드 벤드",
        "eName": "Dumbbell Side Bend",
        "bName_ko": "복근",
        "bName": "Abs",
        "tool": 2,
        "tool_ko": "덤벨",
        "MG": "Obliques",
        "MG_ko": "복사근",
        "eInfoType": 6,
        "body_region": "etc",
        "movement_type": "etc",
        "tool_en": "Dumbbell",
        "MG_num": 1,
        "musle_point": [
            4
        ],
        "musle_point_sum": 4,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "ABS_ROLL_OUT",
        "kName": "복근 롤아웃",
        "eName": "Abs Roll Out",
        "bName_ko": "복근",
        "bName": "Abs",
        "tool": 1,
        "tool_ko": "바벨",
        "MG": "Core",
        "MG_ko": "코어",
        "eInfoType": 2,
        "body_region": "etc",
        "movement_type": "etc",
        "tool_en": "Barbell",
        "MG_num": 1,
        "musle_point": [
            5
        ],
        "musle_point_sum": 5,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "TOES_TO_BAR",
        "kName": "토즈투 바",
        "eName": "Toes To Bar",
        "bName_ko": "복근",
        "bName": "Abs",
        "tool": 4,
        "tool_ko": "맨몸",
        "MG": "Lower Abs/Core",
        "MG_ko": "하복근/코어",
        "eInfoType": 2,
        "body_region": "etc",
        "movement_type": "etc",
        "tool_en": "Bodyweight",
        "MG_num": 2,
        "musle_point": [
            5,
            4
        ],
        "musle_point_sum": 9,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "PUSH_PRESS",
        "kName": "푸시 프레스",
        "eName": "Push Press",
        "bName_ko": "어깨",
        "bName": "Shoulder",
        "tool": 1,
        "tool_ko": "바벨",
        "MG": "Anterior Deltoid/Lateral Deltoid/Triceps",
        "MG_ko": "어깨 전면/어깨 측면/삼두근",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "push",
        "tool_en": "Barbell",
        "MG_num": 3,
        "musle_point": [
            5,
            3,
            3
        ],
        "musle_point_sum": 11,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "BURPEE",
        "kName": "버피",
        "eName": "Burpee",
        "bName_ko": "기타",
        "bName": "Etc",
        "tool": 4,
        "tool_ko": "맨몸",
        "MG": "Quads/Glutes/Core/Anterior Deltoid/Triceps",
        "MG_ko": "대퇴사두근/엉덩이/코어/어깨 전면/삼두근",
        "eInfoType": 2,
        "body_region": "etc",
        "movement_type": "etc",
        "tool_en": "Bodyweight",
        "MG_num": 5,
        "musle_point": [
            3,
            3,
            3,
            2,
            2
        ],
        "musle_point_sum": 13,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "MOUNT_CLIMB",
        "kName": "마운틴 클라이머",
        "eName": "Mountain Climber",
        "bName_ko": "기타",
        "bName": "Etc",
        "tool": 4,
        "tool_ko": "맨몸",
        "MG": "Lower Abs/Core/Quads/Anterior Deltoid",
        "MG_ko": "하복근/코어/대퇴사두근/어깨 전면",
        "eInfoType": 2,
        "body_region": "etc",
        "movement_type": "etc",
        "tool_en": "Bodyweight",
        "MG_num": 4,
        "musle_point": [
            4,
            3,
            3,
            2
        ],
        "musle_point_sum": 12,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "JUMPING_JACK",
        "kName": "점핑 잭",
        "eName": "Jumping Jack",
        "bName_ko": "기타",
        "bName": "Etc",
        "tool": 4,
        "tool_ko": "맨몸",
        "MG": "Calves/Lateral Deltoid/Quads/Core",
        "MG_ko": "종아리/어깨 측면/대퇴사두근/코어",
        "eInfoType": 2,
        "body_region": "etc",
        "movement_type": "etc",
        "tool_en": "Bodyweight",
        "MG_num": 4,
        "musle_point": [
            3,
            3,
            2,
            2
        ],
        "musle_point_sum": 10,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "V_SQT",
        "kName": "브이 스쿼트",
        "eName": "V Squat",
        "bName_ko": "하체",
        "bName": "Leg",
        "tool": 3,
        "tool_ko": "머신",
        "MG": "Quads/Glutes/Hamstrings/Adductors",
        "MG_ko": "대퇴사두근/엉덩이/햄스트링/내전근",
        "eInfoType": 6,
        "body_region": "lower",
        "movement_type": "legs",
        "tool_en": "Machine",
        "MG_num": 4,
        "musle_point": [
            5,
            4,
            3,
            3
        ],
        "musle_point_sum": 15,
        "category": "Machine Squat",
        "main_ex": true
    },
    {
        "eTextId": "REV_V_SQT",
        "kName": "리버스 브이 스쿼트",
        "eName": "Reverse V Squat",
        "bName_ko": "하체",
        "bName": "Leg",
        "tool": 3,
        "tool_ko": "머신",
        "MG": "Quads/Hamstrings/Glutes/Adductors",
        "MG_ko": "대퇴사두근/햄스트링/엉덩이/내전근",
        "eInfoType": 6,
        "body_region": "lower",
        "movement_type": "legs",
        "tool_en": "Machine",
        "MG_num": 4,
        "musle_point": [
            5,
            4,
            4,
            3
        ],
        "musle_point_sum": 16,
        "category": "Machine Squat",
        "main_ex": true
    },
    {
        "eTextId": "T_BAR_ROW_MAC",
        "kName": "티바 로우 머신",
        "eName": "T-bar Row Machine",
        "bName_ko": "등",
        "bName": "Back",
        "tool": 3,
        "tool_ko": "머신",
        "MG": "Upper Back/Lats/Biceps/Traps/Posterior Deltoid",
        "MG_ko": "등 상부/광배근/이두근/승모근/어깨 후면",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "pull",
        "tool_en": "Machine",
        "MG_num": 5,
        "musle_point": [
            5,
            4,
            3,
            3,
            2
        ],
        "musle_point_sum": 17,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "DB_PREA_CURL",
        "kName": "덤벨 프리쳐 컬",
        "eName": "Dumbbell Preacher Curl",
        "bName_ko": "팔",
        "bName": "Arm",
        "tool": 2,
        "tool_ko": "덤벨",
        "MG": "Biceps",
        "MG_ko": "이두근",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "pull",
        "tool_en": "Dumbbell",
        "MG_num": 1,
        "musle_point": [
            5
        ],
        "musle_point_sum": 5,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "BB_PREA_CURL",
        "kName": "바벨 프리쳐 컬",
        "eName": "Barbell Preacher Curl",
        "bName_ko": "팔",
        "bName": "Arm",
        "tool": 1,
        "tool_ko": "바벨",
        "MG": "Biceps",
        "MG_ko": "이두근",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "pull",
        "tool_en": "Barbell",
        "MG_num": 1,
        "musle_point": [
            5
        ],
        "musle_point_sum": 5,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "EZ_PREA_CURL",
        "kName": "이지바 프리쳐 컬",
        "eName": "EZ Bar Preacher Curl",
        "bName_ko": "팔",
        "bName": "Arm",
        "tool": 5,
        "tool_ko": "이지바",
        "MG": "Biceps",
        "MG_ko": "이두근",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "pull",
        "tool_en": "EZbar",
        "MG_num": 1,
        "musle_point": [
            5
        ],
        "musle_point_sum": 5,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "REV_PEC_DECK_MC",
        "kName": "리어 델토이드 플라이 머신",
        "eName": "Reverse Pec Deck Fly Machine",
        "bName_ko": "어깨",
        "bName": "Shoulder",
        "tool": 3,
        "tool_ko": "머신",
        "MG": "Posterior Deltoid/Traps/Lateral Deltoid",
        "MG_ko": "어깨 후면/승모근/어깨 측면",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "pull",
        "tool_en": "Machine",
        "MG_num": 3,
        "musle_point": [
            5,
            4,
            2
        ],
        "musle_point_sum": 11,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "HIP_ABD_MC",
        "kName": "힙 어브덕션 머신",
        "eName": "Hip Abduction Machine",
        "bName_ko": "하체",
        "bName": "Leg",
        "tool": 3,
        "tool_ko": "머신",
        "MG": "Abductors/Glutes",
        "MG_ko": "외전근/엉덩이",
        "eInfoType": 6,
        "body_region": "lower",
        "movement_type": "legs",
        "tool_en": "Machine",
        "MG_num": 2,
        "musle_point": [
            5,
            3
        ],
        "musle_point_sum": 8,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "CABLE_LAT_RAISE",
        "kName": "케이블 레터럴 레이즈",
        "eName": "Cable Lateral Raise",
        "bName_ko": "어깨",
        "bName": "Shoulder",
        "tool": 3,
        "tool_ko": "머신",
        "MG": "Lateral Deltoid",
        "MG_ko": "어깨 측면",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "push",
        "tool_en": "Machine",
        "MG_num": 1,
        "musle_point": [
            5
        ],
        "musle_point_sum": 5,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "CABLE_FRONT_RAISE",
        "kName": "케이블 프론트 레이즈",
        "eName": "Cable Front Raise",
        "bName_ko": "어깨",
        "bName": "Shoulder",
        "tool": 3,
        "tool_ko": "머신",
        "MG": "Anterior Deltoid",
        "MG_ko": "어깨 전면",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "push",
        "tool_en": "Machine",
        "MG_num": 1,
        "musle_point": [
            5
        ],
        "musle_point_sum": 5,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "HANG_KNEE_RAISE",
        "kName": "행잉 니 레이즈",
        "eName": "Hanging Knee Raise",
        "bName_ko": "복근",
        "bName": "Abs",
        "tool": 4,
        "tool_ko": "맨몸",
        "MG": "Lower Abs",
        "MG_ko": "하복근",
        "eInfoType": 2,
        "body_region": "etc",
        "movement_type": "etc",
        "tool_en": "Bodyweight",
        "MG_num": 1,
        "musle_point": [
            4
        ],
        "musle_point_sum": 4,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "ARM_CURL_MC",
        "kName": "암 컬 머신",
        "eName": "Arm Curl Machine",
        "bName_ko": "팔",
        "bName": "Arm",
        "tool": 3,
        "tool_ko": "머신",
        "MG": "Biceps",
        "MG_ko": "이두근",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "pull",
        "tool_en": "Machine",
        "MG_num": 1,
        "musle_point": [
            5
        ],
        "musle_point_sum": 5,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "ABS_CRUNCH_MC",
        "kName": "복근 크런치 머신",
        "eName": "Abdominal Crunch Machine",
        "bName_ko": "복근",
        "bName": "Abs",
        "tool": 3,
        "tool_ko": "머신",
        "MG": "Upper Abs",
        "MG_ko": "상복근",
        "eInfoType": 6,
        "body_region": "etc",
        "movement_type": "etc",
        "tool_en": "Machine",
        "MG_num": 1,
        "musle_point": [
            5
        ],
        "musle_point_sum": 5,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "SM_SPLIT_SQT",
        "kName": "스미스머신 스플릿 스쿼트",
        "eName": "Smith Machine Split Squat",
        "bName_ko": "하체",
        "bName": "Leg",
        "tool": 3,
        "tool_ko": "머신",
        "MG": "Quads/Glutes/Hamstrings",
        "MG_ko": "대퇴사두근/엉덩이/햄스트링",
        "eInfoType": 6,
        "body_region": "lower",
        "movement_type": "legs",
        "tool_en": "Machine",
        "MG_num": 3,
        "musle_point": [
            5,
            4,
            3
        ],
        "musle_point_sum": 12,
        "category": "Lunge",
        "main_ex": false
    },
    {
        "eTextId": "SM_DL",
        "kName": "스미스머신 데드리프트",
        "eName": "Smith Machine Deadlift",
        "bName_ko": "하체",
        "bName": "Leg",
        "tool": 3,
        "tool_ko": "머신",
        "MG": "Hamstrings/Glutes/Lower Back",
        "MG_ko": "햄스트링/엉덩이/등 하부",
        "eInfoType": 6,
        "body_region": "lower",
        "movement_type": "legs",
        "tool_en": "Machine",
        "MG_num": 3,
        "musle_point": [
            5,
            4,
            4
        ],
        "musle_point_sum": 13,
        "category": "Barbell Deadlift",
        "main_ex": false
    },
    {
        "eTextId": "SM_ROW",
        "kName": "스미스머신 로우",
        "eName": "Smith Machine Row",
        "bName_ko": "등",
        "bName": "Back",
        "tool": 3,
        "tool_ko": "머신",
        "MG": "Upper Back/Lats/Biceps",
        "MG_ko": "등 상부/광배근/이두근",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "pull",
        "tool_en": "Machine",
        "MG_num": 3,
        "musle_point": [
            5,
            4,
            3
        ],
        "musle_point_sum": 12,
        "category": "Barbell Row",
        "main_ex": false
    },
    {
        "eTextId": "SM_BP",
        "kName": "스미스머신 벤치프레스",
        "eName": "Smith Machine Bench Press",
        "bName_ko": "가슴",
        "bName": "Chest",
        "tool": 3,
        "tool_ko": "머신",
        "MG": "Middle Chest/Upper Chest/Triceps/Anterior Deltoid",
        "MG_ko": "가슴 중앙/가슴 상부/삼두근/어깨 전면",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "push",
        "tool_en": "Machine",
        "MG_num": 4,
        "musle_point": [
            5,
            4,
            3,
            3
        ],
        "musle_point_sum": 15,
        "category": "Barbell Benchpress",
        "main_ex": false
    },
    {
        "eTextId": "SM_SHRUG",
        "kName": "스미스머신 슈러그",
        "eName": "Smith Machine Shrug",
        "bName_ko": "어깨",
        "bName": "Shoulder",
        "tool": 3,
        "tool_ko": "머신",
        "MG": "Traps",
        "MG_ko": "승모근",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "pull",
        "tool_en": "Machine",
        "MG_num": 1,
        "musle_point": [
            5
        ],
        "musle_point_sum": 5,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "SM_SQT",
        "kName": "스미스머신 스쿼트",
        "eName": "Smith Machine Squat",
        "bName_ko": "하체",
        "bName": "Leg",
        "tool": 3,
        "tool_ko": "머신",
        "MG": "Quads/Glutes/Hamstrings",
        "MG_ko": "대퇴사두근/엉덩이/햄스트링",
        "eInfoType": 6,
        "body_region": "lower",
        "movement_type": "legs",
        "tool_en": "Machine",
        "MG_num": 3,
        "musle_point": [
            5,
            4,
            3
        ],
        "musle_point_sum": 12,
        "category": "Barbell Squat",
        "main_ex": false
    },
    {
        "eTextId": "SM_INC_PRESS",
        "kName": "스미스머신 인클라인 벤치프레스",
        "eName": "Smith Machine Incline Bench Press",
        "bName_ko": "가슴",
        "bName": "Chest",
        "tool": 3,
        "tool_ko": "머신",
        "MG": "Upper Chest/Middle Chest/Triceps/Anterior Deltoid",
        "MG_ko": "가슴 상부/가슴 중앙/삼두근/어깨 전면",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "push",
        "tool_en": "Machine",
        "MG_num": 4,
        "musle_point": [
            5,
            4,
            3,
            3
        ],
        "musle_point_sum": 15,
        "category": "Barbell Benchpress",
        "main_ex": false
    },
    {
        "eTextId": "CABLE_CRUNCH",
        "kName": "케이블 크런치",
        "eName": "Cable Crunch",
        "bName_ko": "복근",
        "bName": "Abs",
        "tool": 3,
        "tool_ko": "머신",
        "MG": "Upper Abs",
        "MG_ko": "상복근",
        "eInfoType": 6,
        "body_region": "etc",
        "movement_type": "etc",
        "tool_en": "Machine",
        "MG_num": 1,
        "musle_point": [
            5
        ],
        "musle_point_sum": 5,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "CABLE_HAM_CURL",
        "kName": "케이블 해머컬",
        "eName": "Cable Hammer Curl",
        "bName_ko": "팔",
        "bName": "Arm",
        "tool": 3,
        "tool_ko": "머신",
        "MG": "Biceps/Forearms",
        "MG_ko": "이두근/전완근",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "pull",
        "tool_en": "Machine",
        "MG_num": 2,
        "musle_point": [
            5,
            3
        ],
        "musle_point_sum": 8,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "CABLE_ARM_PULL_DOWN",
        "kName": "케이블 암 풀다운",
        "eName": "Cable Straight Arm Pulldown",
        "bName_ko": "등",
        "bName": "Back",
        "tool": 3,
        "tool_ko": "머신",
        "MG": "Lats/Upper Back/Biceps",
        "MG_ko": "광배근/등 상부/이두근",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "pull",
        "tool_en": "Machine",
        "MG_num": 3,
        "musle_point": [
            5,
            3,
            2
        ],
        "musle_point_sum": 10,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "HACK_SQT",
        "kName": "핵 스쿼트 머신",
        "eName": "Hack Squat Machine",
        "bName_ko": "하체",
        "bName": "Leg",
        "tool": 3,
        "tool_ko": "머신",
        "MG": "Quads/Glutes/Hamstrings",
        "MG_ko": "대퇴사두근/엉덩이/햄스트링",
        "eInfoType": 6,
        "body_region": "lower",
        "movement_type": "legs",
        "tool_en": "Machine",
        "MG_num": 3,
        "musle_point": [
            5,
            4,
            3
        ],
        "musle_point_sum": 12,
        "category": "Machine Squat",
        "main_ex": true
    },
    {
        "eTextId": "ASS_DIP_MC",
        "kName": "어시스트 딥스 머신",
        "eName": "Assisted Dip Machine",
        "bName_ko": "가슴",
        "bName": "Chest",
        "tool": 3,
        "tool_ko": "머신",
        "MG": "Lower Chest/Triceps/Anterior Deltoid",
        "MG_ko": "가슴 하부/삼두근/어깨 전면",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "push",
        "tool_en": "Machine",
        "MG_num": 3,
        "musle_point": [
            4,
            3,
            2
        ],
        "musle_point_sum": 9,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "ASS_PULLUP_MC",
        "kName": "어시스트 풀업 머신",
        "eName": "Assisted Pull Up Machine",
        "bName_ko": "등",
        "bName": "Back",
        "tool": 3,
        "tool_ko": "머신",
        "MG": "Lats/Upper Back/Biceps",
        "MG_ko": "광배근/등 상부/이두근",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "pull",
        "tool_en": "Machine",
        "MG_num": 3,
        "musle_point": [
            5,
            4,
            3
        ],
        "musle_point_sum": 12,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "BB_BOX_SQT",
        "kName": "바벨 박스 스쿼트",
        "eName": "Barbell Box Squat",
        "bName_ko": "하체",
        "bName": "Leg",
        "tool": 1,
        "tool_ko": "바벨",
        "MG": "Quads/Glutes/Hamstrings",
        "MG_ko": "대퇴사두근/엉덩이/햄스트링",
        "eInfoType": 6,
        "body_region": "lower",
        "movement_type": "legs",
        "tool_en": "Barbell",
        "MG_num": 3,
        "musle_point": [
            5,
            4,
            3
        ],
        "musle_point_sum": 12,
        "category": "Barbell Squat",
        "main_ex": false
    },
    {
        "eTextId": "BB_FRONT_RAISE",
        "kName": "바벨 프론트 레이즈",
        "eName": "Barbell Front Raise",
        "bName_ko": "어깨",
        "bName": "Shoulder",
        "tool": 1,
        "tool_ko": "바벨",
        "MG": "Anterior Deltoid",
        "MG_ko": "어깨 전면",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "push",
        "tool_en": "Barbell",
        "MG_num": 1,
        "musle_point": [
            5
        ],
        "musle_point_sum": 5,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "EZB_FRONT_RAISE",
        "kName": "이지바 프론트 레이즈",
        "eName": "EZ Bar Front Raise",
        "bName_ko": "어깨",
        "bName": "Shoulder",
        "tool": 5,
        "tool_ko": "이자바",
        "MG": "Anterior Deltoid",
        "MG_ko": "어깨 전면",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "push",
        "tool_en": "Barbell",
        "MG_num": 1,
        "musle_point": [
            5
        ],
        "musle_point_sum": 5,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "BB_JUMP_SQT",
        "kName": "바벨 점프 스쿼트",
        "eName": "Barbell Jump Squat",
        "bName_ko": "하체",
        "bName": "Leg",
        "tool": 1,
        "tool_ko": "바벨",
        "MG": "Quads/Glutes/Calves/Hamstrings",
        "MG_ko": "대퇴사두근/엉덩이/종아리/햄스트링",
        "eInfoType": 6,
        "body_region": "lower",
        "movement_type": "legs",
        "tool_en": "Barbell",
        "MG_num": 4,
        "musle_point": [
            5,
            4,
            4,
            3
        ],
        "musle_point_sum": 16,
        "category": "Barbell Squat",
        "main_ex": false
    },
    {
        "eTextId": "BB_LUNGE",
        "kName": "바벨 런지",
        "eName": "Barbell Lunge",
        "bName_ko": "하체",
        "bName": "Leg",
        "tool": 1,
        "tool_ko": "바벨",
        "MG": "Quads/Glutes/Hamstrings/Calves",
        "MG_ko": "대퇴사두근/엉덩이/햄스트링/종아리",
        "eInfoType": 6,
        "body_region": "lower",
        "movement_type": "legs",
        "tool_en": "Barbell",
        "MG_num": 4,
        "musle_point": [
            5,
            4,
            3,
            2
        ],
        "musle_point_sum": 14,
        "category": "Lunge",
        "main_ex": false
    },
    {
        "eTextId": "BB_LAT_LUNGE",
        "kName": "바벨 레터럴 런지",
        "eName": "Barbell Lateral Lunge",
        "bName_ko": "하체",
        "bName": "Leg",
        "tool": 1,
        "tool_ko": "바벨",
        "MG": "Adductors/Quads/Glutes",
        "MG_ko": "내전근/대퇴사두근/엉덩이",
        "eInfoType": 6,
        "body_region": "lower",
        "movement_type": "legs",
        "tool_en": "Barbell",
        "MG_num": 3,
        "musle_point": [
            5,
            4,
            3
        ],
        "musle_point_sum": 12,
        "category": "Lunge",
        "main_ex": false
    },
    {
        "eTextId": "BB_SPLIT_SQT_REAL",
        "kName": "바벨 스플릿 스쿼트",
        "eName": "Barbell Split Squat",
        "bName_ko": "하체",
        "bName": "Leg",
        "tool": 1,
        "tool_ko": "바벨",
        "MG": "Quads/Glutes/Hamstrings",
        "MG_ko": "대퇴사두근/엉덩이/햄스트링",
        "eInfoType": 6,
        "body_region": "lower",
        "movement_type": "legs",
        "tool_en": "Barbell",
        "MG_num": 3,
        "musle_point": [
            5,
            4,
            3
        ],
        "musle_point_sum": 12,
        "category": "Lunge",
        "main_ex": false
    },
    {
        "eTextId": "STIFF_DL",
        "kName": "스티프 레그 데드리프트",
        "eName": "Stiff Leg Deadlift",
        "bName_ko": "하체",
        "bName": "Leg",
        "tool": 1,
        "tool_ko": "바벨",
        "MG": "Hamstrings/Glutes/Lower Back",
        "MG_ko": "햄스트링/엉덩이/등 하부",
        "eInfoType": 6,
        "body_region": "lower",
        "movement_type": "legs",
        "tool_en": "Barbell",
        "MG_num": 3,
        "musle_point": [
            5,
            4,
            4
        ],
        "musle_point_sum": 13,
        "category": "Barbell Deadlift",
        "main_ex": false
    },
    {
        "eTextId": "DB_SM_SQT",
        "kName": "덤벨 스모 스쿼트",
        "eName": "Dumbbell Sumo Squat",
        "bName_ko": "하체",
        "bName": "Leg",
        "tool": 2,
        "tool_ko": "덤벨",
        "MG": "Adductors/Quads/Glutes/Hamstrings",
        "MG_ko": "내전근/대퇴사두근/엉덩이/햄스트링",
        "eInfoType": 6,
        "body_region": "lower",
        "movement_type": "legs",
        "tool_en": "Dumbbell",
        "MG_num": 4,
        "musle_point": [
            5,
            4,
            4,
            3
        ],
        "musle_point_sum": 16,
        "category": "Dumbbell Squat",
        "main_ex": false
    },
    {
        "eTextId": "DB_BURPEE",
        "kName": "덤벨 버피",
        "eName": "Dumbbell Burpee",
        "bName_ko": "기타",
        "bName": "Etc",
        "tool": 2,
        "tool_ko": "덤벨",
        "MG": "Quads/Glutes/Anterior Deltoid/Core/Triceps",
        "MG_ko": "대퇴사두근/엉덩이/어깨 전면/코어/삼두근",
        "eInfoType": 6,
        "body_region": "etc",
        "movement_type": "etc",
        "tool_en": "Dumbbell",
        "MG_num": 5,
        "musle_point": [
            3,
            3,
            3,
            3,
            2
        ],
        "musle_point_sum": 14,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "DB_REAR_LAT_RAISE",
        "kName": "시티드 덤벨 리어 레터럴 레이즈",
        "eName": "Seated Dumbbell Rear Lateral Raise",
        "bName_ko": "어깨",
        "bName": "Shoulder",
        "tool": 2,
        "tool_ko": "덤벨",
        "MG": "Posterior Deltoid/Traps",
        "MG_ko": "어깨 후면/승모근",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "pull",
        "tool_en": "Dumbbell",
        "MG_num": 2,
        "musle_point": [
            5,
            3
        ],
        "musle_point_sum": 8,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "DB_SQT",
        "kName": "덤벨 스쿼트",
        "eName": "Dumbbell Squat",
        "bName_ko": "하체",
        "bName": "Leg",
        "tool": 2,
        "tool_ko": "덤벨",
        "MG": "Quads/Glutes/Hamstrings",
        "MG_ko": "대퇴사두근/엉덩이/햄스트링",
        "eInfoType": 6,
        "body_region": "lower",
        "movement_type": "legs",
        "tool_en": "Dumbbell",
        "MG_num": 3,
        "musle_point": [
            5,
            4,
            3
        ],
        "musle_point_sum": 12,
        "category": "Dumbbell Squat",
        "main_ex": false
    },
    {
        "eTextId": "INC_PUSH_UP",
        "kName": "인클라인 푸시업",
        "eName": "Incline Push Ups",
        "bName_ko": "가슴",
        "bName": "Chest",
        "tool": 4,
        "tool_ko": "맨몸",
        "MG": "Upper Chest/Middle Chest/Triceps/Anterior Deltoid",
        "MG_ko": "가슴 상부/가슴 중앙/삼두근/어깨 전면",
        "eInfoType": 2,
        "body_region": "upper",
        "movement_type": "push",
        "tool_en": "Bodyweight",
        "MG_num": 4,
        "musle_point": [
            4,
            3,
            3,
            2
        ],
        "musle_point_sum": 12,
        "category": "Push Ups",
        "main_ex": false
    },
    {
        "eTextId": "WEI_HANG_KNEE_RAISE",
        "kName": "중량 행잉 니 레이즈",
        "eName": "Weighted Hanging Knee Raise",
        "bName_ko": "역도",
        "bName": "Lifting",
        "tool": 2,
        "tool_ko": "덤벨",
        "MG": "Lower Abs",
        "MG_ko": "하복근",
        "eInfoType": 6,
        "body_region": "etc",
        "movement_type": "etc",
        "tool_en": "Dumbbell",
        "MG_num": 1,
        "musle_point": [
            5
        ],
        "musle_point_sum": 5,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "LAT_WIDE_PULL",
        "kName": "레터럴 와이드 풀다운",
        "eName": "Lateral Wide Pull Down",
        "bName_ko": "등",
        "bName": "Back",
        "tool": 3,
        "tool_ko": "머신",
        "MG": "Lats/Upper Back/Biceps",
        "MG_ko": "광배근/등 상부/이두근",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "pull",
        "tool_en": "Machine",
        "MG_num": 3,
        "musle_point": [
            5,
            3,
            3
        ],
        "musle_point_sum": 11,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "HIP_THRUST_MAC",
        "kName": "힙 쓰러스트 머신",
        "eName": "Hip Thrust Machine",
        "bName_ko": "하체",
        "bName": "Leg",
        "tool": 3,
        "tool_ko": "머신",
        "MG": "Glutes/Hamstrings",
        "MG_ko": "엉덩이/햄스트링",
        "eInfoType": 6,
        "body_region": "lower",
        "movement_type": "legs",
        "tool_en": "Machine",
        "MG_num": 2,
        "musle_point": [
            5,
            3
        ],
        "musle_point_sum": 8,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "DEC_DB_BP",
        "kName": "디클라인 덤벨 벤치프레스",
        "eName": "Decline Dumbbell Bench Press",
        "bName_ko": "가슴",
        "bName": "Chest",
        "tool": 2,
        "tool_ko": "덤벨",
        "MG": "Lower Chest/Middle Chest/Triceps/Anterior Deltoid",
        "MG_ko": "가슴 하부/가슴 중앙/삼두근/어깨 전면",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "push",
        "tool_en": "Dumbbell",
        "MG_num": 4,
        "musle_point": [
            5,
            4,
            3,
            2
        ],
        "musle_point_sum": 14,
        "category": "Dumbbell Benchpress",
        "main_ex": false
    },
    {
        "eTextId": "DEC_CHEST_MAC",
        "kName": "디클라인 체스트 프레스 머신",
        "eName": "Decline Chest Press Machine",
        "bName_ko": "가슴",
        "bName": "Chest",
        "tool": 3,
        "tool_ko": "머신",
        "MG": "Lower Chest/Middle Chest/Triceps/Anterior Deltoid",
        "MG_ko": "가슴 하부/가슴 중앙/삼두근/어깨 전면",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "push",
        "tool_en": "Machine",
        "MG_num": 4,
        "musle_point": [
            5,
            4,
            3,
            2
        ],
        "musle_point_sum": 14,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "BW_CALF_RAISE",
        "kName": "맨몸 카프 레이즈",
        "eName": "Bodyweight Calf Raise",
        "bName_ko": "하체",
        "bName": "Leg",
        "tool": 4,
        "tool_ko": "맨몸",
        "MG": "Calves",
        "MG_ko": "종아리",
        "eInfoType": 2,
        "body_region": "lower",
        "movement_type": "legs",
        "tool_en": "Bodyweight",
        "MG_num": 1,
        "musle_point": [
            3
        ],
        "musle_point_sum": 3,
        "category": "Calf Raise",
        "main_ex": false
    },
    {
        "eTextId": "PISTOL_BOX_SQT",
        "kName": "피스톨 박스 스쿼트",
        "eName": "Pistol Box Squat",
        "bName_ko": "하체",
        "bName": "Leg",
        "tool": 4,
        "tool_ko": "맨몸",
        "MG": "Quads/Glutes/Hamstrings",
        "MG_ko": "대퇴사두근/엉덩이/햄스트링",
        "eInfoType": 2,
        "body_region": "lower",
        "movement_type": "legs",
        "tool_en": "Bodyweight",
        "MG_num": 3,
        "musle_point": [
            5,
            4,
            3
        ],
        "musle_point_sum": 12,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "INC_DB_CURL",
        "kName": "인클라인 덤벨 컬",
        "eName": "Incline Dumbbell Curl",
        "bName_ko": "팔",
        "bName": "Arm",
        "tool": 2,
        "tool_ko": "덤벨",
        "MG": "Biceps",
        "MG_ko": "이두근",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "pull",
        "tool_en": "Dumbbell",
        "MG_num": 1,
        "musle_point": [
            5
        ],
        "musle_point_sum": 5,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "BENCH_DIPS",
        "kName": "벤치 딥스",
        "eName": "Bench Dips",
        "bName_ko": "팔",
        "bName": "Arm",
        "tool": 4,
        "tool_ko": "맨몸",
        "MG": "Triceps/Lower Chest/Anterior Deltoid",
        "MG_ko": "삼두근/가슴 하부/어깨 전면",
        "eInfoType": 2,
        "body_region": "upper",
        "movement_type": "push",
        "tool_en": "Bodyweight",
        "MG_num": 3,
        "musle_point": [
            5,
            3,
            2
        ],
        "musle_point_sum": 10,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "INC_CABLE_FLY",
        "kName": "인클라인 케이블 플라이",
        "eName": "Incline Cable Fly",
        "bName_ko": "가슴",
        "bName": "Chest",
        "tool": 3,
        "tool_ko": "머신",
        "MG": "Upper Chest/Middle Chest",
        "MG_ko": "가슴 상부/가슴 중앙",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "push",
        "tool_en": "Machine",
        "MG_num": 2,
        "musle_point": [
            5,
            3
        ],
        "musle_point_sum": 8,
        "category": "Fly",
        "main_ex": false
    },
    {
        "eTextId": "STD_CABLE_FLY",
        "kName": "스탠딩 케이블 플라이",
        "eName": "Standing Cable Fly",
        "bName_ko": "가슴",
        "bName": "Chest",
        "tool": 3,
        "tool_ko": "머신",
        "MG": "Middle Chest/Lower Chest",
        "MG_ko": "가슴 중앙/가슴 하부",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "push",
        "tool_en": "Machine",
        "MG_num": 2,
        "musle_point": [
            5,
            3
        ],
        "musle_point_sum": 8,
        "category": "Fly",
        "main_ex": false
    },
    {
        "eTextId": "KB_DL",
        "kName": "케틀벨 데드리프트",
        "eName": "Kettlebell Deadlift",
        "bName_ko": "하체",
        "bName": "Leg",
        "tool": 6,
        "tool_ko": "케틀벨",
        "MG": "Hamstrings/Glutes/Lower Back/Forearms",
        "MG_ko": "햄스트링/엉덩이/등 하부/전완근",
        "eInfoType": 6,
        "body_region": "lower",
        "movement_type": "legs",
        "tool_en": "Kettlebell",
        "MG_num": 4,
        "musle_point": [
            5,
            4,
            3,
            2
        ],
        "musle_point_sum": 14,
        "category": "Dumbbell Deadlift",
        "main_ex": false
    },
    {
        "eTextId": "KB_SM_DL",
        "kName": "케틀벨 스모 데드리프트",
        "eName": "Kettlebell Sumo Deadlift",
        "bName_ko": "하체",
        "bName": "Leg",
        "tool": 6,
        "tool_ko": "케틀벨",
        "MG": "Adductors/Hamstrings/Glutes/Lower Back",
        "MG_ko": "내전근/햄스트링/엉덩이/등 하부",
        "eInfoType": 6,
        "body_region": "lower",
        "movement_type": "legs",
        "tool_en": "Kettlebell",
        "MG_num": 4,
        "musle_point": [
            5,
            4,
            4,
            3
        ],
        "musle_point_sum": 16,
        "category": "Dumbbell Deadlift",
        "main_ex": false
    },
    {
        "eTextId": "DB_SM_DL",
        "kName": "덤벨 스모 데드리프트",
        "eName": "Dumbbell Sumo Deadlift",
        "bName_ko": "하체",
        "bName": "Leg",
        "tool": 2,
        "tool_ko": "덤벨",
        "MG": "Adductors/Hamstrings/Glutes/Lower Back",
        "MG_ko": "내전근/햄스트링/엉덩이/등 하부",
        "eInfoType": 6,
        "body_region": "lower",
        "movement_type": "legs",
        "tool_en": "Dumbbell",
        "MG_num": 4,
        "musle_point": [
            5,
            4,
            4,
            3
        ],
        "musle_point_sum": 16,
        "category": "Dumbbell Deadlift",
        "main_ex": false
    },
    {
        "eTextId": "DB_LAT_LUNGE",
        "kName": "덤벨 레터럴 런지",
        "eName": "Dumbbell Lateral Lunge",
        "bName_ko": "하체",
        "bName": "Leg",
        "tool": 2,
        "tool_ko": "덤벨",
        "MG": "Adductors/Quads/Glutes/Hamstrings",
        "MG_ko": "내전근/대퇴사두근/엉덩이/햄스트링",
        "eInfoType": 6,
        "body_region": "lower",
        "movement_type": "legs",
        "tool_en": "Dumbbell",
        "MG_num": 4,
        "musle_point": [
            5,
            4,
            3,
            2
        ],
        "musle_point_sum": 14,
        "category": "Lunge",
        "main_ex": false
    },
    {
        "eTextId": "BW_LAT_LUNGE",
        "kName": "맨몸 레터럴 런지",
        "eName": "Bodyweight Lateral Lunge",
        "bName_ko": "하체",
        "bName": "Leg",
        "tool": 4,
        "tool_ko": "맨몸",
        "MG": "Adductors/Quads/Glutes/Hamstrings",
        "MG_ko": "내전근/대퇴사두근/엉덩이/햄스트링",
        "eInfoType": 2,
        "body_region": "lower",
        "movement_type": "legs",
        "tool_en": "Bodyweight",
        "MG_num": 4,
        "musle_point": [
            4,
            3,
            2,
            2
        ],
        "musle_point_sum": 11,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "HZ_LEG_PRESS",
        "kName": "수평 레그 프레스",
        "eName": "Horizontal Leg Press",
        "bName_ko": "하체",
        "bName": "Leg",
        "tool": 3,
        "tool_ko": "머신",
        "MG": "Quads/Hamstrings/Glutes",
        "MG_ko": "대퇴사두근/햄스트링/엉덩이",
        "eInfoType": 6,
        "body_region": "lower",
        "movement_type": "legs",
        "tool_en": "Machine",
        "MG_num": 3,
        "musle_point": [
            5,
            3,
            3
        ],
        "musle_point_sum": 11,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "BB_SM_SQT",
        "kName": "바벨 스모 스쿼트",
        "eName": "Barbell Sumo Squat",
        "bName_ko": "하체",
        "bName": "Leg",
        "tool": 1,
        "tool_ko": "바벨",
        "MG": "Adductors/Quads/Glutes/Hamstrings",
        "MG_ko": "내전근/대퇴사두근/엉덩이/햄스트링",
        "eInfoType": 6,
        "body_region": "lower",
        "movement_type": "legs",
        "tool_en": "Barbell",
        "MG_num": 4,
        "musle_point": [
            5,
            4,
            4,
            3
        ],
        "musle_point_sum": 16,
        "category": "Barbell Squat",
        "main_ex": false
    },
    {
        "eTextId": "KB_SM_SQT",
        "kName": "케틀벨 스모 스쿼트",
        "eName": "Kettlebell Sumo Squat",
        "bName_ko": "하체",
        "bName": "Leg",
        "tool": 6,
        "tool_ko": "케틀벨",
        "MG": "Adductors/Quads/Glutes/Hamstrings",
        "MG_ko": "내전근/대퇴사두근/엉덩이/햄스트링",
        "eInfoType": 6,
        "body_region": "lower",
        "movement_type": "legs",
        "tool_en": "Kettlebell",
        "MG_num": 4,
        "musle_point": [
            5,
            4,
            3,
            2
        ],
        "musle_point_sum": 14,
        "category": "Dumbbell Squat",
        "main_ex": false
    },
    {
        "eTextId": "KB_SM_AIR_SQT",
        "kName": "스모 에어 스쿼트",
        "eName": "Sumo Air Squat",
        "bName_ko": "하체",
        "bName": "Leg",
        "tool": 4,
        "tool_ko": "맨몸",
        "MG": "Adductors/Quads/Glutes/Hamstrings",
        "MG_ko": "내전근/대퇴사두근/엉덩이/햄스트링",
        "eInfoType": 2,
        "body_region": "lower",
        "movement_type": "legs",
        "tool_en": "Bodyweight",
        "MG_num": 4,
        "musle_point": [
            4,
            3,
            2,
            2
        ],
        "musle_point_sum": 11,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "SEAT_BB_SHD_PRESS",
        "kName": "시티드 바벨 숄더 프레스",
        "eName": "Seated Barbell Shoulder Press",
        "bName_ko": "어깨",
        "bName": "Shoulder",
        "tool": 1,
        "tool_ko": "바벨",
        "MG": "Anterior Deltoid/Lateral Deltoid/Triceps",
        "MG_ko": "어깨 전면/어깨 측면/삼두근",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "push",
        "tool_en": "Barbell",
        "MG_num": 3,
        "musle_point": [
            5,
            3,
            3
        ],
        "musle_point_sum": 11,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "SEAT_DB_SHD_PRESS",
        "kName": "시티드 덤벨 숄더 프레스",
        "eName": "Seated Dumbbell Shoulder Press",
        "bName_ko": "어깨",
        "bName": "Shoulder",
        "tool": 2,
        "tool_ko": "덤벨",
        "MG": "Anterior Deltoid/Lateral Deltoid/Triceps",
        "MG_ko": "어깨 전면/어깨 측면/삼두근",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "push",
        "tool_en": "Dumbbell",
        "MG_num": 3,
        "musle_point": [
            5,
            3,
            3
        ],
        "musle_point_sum": 11,
        "category": null,
        "main_ex": true
    },
    {
        "eTextId": "LOW_ROW_MC",
        "kName": "로우 로우 머신",
        "eName": "Low Row Machine",
        "bName_ko": "등",
        "bName": "Back",
        "tool": 3,
        "tool_ko": "머신",
        "MG": "Lats/Upper Back/Lower Back/Biceps",
        "MG_ko": "광배근/등 상부/등 하부/이두근",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "pull",
        "tool_en": "Machine",
        "MG_num": 4,
        "musle_point": [
            5,
            4,
            3,
            3
        ],
        "musle_point_sum": 15,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "HIGH_ROW_MC",
        "kName": "하이 로우 머신",
        "eName": "High Row Machine",
        "bName_ko": "등",
        "bName": "Back",
        "tool": 3,
        "tool_ko": "머신",
        "MG": "Upper Back/Lats/Lower Back/Biceps",
        "MG_ko": "등 상부/광배근/등 하부/이두근",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "pull",
        "tool_en": "Machine",
        "MG_num": 4,
        "musle_point": [
            5,
            4,
            3,
            3
        ],
        "musle_point_sum": 15,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "DONK_KICK",
        "kName": "덩키 킥",
        "eName": "Donkey Kick",
        "bName_ko": "하체",
        "bName": "Leg",
        "tool": 4,
        "tool_ko": "맨몸",
        "MG": "Glutes",
        "MG_ko": "엉덩이",
        "eInfoType": 2,
        "body_region": "lower",
        "movement_type": "legs",
        "tool_en": "Bodyweight",
        "MG_num": 1,
        "musle_point": [
            5
        ],
        "musle_point_sum": 5,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "DEC_SIT_UP",
        "kName": "디클라인 싯업",
        "eName": "Decline Sit Up",
        "bName_ko": "복근",
        "bName": "Abs",
        "tool": 4,
        "tool_ko": "맨몸",
        "MG": "Upper Abs",
        "MG_ko": "상복근",
        "eInfoType": 2,
        "body_region": "etc",
        "movement_type": "etc",
        "tool_en": "Bodyweight",
        "MG_num": 1,
        "musle_point": [
            4
        ],
        "musle_point_sum": 4,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "WEI_DEC_SIT_UP",
        "kName": "중량 디클라인 싯업",
        "eName": "Weighted Decline Sit Up",
        "bName_ko": "복근",
        "bName": "Abs",
        "tool": 7,
        "tool_ko": "기타",
        "MG": "Upper Abs",
        "MG_ko": "상복근",
        "eInfoType": 6,
        "body_region": "etc",
        "movement_type": "etc",
        "tool_en": "Etc",
        "MG_num": 1,
        "musle_point": [
            5
        ],
        "musle_point_sum": 5,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "INC_CHEST_PRESS_MC",
        "kName": "인클라인 체스트 프레스 머신",
        "eName": "Incline Chest Press Machine",
        "bName_ko": "가슴",
        "bName": "Chest",
        "tool": 3,
        "tool_ko": "머신",
        "MG": "Upper Chest/Middle Chest/Triceps/Anterior Deltoid",
        "MG_ko": "가슴 상부/가슴 중앙/삼두근/어깨 전면",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "push",
        "tool_en": "Machine",
        "MG_num": 4,
        "musle_point": [
            5,
            4,
            3,
            2
        ],
        "musle_point_sum": 14,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "CABLE_PULL_THRU",
        "kName": "케이블 풀 스루",
        "eName": "Cable Pull Through",
        "bName_ko": "하체",
        "bName": "Leg",
        "tool": 3,
        "tool_ko": "머신",
        "MG": "Glutes/Hamstrings/Quads",
        "MG_ko": "엉덩이/햄스트링/대퇴사두근",
        "eInfoType": 6,
        "body_region": "lower",
        "movement_type": "legs",
        "tool_en": "Machine",
        "MG_num": 3,
        "musle_point": [
            5,
            4,
            2
        ],
        "musle_point_sum": 11,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "CABLE_BO_LAT_RAISE",
        "kName": "벤트오버 케이블 레터럴 레이즈",
        "eName": "Bentover Cable Lateral Raise",
        "bName_ko": "어깨",
        "bName": "Shoulder",
        "tool": 3,
        "tool_ko": "머신",
        "MG": "Posterior Deltoid/Lateral Deltoid",
        "MG_ko": "어깨 후면/어깨 측면",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "pull",
        "tool_en": "Machine",
        "MG_num": 2,
        "musle_point": [
            5,
            3
        ],
        "musle_point_sum": 8,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "CABLE_UPRIGHT_ROW",
        "kName": "케이블 업라이트 로우",
        "eName": "Cable Upright Row",
        "bName_ko": "어깨",
        "bName": "Shoulder",
        "tool": 3,
        "tool_ko": "머신",
        "MG": "Traps/Lateral Deltoid/Biceps",
        "MG_ko": "승모근/어깨 측면/이두근",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "pull",
        "tool_en": "Machine",
        "MG_num": 3,
        "musle_point": [
            5,
            4,
            2
        ],
        "musle_point_sum": 11,
        "category": "Upright Row",
        "main_ex": false
    },
    {
        "eTextId": "TORSO_ROT_MC",
        "kName": "토르소 로테이션 머신",
        "eName": "Torso Rotation Machine",
        "bName_ko": "복근",
        "bName": "Abs",
        "tool": 3,
        "tool_ko": "머신",
        "MG": "Obliques",
        "MG_ko": "복사근",
        "eInfoType": 6,
        "body_region": "etc",
        "movement_type": "etc",
        "tool_en": "Machine",
        "MG_num": 1,
        "musle_point": [
            4
        ],
        "musle_point_sum": 4,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "RACK_PULL",
        "kName": "랙풀",
        "eName": "Rack Pull",
        "bName_ko": "등",
        "bName": "Back",
        "tool": 1,
        "tool_ko": "바벨",
        "MG": "Lower Back/Traps/Lats/Forearms",
        "MG_ko": "등 하부/승모근/광배근/전완근",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "pull",
        "tool_en": "Barbell",
        "MG_num": 4,
        "musle_point": [
            5,
            4,
            3,
            2
        ],
        "musle_point_sum": 14,
        "category": "Barbell Deadlift",
        "main_ex": false
    },
    {
        "eTextId": "KB_SHD_PRESS",
        "kName": "케틀벨 숄더 프레스",
        "eName": "Kettlebell Shoulder Press",
        "bName_ko": "어깨",
        "bName": "Shoulder",
        "tool": 6,
        "tool_ko": "케틀벨",
        "MG": "Anterior Deltoid/Lateral Deltoid/Triceps",
        "MG_ko": "어깨 전면/어깨 측면/삼두근",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "push",
        "tool_en": "Kettlebell",
        "MG_num": 3,
        "musle_point": [
            5,
            3,
            3
        ],
        "musle_point_sum": 11,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "INC_DB_SHD_PRESS",
        "kName": "인클라인 덤벨 숄더 프레스",
        "eName": "Incline Dumbbell Shoulder Press",
        "bName_ko": "어깨",
        "bName": "Shoulder",
        "tool": 2,
        "tool_ko": "덤벨",
        "MG": "Anterior Deltoid/Lateral Deltoid/Triceps",
        "MG_ko": "어깨 전면/어깨 측면/삼두근",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "push",
        "tool_en": "Dumbbell",
        "MG_num": 3,
        "musle_point": [
            5,
            3,
            3
        ],
        "musle_point_sum": 11,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "LIN_HACK_SQT_MC",
        "kName": "리니어 핵 스쿼트 머신",
        "eName": "Linear Hack Squat Machine",
        "bName_ko": "하체",
        "bName": "Leg",
        "tool": 3,
        "tool_ko": "머신",
        "MG": "Quads/Glutes/Hamstrings",
        "MG_ko": "대퇴사두근/엉덩이/햄스트링",
        "eInfoType": 6,
        "body_region": "lower",
        "movement_type": "legs",
        "tool_en": "Machine",
        "MG_num": 3,
        "musle_point": [
            5,
            4,
            3
        ],
        "musle_point_sum": 12,
        "category": "Machine Squat",
        "main_ex": true
    },
    {
        "eTextId": "SM_CALF_RAISE",
        "kName": "스미스머신 카프 레이즈",
        "eName": "Smith Machine Calf Raise",
        "bName_ko": "하체",
        "bName": "Leg",
        "tool": 3,
        "tool_ko": "머신",
        "MG": "Calves",
        "MG_ko": "종아리",
        "eInfoType": 6,
        "body_region": "lower",
        "movement_type": "legs",
        "tool_en": "Machine",
        "MG_num": 1,
        "musle_point": [
            5
        ],
        "musle_point_sum": 5,
        "category": "Calf Raise",
        "main_ex": false
    },
    {
        "eTextId": "DB_STD_CALF_RAISE",
        "kName": "덤벨 스탠딩 카프 레이즈",
        "eName": "Dumbbell Standing Calf Raise",
        "bName_ko": "하체",
        "bName": "Leg",
        "tool": 2,
        "tool_ko": "덤벨",
        "MG": "Calves",
        "MG_ko": "종아리",
        "eInfoType": 6,
        "body_region": "lower",
        "movement_type": "legs",
        "tool_en": "Dumbbell",
        "MG_num": 1,
        "musle_point": [
            4
        ],
        "musle_point_sum": 4,
        "category": "Calf Raise",
        "main_ex": false
    },
    {
        "eTextId": "MID_ROW_MC",
        "kName": "미드 로우 머신",
        "eName": "Middle Row Machine",
        "bName_ko": "등",
        "bName": "Back",
        "tool": 3,
        "tool_ko": "머신",
        "MG": "Upper Back/Lats/Biceps",
        "MG_ko": "등 상부/광배근/이두근",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "pull",
        "tool_en": "Machine",
        "MG_num": 3,
        "musle_point": [
            5,
            4,
            3
        ],
        "musle_point_sum": 12,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "CONCENT_CURL",
        "kName": "컨센트레이션 컬",
        "eName": "Concentration Curl",
        "bName_ko": "팔",
        "bName": "Arm",
        "tool": 2,
        "tool_ko": "덤벨",
        "MG": "Biceps",
        "MG_ko": "이두근",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "pull",
        "tool_en": "Dumbbell",
        "MG_num": 1,
        "musle_point": [
            5
        ],
        "musle_point_sum": 5,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "SEAT_KNEE_UP",
        "kName": "시티드 니업",
        "eName": "Seated Knee Up",
        "bName_ko": "복근",
        "bName": "Abs",
        "tool": 4,
        "tool_ko": "맨몸",
        "MG": "Lower Abs",
        "MG_ko": "하복근",
        "eInfoType": 2,
        "body_region": "etc",
        "movement_type": "etc",
        "tool_en": "Bodyweight",
        "MG_num": 1,
        "musle_point": [
            4
        ],
        "musle_point_sum": 4,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "INC_BB_FR_RAISE",
        "kName": "인클라인 바벨 프론트 레이즈",
        "eName": "Incline Barbell Front Raise",
        "bName_ko": "어깨",
        "bName": "Shoulder",
        "tool": 1,
        "tool_ko": "바벨",
        "MG": "Anterior Deltoid",
        "MG_ko": "어깨 전면",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "push",
        "tool_en": "Barbell",
        "MG_num": 1,
        "musle_point": [
            5
        ],
        "musle_point_sum": 5,
        "category": "Front Raise",
        "main_ex": false
    },
    {
        "eTextId": "INC_EZ_FRONT_RAISE",
        "kName": "인클라인 이지바 프론트 레이즈",
        "eName": "Incline EZ Bar Front Raise",
        "bName_ko": "어깨",
        "bName": "Shoulder",
        "tool": 5,
        "tool_ko": "이지바",
        "MG": "Anterior Deltoid",
        "MG_ko": "어깨 전면",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "push",
        "tool_en": "EZbar",
        "MG_num": 1,
        "musle_point": [
            5
        ],
        "musle_point_sum": 5,
        "category": "Front Raise",
        "main_ex": false
    },
    {
        "eTextId": "INC_DB_FRONT_RAISE",
        "kName": "인클라인 덤벨 프론트 레이즈",
        "eName": "Incline Dumbbell Front Raise",
        "bName_ko": "어깨",
        "bName": "Shoulder",
        "tool": 2,
        "tool_ko": "덤벨",
        "MG": "Anterior Deltoid",
        "MG_ko": "어깨 전면",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "push",
        "tool_en": "Dumbbell",
        "MG_num": 1,
        "musle_point": [
            5
        ],
        "musle_point_sum": 5,
        "category": "Front Raise",
        "main_ex": false
    },
    {
        "eTextId": "BB_INC_FRONT_RAISE",
        "kName": "바벨 인클라인 프론트 레이즈",
        "eName": "Barbell Incline Front Raise",
        "bName_ko": "어깨",
        "bName": "Shoulder",
        "tool": 1,
        "tool_ko": "바벨",
        "MG": "Anterior Deltoid",
        "MG_ko": "어깨 전면",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "push",
        "tool_en": "Barbell",
        "MG_num": 1,
        "musle_point": [
            5
        ],
        "musle_point_sum": 5,
        "category": "Front Raise",
        "main_ex": false
    },
    {
        "eTextId": "EZ_INC_FRONT_RAISE",
        "kName": "이지바 인클라인 프론트 레이즈",
        "eName": "EZ Bar Incline Front Raise",
        "bName_ko": "어깨",
        "bName": "Shoulder",
        "tool": 5,
        "tool_ko": "이지바",
        "MG": "Anterior Deltoid",
        "MG_ko": "어깨 전면",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "push",
        "tool_en": "EZbar",
        "MG_num": 1,
        "musle_point": [
            5
        ],
        "musle_point_sum": 5,
        "category": "Front Raise",
        "main_ex": false
    },
    {
        "eTextId": "DB_INC_FRONT_RAISE",
        "kName": "덤벨 인클라인 프론트 레이즈",
        "eName": "Dumbbell Incline Front Raise",
        "bName_ko": "어깨",
        "bName": "Shoulder",
        "tool": 2,
        "tool_ko": "덤벨",
        "MG": "Anterior Deltoid",
        "MG_ko": "어깨 전면",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "push",
        "tool_en": "Dumbbell",
        "MG_num": 1,
        "musle_point": [
            5
        ],
        "musle_point_sum": 5,
        "category": "Front Raise",
        "main_ex": false
    },
    {
        "eTextId": "EZ_REVERSE_CURL",
        "kName": "이지바 리버스 컬",
        "eName": "EZ Bar Reverse Curl",
        "bName_ko": "팔",
        "bName": "Arm",
        "tool": 5,
        "tool_ko": "이지바",
        "MG": "Forearms/Biceps",
        "MG_ko": "전완근/이두근",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "pull",
        "tool_en": "EZbar",
        "MG_num": 2,
        "musle_point": [
            5,
            3
        ],
        "musle_point_sum": 8,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "DEC_PUSH_UP",
        "kName": "디클라인 푸시업",
        "eName": "Decline Push Ups",
        "bName_ko": "가슴",
        "bName": "Chest",
        "tool": 4,
        "tool_ko": "맨몸",
        "MG": "Upper Chest/Middle Chest/Triceps/Anterior Deltoid",
        "MG_ko": "가슴 상부/가슴 중앙/삼두근/어깨 전면",
        "eInfoType": 2,
        "body_region": "upper",
        "movement_type": "push",
        "tool_en": "Bodyweight",
        "MG_num": 4,
        "musle_point": [
            5,
            3,
            3,
            3
        ],
        "musle_point_sum": 14,
        "category": "Push Ups",
        "main_ex": false
    },
    {
        "eTextId": "EZ_TRI_EXT",
        "kName": "이지바 트라이셉 익스텐션",
        "eName": "EZ Bar Tricep Extension",
        "bName_ko": "팔",
        "bName": "Arm",
        "tool": 5,
        "tool_ko": "이지바",
        "MG": "Triceps",
        "MG_ko": "삼두근",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "push",
        "tool_en": "EZbar",
        "MG_num": 1,
        "musle_point": [
            5
        ],
        "musle_point_sum": 5,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "SEAT_DB_LAT_RAISE",
        "kName": "시티드 덤벨 레터럴 레이즈",
        "eName": "Seated Dumbbell Lateral Raise",
        "bName_ko": "어깨",
        "bName": "Shoulder",
        "tool": 2,
        "tool_ko": "덤벨",
        "MG": "Lateral Deltoid/Posterior Deltoid",
        "MG_ko": "어깨 측면/어깨 후면",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "push",
        "tool_en": "Dumbbell",
        "MG_num": 2,
        "musle_point": [
            5,
            2
        ],
        "musle_point_sum": 7,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "SM_BULSPLIT_SQT",
        "kName": "스미스머신 불가리안 스플릿 스쿼트",
        "eName": "Smith Machine Bulgarian Split Squat",
        "bName_ko": "하체",
        "bName": "Leg",
        "tool": 3,
        "tool_ko": "머신",
        "MG": "Quads/Glutes/Hamstrings",
        "MG_ko": "대퇴사두근/엉덩이/햄스트링",
        "eInfoType": 6,
        "body_region": "lower",
        "movement_type": "legs",
        "tool_en": "Machine",
        "MG_num": 3,
        "musle_point": [
            5,
            4,
            3
        ],
        "musle_point_sum": 12,
        "category": "Lunge",
        "main_ex": false
    },
    {
        "eTextId": "INC_DB_PULL_OVER",
        "kName": "인클라인 덤벨 풀오버",
        "eName": "Incline Dumbbell Pull Over",
        "bName_ko": "가슴",
        "bName": "Chest",
        "tool": 2,
        "tool_ko": "덤벨",
        "MG": "Upper Chest/Middle Chest/Lats",
        "MG_ko": "가슴 상부/가슴 중앙/광배근",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "push",
        "tool_en": "Dumbbell",
        "MG_num": 3,
        "musle_point": [
            4,
            3,
            2
        ],
        "musle_point_sum": 9,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "DB_LYING_TRI_EXT",
        "kName": "덤벨 라잉 트라이셉 익스텐션",
        "eName": "Dumbbell Lying Tricep Extension",
        "bName_ko": "팔",
        "bName": "Arm",
        "tool": 2,
        "tool_ko": "덤벨",
        "MG": "Triceps",
        "MG_ko": "삼두근",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "push",
        "tool_en": "Dumbbell",
        "MG_num": 1,
        "musle_point": [
            5
        ],
        "musle_point_sum": 5,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "EZ_LYING_TRI_EXT",
        "kName": "이지바 라잉 트라이셉 익스텐션",
        "eName": "EZ Bar Lying Tricep Extension",
        "bName_ko": "팔",
        "bName": "Arm",
        "tool": 5,
        "tool_ko": "이지바",
        "MG": "Triceps",
        "MG_ko": "삼두근",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "push",
        "tool_en": "EZbar",
        "MG_num": 1,
        "musle_point": [
            5
        ],
        "musle_point_sum": 5,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "SM_HIP_THRUSTER",
        "kName": "스미스머신 힙 쓰러스트",
        "eName": "Smith Machine Hip Thrust",
        "bName_ko": "하체",
        "bName": "Leg",
        "tool": 3,
        "tool_ko": "머신",
        "MG": "Glutes/Hamstrings/Quads",
        "MG_ko": "엉덩이/햄스트링/대퇴사두근",
        "eInfoType": 6,
        "body_region": "lower",
        "movement_type": "legs",
        "tool_en": "Machine",
        "MG_num": 3,
        "musle_point": [
            5,
            3,
            2
        ],
        "musle_point_sum": 10,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "DB_SKULL_CRUSH",
        "kName": "덤벨 스컬 크러셔",
        "eName": "Dumbbell Skull Crusher",
        "bName_ko": "팔",
        "bName": "Arm",
        "tool": 2,
        "tool_ko": "덤벨",
        "MG": "Triceps",
        "MG_ko": "삼두근",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "push",
        "tool_en": "Dumbbell",
        "MG_num": 1,
        "musle_point": [
            5
        ],
        "musle_point_sum": 5,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "SEAT_BB_TRI_EXT",
        "kName": "시티드 바벨 트라이셉 익스텐션",
        "eName": "Seated Barbell Tricep Extension",
        "bName_ko": "팔",
        "bName": "Arm",
        "tool": 1,
        "tool_ko": "바벨",
        "MG": "Triceps",
        "MG_ko": "삼두근",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "push",
        "tool_en": "Barbell",
        "MG_num": 1,
        "musle_point": [
            5
        ],
        "musle_point_sum": 5,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "BICEP_CURL_MC",
        "kName": "바이셉 컬 머신",
        "eName": "Bicep Curl Machine",
        "bName_ko": "팔",
        "bName": "Arm",
        "tool": 3,
        "tool_ko": "머신",
        "MG": "Biceps",
        "MG_ko": "이두근",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "pull",
        "tool_en": "Machine",
        "MG_num": 1,
        "musle_point": [
            5
        ],
        "musle_point_sum": 5,
        "category": null,
        "main_ex": false
    },
    {
        "eTextId": "CHEST_FLY_MC",
        "kName": "체스트 플라이 머신",
        "eName": "Chest Fly Machine",
        "bName_ko": "가슴",
        "bName": "Chest",
        "tool": 3,
        "tool_ko": "머신",
        "MG": "Middle Chest/Upper Chest/Lower Chest",
        "MG_ko": "가슴 중앙/가슴 상부/가슴 하부",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "push",
        "tool_en": "Machine",
        "MG_num": 3,
        "musle_point": [
            5,
            4,
            3
        ],
        "musle_point_sum": 12,
        "category": "Fly",
        "main_ex": false
    },
    {
        "eTextId": "DB_FRONT_SQT",
        "kName": "덤벨 프론트 스쿼트",
        "eName": "Dumbbell Front Squat",
        "bName_ko": "하체",
        "bName": "Leg",
        "tool": 2,
        "tool_ko": "덤벨",
        "MG": "Quads/Glutes/Hamstrings",
        "MG_ko": "대퇴사두근/엉덩이/햄스트링",
        "eInfoType": 6,
        "body_region": "lower",
        "movement_type": "legs",
        "tool_en": "Dumbbell",
        "MG_num": 3,
        "musle_point": [
            5,
            3,
            2
        ],
        "musle_point_sum": 10,
        "category": "Dumbbell Squat",
        "main_ex": false
    },
    {
        "eTextId": "KNEE_PU",
        "kName": "무릎 푸시업",
        "eName": "Knee Push Ups",
        "bName_ko": "가슴",
        "bName": "Chest",
        "tool": 4,
        "tool_ko": "맨몸",
        "MG": "Middle Chest/Upper Chest/Triceps/Anterior Deltoid",
        "MG_ko": "가슴 중앙/가슴 상부/삼두근/어깨 전면",
        "eInfoType": 2,
        "body_region": "upper",
        "movement_type": "push",
        "tool_en": "Bodyweight",
        "MG_num": 4,
        "musle_point": [
            4,
            3,
            2,
            2
        ],
        "musle_point_sum": 11,
        "category": "Push Ups",
        "main_ex": false
    },
    {
        "eTextId": "CHEST_SUP_T_ROW",
        "kName": "체스트 서포티드 티바 로우",
        "eName": "Chest Supported T-bar Row",
        "bName_ko": "등",
        "bName": "Back",
        "tool": 3,
        "tool_ko": "머신",
        "MG": "Upper Back/Lats/Biceps/Traps",
        "MG_ko": "등 상부/광배근/이두근/승모근",
        "eInfoType": 6,
        "body_region": "upper",
        "movement_type": "pull",
        "tool_en": "Machine",
        "MG_num": 4,
        "musle_point": [
            5,
            4,
            3,
            3
        ],
        "musle_point_sum": 15,
        "category": null,
        "main_ex": false
    }
];
const ratiosData = {
    "M_ratio_weight": {
      "Leg Press": 1.8229,
      "Horizontal Leg Press": 1.315,
      "Reverse V Squat": 1.2341,
      "Conventional Deadlift": 1.1549,
      "Sumo Deadlift": 1.1459,
      "Barbell Box Squat": 1.1,
      "V Squat": 1.0988,
      "Romanian Deadlift": 1.022,
      "Rack Pull": 1.0,
      "Back Squat": 1.0,
      "Hack Squat Machine": 0.9899,
      "Chest Supported T-bar Row": 0.75,
      "Linear Hack Squat Machine": 0.85,
      "Smith Machine Deadlift": 0.8463,
      "Smith Machine Squat": 0.8349,
      "Smith Machine Hip Thrust": 0.8,
      "Middle Row Machine": 0.7,
      "Smith Machine Shrug": 0.7959,
      "Barbell Bench Press": 0.76,
      "Barbell Sumo Squat": 0.7897,
      "Barbell Shrug": 0.7781,
      "Hip Abduction Machine": 0.7777,
      "Dumbbell Front Squat": 0.75,
      "Leg Extension": 0.7483,
      "Barbell Row": 0.73,
      "Stiff Leg Deadlift": 0.7409,
      "Incline Dumbbell Pull Over": 0.73,
      "Barbell Hip Thrust": 0.7,
      "Pendlay Row": 0.7,
      "Chest Press Machine": 0.7088,
      "Hip Adduction Machine": 0.7,
      "Smith Machine Bench Press": 0.79,
      "Seated Cable Row": 0.6947,
      "Seated Row Machine": 0.6924,
      "Lat Pull Down": 0.6914,
      "Cable Crunch": 0.6882,
      "Barbell Split Squat": 0.68,
      "Smith Machine Row": 0.6799,
      "Incline Bench Press Machine": 0.6773,
      "Lateral Wide Pull Down": 0.6765,
      "Decline Chest Press Machine": 0.6737,
      "Hip Thrust Machine": 0.6729,
      "High Row Machine": 0.6565,
      "Smith Machine Incline Bench Press": 0.6542,
      "Barbell Incline Bench Press": 0.6502,
      "Low Row Machine": 0.6409,
      "Front Squat": 0.6408,
      "Incline Dumbbell Shoulder Press": 0.63,
      "Abdominal Crunch Machine": 0.6242,
      "Close-grip Bench Press": 0.6167,
      "Barbell Jump Squat": 0.6091,
      "Assisted Pull Up Machine": 0.6077,
      "Smith Machine Bulgarian Split Squat": 0.6,
      "Seated Barbell Tricep Extension": 0.6,
      "Leg Curl": 0.5817,
      "Pec Deck Fly Machine": 0.5811,
      "Incline Chest Press Machine": 0.5767,
      "Assisted Dip Machine": 0.5752,
      "Incline Barbell Front Raise": 0.57,
      "Barbell Incline Front Raise": 0.55,
      "EZ Bar Incline Front Raise": 0.55,
      "Incline EZ Bar Front Raise": 0.55,
      "Chest Fly Machine": 0.55,
      "EZ Bar Lying Tricep Extension": 0.55,
      "EZ Bar Tricep Extension": 0.55,
      "Bicep Curl Machine": 0.55,
      "Shoulder Press Machine": 0.5301,
      "Dumbbell Skull Crusher": 0.52,
      "Barbell Lunge": 0.5143,
      "T-bar Row Machine": 0.5141,
      "Smith Machine Split Squat": 0.5131,
      "Incline Dumbbell Front Raise": 0.5,
      "Dumbbell Incline Front Raise": 0.5,
      "Kettlebell Shoulder Press": 0.5,
      "Dumbbell Lying Tricep Extension": 0.5,
      "EZ Bar Reverse Curl": 0.5,
      "Seated Barbell Shoulder Press": 0.45,
      "Reverse Pec Deck Fly Machine": 0.4944,
      "Cable Push Down": 0.4898,
      "Overhead Press": 0.45,
      "Cable Upright Row": 0.48,
      "Cable Straight Arm Pulldown": 0.47,
      "Barbell Bulgarian Split Squat": 0.4683,
      "Barbell Incline Row": 0.4526,
      "Weighted Decline Sit Up": 0.45,
      "Smith Machine Calf Raise": 0.45,
      "Bentover Cable Lateral Raise": 0.45,
      "Concentration Curl": 0.12,
      "Jumping Jack": 0.443,
      "Barbell Lateral Lunge": 0.4403,
      "Push Press": 0.5,
      "Seated Dumbbell Lateral Raise": 0.43,
      "Face Pull": 0.4263,
      "Seated Knee Up": 0.42,
      "Cable Curl": 0.4065,
      "Cable Hammer Curl": 0.4057,
      "Dumbbell Standing Calf Raise": 0.4,
      "Arm Curl Machine": 0.3758,
      "Knee Push Ups": 0.368,
      "Weighted Dips": 0.3,
      "Barbell Upright Row": 0.3605,
      "Dumbbell Burpee": 0.35,
      "Torso Rotation Machine": 0.35,
      "Weighted Chin Up": 0.23,
      "Cable Crossover": 0.3397,
      "EZ Bar Upright Row": 0.3278,
      "Cable Pull Through": 0.3257,
      "Barbell Bicep Curl": 0.31,
      "Incline Dumbbell Bench Press": 0.3196,
      "EZ Bar Curl": 0.31,
      "Dumbbell Bench Press": 0.3174,
      "Dumbbell Shrug": 0.3102,
      "Dumbbell Sumo Deadlift": 0.2935,
      "Lying Tricep Extension": 0.2917,
      "Dumbbell Squat": 0.29,
      "Weighted Pull Up": 0.23,
      "One Arm Dumbbell Row": 0.2895,
      "Dumbbell Sumo Squat": 0.2838,
      "Dumbbell Row": 0.2832,
      "EZ Bar Preacher Curl": 0.2832,
      "Standing Cable Fly": 0.281,
      "Decline Dumbbell Bench Press": 0.28,
      "Kettlebell Sumo Deadlift": 0.2684,
      "Barbell Preacher Curl": 0.2667,
      "Bodyweight Calf Raise": 0.25,
      "Dumbbell Goblet Squat": 0.2617,
      "Seated Dumbbell Shoulder Press": 0.25,
      "Crunch": 0.2587,
      "Dumbbell Incline Row": 0.2581,
      "Incline Cable Fly": 0.2571,
      "Barbell Wrist Curl": 0.2546,
      "Sit Up": 0.2497,
      "Dumbbell Shoulder Press": 0.25,
      "Mountain Climber": 0.2475,
      "Kettlebell Deadlift": 0.2437,
      "Air Squat": 0.2422,
      "Heel Touch": 0.2412,
      "Cable Front Raise": 0.2389,
      "Kettlebell Sumo Squat": 0.2359,
      "Dumbbell Bulgarian Split Squat": 0.2326,
      "EZ Bar Wrist Curl": 0.2312,
      "Dumbbell Pullover": 0.2306,
      "Dumbbell Lunge": 0.4,
      "Decline Sit Up": 0.221,
      "Kettlebell Goblet Squat": 0.2193,
      "Dumbbell Split Squat": 0.2186,
      "Incline Dumbbell Fly": 0.2176,
      "Push Ups": 0.2146,
      "Barbell Front Raise": 0.2126,
      "Dumbbell Tricep Extension": 0.2117,
      "Dumbbell Side Bend": 0.2103,
      "Dumbbell Fly": 0.2069,
      "Weight Hyperextension": 0.2052,
      "EZ Bar Front Raise": 0.1995,
      "Leg Raise": 0.1957,
      "Dumbbell Upright Row": 0.1937,
      "Sumo Air Squat": 0.1912,
      "Cable Reverse Fly": 0.1869,
      "Decline Push Ups": 0.185,
      "Lunge": 0.1781,
      "Jump Squat": 0.1778,
      "Dumbbell Preacher Curl": 0.177,
      "Bench Dips": 0.1763,
      "V-up": 0.1729,
      "Donkey Kick": 0.1716,
      "Hanging Leg Raise": 0.1716,
      "Bodyweight Lateral Lunge": 0.1659,
      "Dumbbell Lateral Lunge": 0.1641,
      "Dumbbell Bicep Curl": 0.164,
      "Dumbbell Hammer Curl": 0.1636,
      "Incline Push Ups": 0.1595,
      "Hanging Knee Raise": 0.1576,
      "Abs Roll Out": 0.1559,
      "Incline Dumbbell Curl": 0.1545,
      "Burpee": 0.1541,
      "Back Extension": 0.151,
      "Hip Thrust": 0.1503,
      "Hyperextension": 0.1497,
      "Dumbbell Wrist Curl": 0.1463,
      "Russian Twist": 0.1387,
      "Dumbbell Lateral Raise": 0.1375,
      "Bentover Dumbbell Lateral Raise": 0.1355,
      "Dumbbell Front Raise": 0.1309,
      "Dips": 0.1306,
      "Cable Lateral Raise": 0.1275,
      "Inverted Row": 0.1245,
      "Dumbbell Kickback": 0.1224,
      "Seated Dumbbell Rear Lateral Raise": 0.1197,
      "Pistol Box Squat": 0.1161,
      "Hindu Push Ups": 0.1152,
      "Weighted Hanging Knee Raise": 0.1124,
      "Toes To Bar": 0.1118,
      "Pull Up": 0.075,
      "Chin Up": 0.075
  },  

    "F_ratio_weight":{
      "Leg Press": 1.6973,
      "Horizontal Leg Press": 1.5644,
      "Assisted Pull Up Machine": 1.4466,
      "Assisted Dip Machine": 1.4091,
      "Hip Abduction Machine": 1.3618,
      "Conventional Deadlift": 1.2049,
      "Sumo Deadlift": 1.204,
      "Barbell Box Squat": 1.08,
      "Rack Pull": 1.06,
      "Romanian Deadlift": 1.035,
      "Back Squat": 1.0,
      "Linear Hack Squat Machine": 0.95,
      "Hip Adduction Machine": 0.9211,
      "Reverse V Squat": 0.9211,
      "Smith Machine Hip Thrust": 0.92,
      "Barbell Hip Thrust": 0.9139,
      "Cable Crunch": 0.8788,
      "V Squat": 0.8447,
      "Barbell Split Squat": 0.55,
      "Dumbbell Front Squat": 0.82,
      "Hack Squat Machine": 0.8127,
      "Jumping Jack": 0.7993,
      "Hip Thrust Machine": 0.7823,
      "Smith Machine Bulgarian Split Squat": 0.78,
      "Smith Machine Deadlift": 0.7775,
      "Smith Machine Shrug": 0.7451,
      "Smith Machine Squat": 0.7429,
      "Stiff Leg Deadlift": 0.7339,
      "Chest Supported T-bar Row": 0.72,
      "Lat Pull Down": 0.7087,
      "Leg Extension": 0.7024,
      "Seated Cable Row": 0.6993,
      "Barbell Shrug": 0.6957,
      "Barbell Sumo Squat": 0.6916,
      "Abdominal Crunch Machine": 0.6869,
      "Middle Row Machine": 0.68,
      "Seated Row Machine": 0.6671,
      "Barbell Bench Press": 0.6,
      "Pendlay Row": 0.6433,
      "High Row Machine": 0.6314,
      "Barbell Row": 0.6122,
      "Barbell Jump Squat": 0.6074,
      "Low Row Machine": 0.5995,
      "Close-grip Bench Press": 0.4,
      "Front Squat": 0.5918,
      "Lateral Wide Pull Down": 0.5871,
      "Leg Curl": 0.5807,
      "Knee Push Ups": 0.5,
      "Smith Machine Row": 0.5744,
      "Cable Pull Through": 0.5693,
      "Barbell Lunge": 0.4,
      "Weighted Decline Sit Up": 0.55,
      "Crunch": 0.5473,
      "Chest Press Machine": 0.536,
      "Seated Knee Up": 0.5327,
      "Face Pull": 0.5263,
      "Cable Straight Arm Pulldown": 0.5193,
      "Smith Machine Split Squat": 0.5182,
      "Barbell Incline Bench Press": 0.5043,
      "Mountain Climber": 0.4942,
      "Smith Machine Bench Press": 0.4867,
      "Sit Up": 0.4794,
      "Barbell Bulgarian Split Squat": 0.4,
      "Pec Deck Fly Machine": 0.4763,
      "Air Squat": 0.4735,
      "Cable Push Down": 0.4664,
      "Incline Dumbbell Pull Over": 0.46,
      "Heel Touch": 0.4523,
      "Decline Chest Press Machine": 0.4514,
      "Smith Machine Incline Bench Press": 0.4362,
      "Reverse Pec Deck Fly Machine": 0.4327,
      "Donkey Kick": 0.4309,
      "Kettlebell Deadlift": 0.4307,
      "Bodyweight Calf Raise": 0.4281,
      "Overhead Press": 0.35,
      "Leg Raise": 0.4267,
      "Cable Upright Row": 0.42,
      "Push Press": 0.4,
      "Incline Dumbbell Shoulder Press": 0.41,
      "Barbell Incline Row": 0.4091,
      "Incline Bench Press Machine": 0.4034,
      "Dumbbell Burpee": 0.4,
      "Seated Barbell Shoulder Press": 0.35,
      "Cable Hammer Curl": 0.35,
      "Barbell Upright Row": 0.3968,
      "EZ Bar Upright Row": 0.3968,
      "T-bar Row Machine": 0.3919,
      "Kettlebell Sumo Deadlift": 0.3895,
      "V-up": 0.3893,
      "Lunge": 0.3891,
      "Burpee": 0.3882,
      "Jump Squat": 0.3878,
      "Cable Curl": 0.35,
      "Toes To Bar": 0.3,
      "Kettlebell Shoulder Press": 0.38,
      "Sumo Air Squat": 0.3785,
      "Decline Dumbbell Bench Press": 0.3781,
      "Barbell Preacher Curl": 0.35,
      "Decline Sit Up": 0.3712,
      "Hanging Leg Raise": 0.3708,
      "Chest Fly Machine": 0.37,
      "Bodyweight Lateral Lunge": 0.3648,
      "Incline Chest Press Machine": 0.3644,
      "Hip Thrust": 0.3622,
      "Dumbbell Sumo Squat": 0.3604,
      "Hanging Knee Raise": 0.3576,
      "Barbell Lateral Lunge": 0.3573,
      "Shoulder Press Machine": 0.3554,
      "Hyperextension": 0.3543,
      "Smith Machine Calf Raise": 0.35,
      "Abs Roll Out": 0.3459,
      "Cable Crossover": 0.345,
      "Kettlebell Sumo Squat": 0.3446,
      "Dumbbell Sumo Deadlift": 0.3437,
      "EZ Bar Curl": 0.3402,
      "EZ Bar Preacher Curl": 0.3399,
      "Barbell Bicep Curl": 0.336,
      "Incline Push Ups": 0.3358,
      "Arm Curl Machine": 0.3344,
      "Standing Cable Fly": 0.3314,
      "Back Extension": 0.3305,
      "Seated Barbell Tricep Extension": 0.33,
      "Dumbbell Shrug": 0.3269,
      "Dumbbell Standing Calf Raise": 0.32,
      "EZ Bar Lying Tricep Extension": 0.32,
      "Push Ups": 0.3166,
      "Bench Dips": 0.315,
      "Barbell Incline Front Raise": 0.31,
      "Incline Barbell Front Raise": 0.31,
      "EZ Bar Tricep Extension": 0.31,
      "Dumbbell Skull Crusher": 0.31,
      "Dumbbell Squat": 0.3011,
      "Dumbbell Lying Tricep Extension": 0.3,
      "Bicep Curl Machine": 0.3,
      "Weighted Dips": 0.25,
      "Pistol Box Squat": 0.2972,
      "EZ Bar Wrist Curl": 0.2968,
      "Dips": 0.2904,
      "EZ Bar Incline Front Raise": 0.29,
      "Incline EZ Bar Front Raise": 0.29,
      "Dumbbell Goblet Squat": 0.2882,
      "Dumbbell Incline Row": 0.2849,
      "Kettlebell Goblet Squat": 0.2842,
      "Barbell Wrist Curl": 0.2811,
      "Incline Dumbbell Front Raise": 0.28,
      "Dumbbell Incline Front Raise": 0.28,
      "EZ Bar Reverse Curl": 0.28,
      "Inverted Row": 0.2765,
      "Lying Tricep Extension": 0.2758,
      "Decline Push Ups": 0.275,
      "Hindu Push Ups": 0.2721,
      "Seated Dumbbell Lateral Raise": 0.27,
      "EZ Bar Front Raise": 0.2675,
      "Dumbbell Row": 0.2664,
      "Pull Up": 0.1,
      "Concentration Curl": 0.12,
      "Barbell Front Raise": 0.2589,
      "Cable Reverse Fly": 0.2586,
      "Chin Up": 0.1,
      "Bentover Cable Lateral Raise": 0.25,
      "Weighted Chin Up": 0.2,
      "Incline Dumbbell Bench Press": 0.2483,
      "Dumbbell Bench Press": 0.2472,
      "Cable Front Raise": 0.2445,
      "One Arm Dumbbell Row": 0.2397,
      "Dumbbell Split Squat": 0.234,
      "Dumbbell Bulgarian Split Squat": 0.232,
      "Dumbbell Lunge": 0.4,
      "Incline Cable Fly": 0.2225,
      "Weight Hyperextension": 0.2216,
      "Dumbbell Preacher Curl": 0.2194,
      "Dumbbell Side Bend": 0.2163,
      "Dumbbell Lateral Lunge": 0.2111,
      "Dumbbell Pullover": 0.208,
      "Seated Dumbbell Shoulder Press": 0.25,
      "Dumbbell Upright Row": 0.2062,
      "Torso Rotation Machine": 0.2,
      "Weighted Pull Up": 0.2,
      "Dumbbell Shoulder Press": 0.25,
      "Incline Dumbbell Fly": 0.1848,
      "Dumbbell Wrist Curl": 0.1771,
      "Dumbbell Fly": 0.1769,
      "Dumbbell Tricep Extension": 0.1661,
      "Dumbbell Hammer Curl": 0.1659,
      "Dumbbell Bicep Curl": 0.1615,
      "Incline Dumbbell Curl": 0.1604,
      "Russian Twist": 0.1604,
      "Cable Lateral Raise": 0.1595,
      "Dumbbell Front Raise": 0.126,
      "Dumbbell Lateral Raise": 0.1245,
      "Seated Dumbbell Rear Lateral Raise": 0.1192,
      "Bentover Dumbbell Lateral Raise": 0.1183,
      "Dumbbell Kickback": 0.1095,
      "Weighted Hanging Knee Raise": 0.1022
  },
};

document.addEventListener('DOMContentLoaded', () => {
    // --- DOM Elements ---
    const genderFilter = document.getElementById('gender-filter');
    const levelFilter = document.getElementById('level-filter');
    const freqFilter = document.getElementById('freq-filter');
    const splitFilter = document.getElementById('split-filter');
    const durationFilter = document.getElementById('duration-filter');
    const intensityFilter = document.getElementById('intensity-filter');
    const routineDisplay = document.getElementById('routine-display');
    const calculateWeightsBtn = document.getElementById('calculate-weights-btn');

    // --- Experience Inputs ---
    const experienceRadios = document.querySelectorAll('input[name="experience"]');
    const detailsBackSquat = document.getElementById('details-back-squat');
    const detailsBenchPress = document.getElementById('details-bench-press');
    const detailsOtherExercise = document.getElementById('details-other-exercise');

    const otherExerciseSearch = document.getElementById('other-exercise-search');
    const expWeightOther      = document.getElementById('exp-weight-other');
    const expRepsOther        = document.getElementById('exp-reps-other');
    const expOtherExerciseRadio = document.getElementById('exp-other-exercise');
    const exerciseOptionsDatalist = document.getElementById('exercise-options');

    let allTestCases = [];
    const kNameToExerciseDetailsMap = new Map();
    let M_ratio_weight = {};
    let F_ratio_weight = {};
    let isWeightsCalculated = false;

    // --- Functions ---

    const splitLabels = {
        '2': '분할 (상체 / 하체)',
        '3': '분할 (밀기 / 당기기 / 하체)',
        '4': '분할 (하체 / 가슴 / 등 / 어깨)',
        '5': '분할 (하체 / 가슴 / 등 / 어깨 / 팔+복근)'
    };

     // Populate datalist for other exercises
    kNameToExerciseDetailsMap.forEach((value, key) => {
        const option = document.createElement('option');
        option.value = key; // Use kName for display and selection
        exerciseOptionsDatalist.appendChild(option);
    });

    const updateSplitOptions = () => {
        const selectedFreq = freqFilter.value;
        const splitLabel = splitLabels[selectedFreq];
        const previouslySelectedSplit = splitFilter.value;

        splitFilter.innerHTML = '';

        const splitOption = document.createElement('option');
        splitOption.value = 'SPLIT';
        splitOption.textContent = splitLabel;
        splitFilter.appendChild(splitOption);

        const fbOption = document.createElement('option');
        fbOption.value = 'FB';
        fbOption.textContent = '무분할 (Full Body)';
        splitFilter.appendChild(fbOption);

        if (previouslySelectedSplit === 'SPLIT' || previouslySelectedSplit === 'FB') {
            splitFilter.value = previouslySelectedSplit;
        }
    };

    const getRepsArray = (level, mgNum) => {
        if (mgNum <= 2) {
            switch (level) {
                case 'Beginner': return [20, 20, 15, 15];
                case 'Novice': return [20, 20, 15, 15, 15];
                default: return [20, 20, 15, 15, 12, 12];
            }
        } else {
            const levelSets = {
                "Beginner": [15, 12, 10, 8],
                "Novice": [15, 12, 10, 9, 8],
                "Intermediate": [15, 12, 10, 10, 8, 8],
                "Advanced": [15, 12, 10, 10, 8, 8],
                "Elite": [15, 12, 10, 10, 8, 8]
            };
            return levelSets[level] || levelSets['Intermediate'];
        }
    };

    // New helper function to apply range and rounding
    const formatWeightRange = (baseWeight, reps, intensity, tool_en) => {
        const tool = (tool_en || 'etc').toLowerCase();
        
        // Calculate the base weight for the set (Normal intensity)
        let normalSetWeight = baseWeight;

        // Determine the intensity multiplier
        let intensityMultiplier = 1.0;
        if (intensity === 'Low') {
            intensityMultiplier = 0.9;
        } else if (intensity === 'High') {
            intensityMultiplier = 1.1;
        }

        // Calculate the effective weight based on intensity
        let effectiveWeight = normalSetWeight * intensityMultiplier;

        let roundedEffectiveWeight;
        // Apply rounding and Math.max to this effectiveWeight
        if (tool === 'dumbbell' || tool === 'kettlebell') {
            roundedEffectiveWeight = Math.round(effectiveWeight / 2) * 2;
        } else if (tool === 'barbell' || tool === 'machine' || tool === 'ezbar') {
            roundedEffectiveWeight = Math.round(effectiveWeight / 5) * 5;
        } else {
            roundedEffectiveWeight = Math.round(effectiveWeight / 2.5) * 2.5;
        }
        if (tool === 'barbell') roundedEffectiveWeight = Math.max(roundedEffectiveWeight, 20);
        else if (tool === 'dumbbell') roundedEffectiveWeight = Math.max(roundedEffectiveWeight, 2);
        else if (tool === 'machine') roundedEffectiveWeight = Math.max(roundedEffectiveWeight, 5);
        else if (tool === 'ezbar') roundedEffectiveWeight = Math.max(roundedEffectiveWeight, 10);
        else if (tool === 'kettlebell') roundedEffectiveWeight = Math.max(roundedEffectiveWeight, 4);
        else if (tool === 'etc') roundedEffectiveWeight = Math.max(roundedEffectiveWeight, 0);

        // Return the single rounded value
        return `${roundedEffectiveWeight}kg ${reps}회`;
    };

    const calculateSetStrings = (exercise, estimated1RM, repsArray, level, intensity) => {
        const { eName, eInfoType, tool_en } = exercise;
        const exerciseRatio = M_ratio_weight[eName] || F_ratio_weight[eName];
        const isAssistedMachine = eName === "Assisted Pull Up Machine" || eName === "Assisted Dip Machine";

        // --- Assisted Machine Logic ---
        if (isAssistedMachine && exerciseRatio) {
            if (level === 'Beginner' || level === 'Novice') {
                return repsArray.map((reps, index) => {
                    let baseWeight = estimated1RM;
                    if (index >= 2) {
                        baseWeight *= 0.8;
                    }
                    return formatWeightRange(baseWeight, reps, intensity, tool_en);
                });
            } else { // Intermediate, Advanced, Elite
                return repsArray.map(reps => {
                    let baseWeight;
                    if (reps >= 12) {
                        baseWeight = estimated1RM;
                    }
                    else if (reps >= 10) {
                        baseWeight = estimated1RM * 0.8;
                    }
                    else {
                        baseWeight = estimated1RM * 0.6;
                    }
                    return formatWeightRange(baseWeight, reps, intensity, tool_en);
                });
            }
        }
        // --- eInfoType === 2 Logic ---
        else if (eInfoType === 2) {
            if (exerciseRatio) {
                const customReps = Math.round(estimated1RM);
                const numSets = repsArray.length;
                // This case is for bodyweight/custom reps, no weight range needed here.
                return Array(numSets).fill(`${customReps}회`);
            } else {
                return ['Calculation not available.'];
            }
        }
        // --- Other Exercises Logic (Main Target) ---
        else {
            if (exerciseRatio) {
                return repsArray.map((reps, index) => {
                    let baseWeight;
                    if (index === 0) { // Set 1
                        baseWeight = estimated1RM * 0.4;
                    }
                    else if (index === 1) { // Set 2
                        baseWeight = estimated1RM * 0.6;
                    }
                    else { // Working sets
                        baseWeight = estimated1RM / (1 + reps / 30);
                    }
                    return formatWeightRange(baseWeight, reps, intensity, tool_en);
                });
            } else {
                return ['Calculation not available.'];
            }
        }
    };

    const updateRoutineDisplay = () => {
        isWeightsCalculated = false;
        const selectedGender = genderFilter.value;
        const selectedLevel = levelFilter.value;
        const selectedFreq = parseInt(freqFilter.value, 10);
        const selectedSplit = splitFilter.value;
        const selectedDuration = parseInt(durationFilter.value, 10);

        const foundCase = allTestCases.find(c =>
            c.gender === selectedGender &&
            c.level === selectedLevel &&
            c.freq === selectedFreq &&
            c.split_id === selectedSplit
        );

        if (foundCase && foundCase.routine) {
            if (foundCase.routine.error) {
                routineDisplay.innerHTML = `<p style="color: #ffcc00;">Routine generation failed for this case: ${foundCase.routine.error}</p>`;
            } else {
                let routineToDisplay = JSON.parse(JSON.stringify(foundCase.routine));
                Object.values(routineToDisplay).forEach(exercises => {
                    if (selectedDuration === 45) {
                        if (exercises.length > 1) exercises.pop();
                    } else if (selectedDuration === 30) {
                        if (exercises.length > 1) exercises.pop();
                        if (exercises.length > 1) exercises.pop();
                    }
                });

                let html = '';
                for (const [day, exercises] of Object.entries(routineToDisplay)) {
                    html += `<div class="day-header">${day} (운동 수: ${exercises.length})</div>`;
                    html += `<ul>`;
                    exercises.forEach(kName => {
                        const bName = kNameToExerciseDetailsMap.get(kName)?.bName || 'N/A';
                        html += `<li data-kname="${kName}">${bName} - ${kName}</li>`;
                    });
                    html += `</ul>`;
                }
                routineDisplay.innerHTML = html;
            }
        } else {
            routineDisplay.innerHTML = '<p>No matching routine found for the selected criteria.</p>';
        }
    };

    const renderCalculatedWeights = () => {
        const selectedExperience = document.querySelector('input[name="experience"]:checked').value;
        const level = levelFilter.value;
        const gender = genderFilter.value;
        const intensity = intensityFilter.value;

        let base1RM = 0;
        let baseExerciseName = '';

        if (selectedExperience === 'unknown') {
            let levelTo1RM;
            if (gender === 'M') {
                levelTo1RM = { "Beginner": 20, "Novice": 40, "Intermediate": 60, "Advanced": 80, "Elite": 100 };
                base1RM = levelTo1RM[level] || 60;
            } else {
                levelTo1RM = { "Beginner": 20, "Novice": 35, "Intermediate": 50, "Advanced": 65, "Elite": 80 };
                base1RM = levelTo1RM[level] || 50;
            }
            baseExerciseName = 'Back Squat';
        } else {
            let weightInput, repsInput, selectedExerciseKName;
            if (selectedExperience === 'back-squat') {
                weightInput = document.getElementById('exp-weight-bs');
                repsInput = document.getElementById('exp-reps-bs');
                baseExerciseName = 'Back Squat';
            } else if (selectedExperience === 'bench-press') {
                weightInput = document.getElementById('exp-weight-bp');
                repsInput = document.getElementById('exp-reps-bp');
                baseExerciseName = 'Barbell Bench Press';
            } else if (selectedExperience === 'other-exercise') { // ADDED
                selectedExerciseKName = otherExerciseSearch.value; // ADDED
                weightInput = expWeightOther; // ADDED
                repsInput = expRepsOther; // ADDED

                const exerciseDetails = kNameToExerciseDetailsMap.get(selectedExerciseKName); // ADDED
                if (!exerciseDetails) { // ADDED
                    alert('선택한 운동을 찾을 수 없습니다. 정확한 운동 이름을 입력하거나 목록에서 선택해주세요.'); // ADDED
                    return; // ADDED
                }
                baseExerciseName = exerciseDetails.eName; // Use eName for ratio lookup // ADDED
            }

            const weight = parseFloat(weightInput.value);
            const reps = parseInt(repsInput.value, 10);

            if (isNaN(weight) || isNaN(reps) || reps <= 0) {
                alert('운동 경험(백스쿼트, 벤치프레스 또는 기타 운동)을 선택하고 무게, 반복횟수를 올바르게 입력해주세요.');
                return;
            }

            if (reps === 1) {
                base1RM = weight;
            } else {
                base1RM = weight * (1 + reps / 30);
            }
        }

        const ratios = (gender === 'M') ? M_ratio_weight : F_ratio_weight;
        const baseRatio = ratios[baseExerciseName] || 1;
        const squat1RM = (base1RM / baseRatio);

        document.querySelectorAll('#routine-display li').forEach(item => {
            let child = item.lastElementChild;
            while (child && (child.tagName === 'SPAN' && child.classList.contains('exercise-sets') || child.tagName === 'BR')) {
                item.removeChild(child);
                child = item.lastElementChild;
            }
        });

        document.querySelectorAll('#routine-display li').forEach(item => {
            const kName = item.dataset.kname;
            if (!kName) return;

            const exerciseDetails = kNameToExerciseDetailsMap.get(kName);
            if (!exerciseDetails) return;

            const exerciseRatio = ratios[exerciseDetails.eName];
            let estimated1RM = 0;

            if (exerciseRatio) {
                estimated1RM = squat1RM * exerciseRatio;
                // Intensity adjustment will now be handled in calculateSetStrings
            }

            const repsArray = getRepsArray(level, exerciseDetails.MG_num || 0);
            let setStrings = calculateSetStrings(exerciseDetails, estimated1RM, repsArray, level, intensity);

            if (exerciseDetails.eName === "Weighted Pull Up" || exerciseDetails.eName === "Weighted Chin Up") {
                if (setStrings.length > 0) {
                    setStrings.pop(); // Reduce sets by 1
                }
                setStrings = setStrings.map(s => {
                    if (s.includes('회')) {
                        return s.replace(/(\d+)(회)/, (match, reps, unit) => {
                            const newReps = Math.max(1, parseInt(reps) - 5);
                            return `${newReps}${unit}`;
                        });
                    }
                    return s;
                });
            }

            const setsSpan = document.createElement('span');
            setsSpan.className = 'exercise-sets';
            setsSpan.textContent = setStrings.join(' / ');

            item.appendChild(document.createElement('br'));
            item.appendChild(setsSpan);
        });

        isWeightsCalculated = true;
    };

    // --- Initial Setup & Event Listeners ---

    // Process embedded data
    allTestCases = allTestCasesData;
    const exerciseCatalog = exerciseCatalogData;
    M_ratio_weight = ratiosData.M_ratio_weight;
    F_ratio_weight = ratiosData.F_ratio_weight;

    exerciseCatalog.forEach(exercise => {
        if (exercise.kName) {
            kNameToExerciseDetailsMap.set(exercise.kName, exercise);
        }
    });

    // Populate datalist for other exercises (ADDED)
    kNameToExerciseDetailsMap.forEach((value, key) => {
        const option = document.createElement('option');
        option.value = key; // Use kName for display and selection
        exerciseOptionsDatalist.appendChild(option);
    });

    console.log(`${allTestCases.length} test cases loaded from embedded data.`);
    console.log(`${kNameToExerciseDetailsMap.size} exercises mapped from embedded data.`);
    console.log(`Weight ratios loaded from embedded data.`);

    // Filters that reset the entire routine
    [genderFilter, levelFilter, splitFilter].forEach(filter => {
        filter.addEventListener('change', updateRoutineDisplay);
    });

    freqFilter.addEventListener('change', () => {
        updateSplitOptions();
        updateRoutineDisplay();
    });

    // Duration filter: Shortens routine, but keeps weights if they were calculated
    durationFilter.addEventListener('change', () => {
        const wereWeightsCalculated = isWeightsCalculated;
        updateRoutineDisplay();
        if (wereWeightsCalculated) {
            renderCalculatedWeights();
        }
    });

    // Intensity filter: Only recalculates weights if they are already displayed
    intensityFilter.addEventListener('change', () => {
        if (isWeightsCalculated) {
            renderCalculatedWeights();
        }
    });
    const updateExperienceDetails = () => {
    const selectedValue = document.querySelector('input[name="experience"]:checked').value;

    // 공통: other-exercise 관련 입력 기본 숨김
    otherExerciseSearch.classList.add('hidden');
    expWeightOther.classList.add('hidden');
    expRepsOther.classList.add('hidden');

    if (selectedValue === 'back-squat') {
        detailsBackSquat.classList.remove('hidden');
        detailsBenchPress.classList.add('hidden');
    } else if (selectedValue === 'bench-press') {
        detailsBackSquat.classList.add('hidden');
        detailsBenchPress.classList.remove('hidden');
    } else if (selectedValue === 'other-exercise') {
        detailsBackSquat.classList.add('hidden');
        detailsBenchPress.classList.add('hidden');
        // 실제로 존재하는 입력칸만 보여주기
        otherExerciseSearch.classList.remove('hidden');
        expWeightOther.classList.remove('hidden');
        expRepsOther.classList.remove('hidden');
    } else {
        // unknown
        detailsBackSquat.classList.add('hidden');
        detailsBenchPress.classList.add('hidden');
    }
    };

    // Set initial view
    updateSplitOptions();
    updateRoutineDisplay();

    // --- Experience Radio Logic ---
    // Event listener for otherExerciseSearch to select its radio button (ADDED)
    otherExerciseSearch.addEventListener('focus', () => {
        if (expOtherExerciseRadio) expOtherExerciseRadio.checked = true;
        updateExperienceDetails();
    });
    otherExerciseSearch.addEventListener('input', () => {
        if (expOtherExerciseRadio) expOtherExerciseRadio.checked = true;
        updateExperienceDetails();
    });

    updateExperienceDetails();

    // --- Weight Calculation Button ---
    calculateWeightsBtn.addEventListener('click', renderCalculatedWeights);
});
